[
  {
    "id": "69888903405efb6d24dba0897f4095c2",
    "title": "Dogecoin Has Made It to Wall Street",
    "content": "Are meme coins a legitimate investment now? Well, Wall Street seems to think so. Last week, REX Financial and Osprey Funds launched the first Dogecoin exchange-traded fund (ETF).\n\nBasically, an ETF is a bundle of assets, which can include stocks, bonds, commodities, and now memecoins, that trades on the stock market as a single stock. A classic example are S&P 500 ETFs, funds that own shares of every company on the major Wall Street index\n\nIn the case of the REX-Osprey Doge ETF, the fund uses financial derivatives—futures contracts, swap agreements, and other financial instruments tied to Dogecoin’s price—to create an investment that mirrors the coin’s moves. In other words, investors aren’t purchasing Dogecoin itself. In a press release, the firms said the goal is to give people exposure to the meme coin’s potential rewards and risks via a regular brokerage account.\n\n“Dogecoin’s value is often influenced by social media trends and community sentiment. This ETF captures that unique dynamic, while investors should remain aware that memecoins can experience significant volatility and rapid price swings,” the fund’s factsheet warns.\n\nStill, demand for this type of investment appears to be significant, with nearly $17 million flowing into the fund on its first day.\n\nCompetitors like 21Shares, Grayscale, and Bitwise are already lining up their own Dogecoin ETFs, pending regulatory approval.\n\nThis is all good news for people who already own Dogecoin, as its price has gone up 10% this month.\n\nThe launch of this ETF (and other related funds that are on the way) further legitimizes cryptocurrencies in general as a mainstream investment. Just last year, the U.S. Securities and Exchange Commission (SEC) approved the first Bitcoin ETFs, a full 15 years after Bitcoin debuted in 2009 as a digital currency.\n\nNow it’s memecoins’ turn. Based on internet jokes and trends, these cryptocurrencies are not usually considered serious moneymakers. Dogecoin, one of the original memecoins, is itself derived from a 2013 meme featuring silly photos of a Shiba Inu dog paired with even goofier captions in comics sans font. Unlike other cryptocurrencies, memecoins don’t even pretend to have a utility, and most lose all of their value in rapid pump-and-dump frenzies—if they gain value at all, that is.\n\nThe launch of the Dogecoin ETF last week also happened to coincide with new SEC rules that ease the requirements for launching crypto ETFs. This move is another example of the Trump administration’s notably pro-crypto stance and disregard for the related investor risks associated with the space.\n\nSince the start of his second term, Trump’s administration has shepharded through industry-friendly regulations for stablecoins and dropped investigations into Jesse Powell, the founder of the cryptocurrency exchange Kraken, as well as the crypto futures betting platform Polymarket.\n\nAdditionally, Trump signed an executive order in March establishing a federal strategic Bitcoin reserve and a digital asset stockpile. He also named David Sacks, former PayPal COO, as the White House AI & Crypto Czar.\n\nTrump’s crypto-friendly policies make sense when you consider that he’s managed to make a multi-billion-dollar fortune from the industry. According to a Forbes analysis, much of his current net worth now comes from crypto.\n\nNow he stands to possibly make even more money, as REX and Osprey filed for permission in January to launch ETFs for several other cryptocurrencies, including Trump’s own memecoin.",
    "url": "https://gizmodo.com/dogecoin-has-made-it-to-wall-street-2000663698",
    "source": "newsapi",
    "author": "Bruce Gil, Matt Novak",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "dogecoin",
      "memecoins",
      "etfs",
      "other",
      "investment",
      "funds",
      "cryptocurrencies",
      "crypto",
      "meme",
      "coins"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:29:37.168303+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": "2025-09-25T15:40:25+00:00"
  },
  {
    "id": "926280a5cc7cddad878134368387831c",
    "title": "The Loophole Turning Stablecoins Into a Trillion-Dollar Fight",
    "content": "On July 18, after more than a decade of legal uncertainty, US lawmakers finally brought part of the crypto industry into the regulatory fold. The newly signed Guiding and Establishing National Innovation for US Stablecoins (GENIUS) Act requires issuers of stablecoins—cryptocurrencies that claim a value tied to a more stable asset—to fully back their tokens with cash or short-term Treasury bonds, submit to audits, and follow anti-money-laundering rules, among other conditions. In an effort to cement stablecoins as a form of “digital cash” rather than a place to park money, the law also bars stablecoin issuers from paying interest.\n\nBut crucially, the law doesn’t ban crypto exchanges from offering customers rewards on their stablecoin holdings, meaning stablecoin holders are still able to receive financial incentives that look a lot like interest. Today, Coinbase customers can earn a 4.1 percent annual reward if they hold a stablecoin called USDC on the platform. The return is similar to what customers might expect from a high-yield savings account.\n\nBanking industry groups say this represents a major regulatory loophole and could push people to take their money out of banks and put it in crypto exchanges, which continue to be far less regulated. Some crypto exchanges offer higher rewards than what’s available from a high-yield savings account (while rates vary, many offer an annual yield of 4.25 percent). Kraken, for example, promotes 5.5 percent “rewards on your USDC holdings.”\n\nEven without rewards, stablecoins pose a potential risk for consumers compared to bank deposits and cash. Unlike checking or savings accounts, cryptocurrencies are not FDIC-insured, meaning that if a stablecoin issuer collapses, the US government won’t directly step in to make consumer deposits whole.\n\nSome regulators and crypto advocates say the GENIUS Act’s stringent reserve requirements and bankruptcy protections obviate the need for FDIC insurance. But stablecoins have collapsed in the past, and research from the Bank for International Settlements (BIS) suggests that even the “least volatile” stablecoins, like the ones now the standard under GENIUS, “rarely trade exactly at par” to the value they claim to have. This brings into question “stablecoins’ ability to serve as a reliable means of payment,” BIS researchers write.\n\nResearch from the Federal Reserve Bank of Kansas City suggests increased demand for stablecoins could have knock-on effects for the economy. “If stablecoins are purchased out of bank deposit accounts, that necessarily means that there are less funds available for banks to loan,” says Stefan Jacewitz, assistant vice president of the Kansas City Fed. He says incentives like rewards “could induce shifts in funding that are faster and larger than they would have been otherwise.”",
    "url": "https://www.wired.com/story/genius-act-loophole-stablecoins-banks/",
    "source": "newsapi",
    "author": "Adam Willems",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "stablecoins",
      "crypto",
      "stablecoin",
      "rewards",
      "than",
      "bank",
      "genius",
      "their",
      "cash",
      "exchanges"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:29:38.800814+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": "2025-09-03T11:00:00+00:00"
  },
  {
    "id": "41899b9a2005bfa6b7d50a9e57c43090",
    "title": "Robinhood Is Building a Social Network for Following Market Movers’ Trades",
    "content": "Social media has an unprecedented sway over stock prices.\n\nFinancial influencers give stock advice on YouTube and TikTok. Trading communities on X and Reddit resurrect financially undesirable stocks from their ashes just for the sake of memes. It’s undeniable that a growing subset of investors are adamant on using platforms like X, Reddit, YouTube, and TikTok to make their financial decisions. The X-based finance community even has a name for themselves: FinTwit.\n\nPopular online brokerage Robinhood has decided to take advantage of that. The company announced on Wednesday that it will be adding a social media feed to its mobile app.\n\nCalled Robinhood Social, the feed will allow users to post the trades that they make and follow along with other traders, including famous investors and members of Congress. These public figures are of course not all on Robinhood, but their publicly-reported trades will be posted via avatars. Users will be able to share trades in stocks, crypto, options, and other assets.\n\n“We’ve heard from active traders that they rely heavily on social media to navigate the markets. But it’s harder than ever to understand what’s real and what isn’t,” the company shared in a press release on Wednesday.\n\nAll posted trades will be verified and live, the company said. Users will be able to discuss strategies with each other and see the real-time performance rates of the traders that they follow.\n\nThe feed will first launch by invitation only to some American customers early next year with broader availability to follow.\n\nIs this copy-trading?\n\nYes, but also no. Copy-trading is a technically legal but often scrutinized practice in the U.S. There are many platforms that offer it, most famously the Israeli company eToro, which is available to U.S. residents in most states and allows users to automatically copy the trades of other investors.\n\nIn contrast, Robinhood’s new platform doesn’t copy trades automatically. It shows users the trades in real time and the user can decide to copy them manually.\n\nAfter the regulatory scrutiny it faced in the lead up to its IPO in 2021, Robinhood might be acting extra careful not to raise any regulatory eyebrows.\n\nBefore its IPO, Robinhood had to get rid of some features — including a confetti animation that popped whenever you placed a trade — that regulators worried were gamifying and encouraging short-term investing.\n\nCEO Vlad Tenev himself has suggested, as recently as last December, that “copy-trading could become of greater interest to regulators.”\n\nBut it’s still significant and shows the power of social media-driven trading that Robinhood will make the jump, despite the potential regulatory risks its CEO deems are on the horizon.\n\nSocial media’s stock power\n\nA growing subset of traders rely on social media to make decisions. It has led to the rise of meme stocks, like GameStop and AMC Theaters. The infamous meme stock trader Roaring Kitty led to the “Mother of All Short Squeezes” in 2021 (and another smaller short squeeze in 2024) simply by posting about GameStop stock on X and Reddit.\n\nOne post from a public figure with a large following on social media can make a stock spiral down or skyrocket, like when Elon Musk’s tweet expressing his “kinda love” for Etsy in 2021 bumped the stock up. Musk is especially fond of his financial influence on social media, and has utilized this power many times, particularly in relation to his favorite memecoin Dogecoin.\n\nThere are obviously many downsides to this. Just because an investor or a financial memelord makes a trade decision, it doesn’t necessarily mean that decision is wise. A financial decision should be made after weighing all the risks, not driven by FOMO.\n\nAnd not every financial influencer is trustworthy. There have been several notable cases of money laundering and stock manipulation schemes conducted by so-called finance influencers.",
    "url": "https://gizmodo.com/robinhood-launches-social-feed-stock-trades-2000656886",
    "source": "newsapi",
    "author": "Ece Yildirim, Bruce Gil, Matt Novak, Kyle Barr",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "social",
      "stock",
      "trades",
      "media",
      "financial",
      "robinhood",
      "make",
      "users",
      "company",
      "other"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:29:39.845091+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": "2025-09-10T18:24:45+00:00"
  },
  {
    "id": "170b164f08c3c9afdb968a51430324bd",
    "title": "Feds Scrutinizing Potential Insider Trading in Major Crypto Deals",
    "content": "Federal regulators are scrutinizing a growing number of companies that have embraced so-called crypto-treasury strategies this year, after unusual trading patterns in their shares caught their attention.\n\nThe corporate trend has exploded in recent months, with hundreds of companies investing in crypto this year. Crypto-treasury strategies, popularized by Strategy (formerly MicroStrategy), involve raising funds through stock or debt sales specifically to buy Bitcoin and other cryptocurrencies. For some of these companies, this scheme is no longer a side experiment; some are making investing in crypto the centerpiece of their corporate strategy.\n\nFor example, Strategy, which was founded in 1989, was best known as a business intelligence and software company before it pivoted to its current crypto-heavy corporate strategy in 2020 when it invested $250 million in Bitcoin. This past February, it dropped the Micro from its name.\n\nThe Wall Street Journal reported Thursday, citing unnamed sources, that both the U.S. Securities and Exchange Commission (SEC) and the Financial Industry Regulatory Authority (FINRA) have reached out to several firms. People familiar with the matter told the newspaper that regulators are concerned about unusually high trading volumes and sharp stock-price gains ahead of public announcements about the crypto purchases.\n\nSEC officials warned companies they could have potentially violated the Regulation Fair Disclosure rule, which prohibits public companies from selectively sharing non-public information with analysts and investors who might trade on it. Lawyers told the Journal that letters from FINRA often signal the beginning of probes into potential insider trading.\n\nThe SEC did not immediately respond to a request for comment from Gizmodo, while FINRA declined to comment.\n\nFor many firms, pivoting to a crypto-treasury involves quietly gauging interest from outside investors willing to privately finance their crypto purchases. These investors are usually required to sign nondisclosure agreements, keeping the companies’ identities secret until official announcements are made. But since some stocks spiked in the days leading up to the news of crypto purchases, it seems some info on these investments may have leaked.\n\nAccording to the Journal, citing crypto-advisory firm Architect Partners, 212 new companies have announced plans to raise roughly $102 billion for crypto purchases so far this year.\n\nThe Wall Street Journal said it’s still unclear whether regulators plan to take action against the companies or investors.\n\nThe paper noted that SEC Chair Paul Atkins recently criticized the commission’s past tactics, saying it had “weaponized” its enforcement to stifle crypto.\n\nGiven the Trump administration’s pro-crypto policies, a lax reaction from the SEC wouldn’t be too shocking. The president has been very friendly with the industry, which has helped him make a fortune himself.",
    "url": "https://gizmodo.com/feds-scrutinizing-potential-insider-trading-in-major-crypto-deals-2000664439",
    "source": "newsapi",
    "author": "Bruce Gil, Matt Novak",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "companies",
      "crypto",
      "their",
      "strategy",
      "some",
      "journal",
      "purchases",
      "investors",
      "regulators",
      "cryptotreasury"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:29:41.235202+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": "2025-09-27T13:00:35+00:00"
  },
  {
    "id": "56ba096a9a6382fa55e67ccec3368f41",
    "title": "3 big things you need to know about the economy following today's brutal jobs report",
    "content": "Job seekers should consider networking and broadening their job search, experts told Business Insider. Chase Stevens/Las Vegas Review-Journal/Tribune News Service via Getty Images\n\nJob seekers should consider networking and broadening their job search, experts told Business Insider. Chase Stevens/Las Vegas Review-Journal/Tribune News Service via Getty Images\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nDavid Kelly, the chief global strategist at JPMorgan Asset Management, described the Bureau of Labor Statistics' new jobs report in one simple word: \"ouch.\"\n\nThere were several pain points: The US added 22,000 jobs, a big miss from the 75,000 expected, and June's job growth was revised to the first employment decline since December 2020. Unemployment is still low but is now at its highest since October 2021. Several major industries experienced job losses, adding to the tough picture for job seekers.\n\n\"The numbers this morning are quite consistent with other things we've been seeing on the jobs market, and it suggests that the economy is just running out of momentum,\" Kelly said.\n\nIt's probably going to take more work to get a job, as data released earlier this week showed July unemployment outpaced the number of posted job openings for the first time since 2021. The Federal Reserve will likely make its first rate cut of 2025 in less than two weeks, but even that likely won't bring much relief to consumers just yet.\n\nBelow are three things you should know about the economy after today's report.\n\nJob seekers' frustrations about a frozen market are even more justified\n\nJob growth has ground to a halt across much of the economy; nine major sectors had month-over-month declines in August compared to the handful that had month-over-month gains. Employment fell in both traditionally white-collar and blue-collar fields.\n\nPrivate education and health services was one of the few sectors showing a healthy gain, thanks to the growth in both healthcare and social assistance, despite a small dip in private educational services.\n\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know\n\nLaura Ullrich, the director of economic research in North America at the Indeed Hiring Lab, said job seekers will likely need to be adaptable in the stalling job market. That means either broadening their applications from full-time jobs to part-time work or applying to jobs in a different field than their past experiences.\n\n\"Network as much as you can, take a part-time job, volunteer your time in a way that could very much mirror a job on a résumé,\" Ullrich said.\n\nStill, it can be harder to find work because the job market is pretty frozen, and the back-and-forth on tariffs is making it harder for some firms to plan staffing decisions. Kelly said businesses don't want to lay people off, but they are also \"too uncertain\" to hire.\n\nManufacturing employment fell for the fourth straight month. Jed Kolko, a senior fellow at the Peterson Institute for International Economics, said the fall in durable goods manufacturing employment, in particular, is worrisome.\n\n\"That is the sector where we would expect to see the clearest effects of tariffs,\" he said.\n\nInterest rate cuts are coming\n\nFederal Reserve Chair Jerome Powell has repeatedly said that a still-strong labor market is driving the economy, but the last few reports have been dismal.\n\nCME FedWatch showed, based on market moves, a near-certain chance for the long-awaited cut at the Fed's next meeting on September 17. A jumbo-cut of 50 basis points could depend on what the consumer price index, one inflation measure, looks like next week.\n\nAfter five consecutive decisions of keeping rates steady, a rate cut could bring some relief to consumers, because the Fed's rate decision affects mortgages, auto loans, and credit cards.\n\nMark Hamrick, Bankrate's senior economic analyst, said a 25-basis-point rate cut, which is more likely at the moment, \"would not have hugely consequential implications for the lives of most Americans.\"\n\n\"The benchmark rate would still be seen as restrictive,\" he added. \"However, if it is the beginning of a sustained rate reduction campaign, that would be more meaningful, reducing economic headwinds and potentially giving the housing market a boost.\"\n\nDespite how the job market looks, the US is still not in a recession\n\nA lot of factors go into an official recession call, and economists who have talked to Business Insider over the past few months don't think we are in one or that it's inevitable we enter one soon. There are risks, though, and things to watch out for, like whether unemployment spikes.\n\nIt can also be hard to tell how the economy is really doing. Real gross domestic product growth looked healthy in the second quarter on its surface, but its growth was largely due to a fall in imports after businesses previously stocked up due to tariff decisions. Real personal consumption expenditures have had modest growth recently.\n\nKelly said the past two recessions were dramatic, so they're not too helpful in assessing today's job market because it is so different.\n\n\"I think that people who've lived through the great financial crisis and the pandemic recession don't recognize a slow slowdown in the economy,\" Kelly said. \"That's what we've got.\"\n\nAre you struggling to find a job, or have you landed a job in a creative way? Reach out to this reporter to share your story at mhoff@businessinsider.com.",
    "url": "https://www.businessinsider.com/jobs-report-what-to-know-about-todays-economy-2025-9",
    "source": "newsapi",
    "author": "Madison Hoff, Enter Your Email, Follow Authors, Never Miss A Story",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "said",
      "market",
      "insider",
      "rate",
      "business",
      "growth",
      "economy",
      "seekers",
      "kelly",
      "jobs"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:29:42.485951+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "df657f6b110203fbd6dc1931acacb0d7",
    "title": "Fueled by AI Hype, Google Becomes Fourth Company to Pass $3 Trillion Market Cap",
    "content": "On Monday, Google’s parent company, Alphabet, became the fourth company to reach a market value of $3 trillion, and every member of this exclusive club has something in common.\n\nAll it took was a rather small 4% rise in shares for the tech giant to hit the coveted stock market benchmark. Rather unsurprisingly, the three previous winners of that title—Nvidia, Microsoft, and Apple—are all titans of the tech industry that have been riding the wave of investor interest in AI, as well.\n\nAlphabet stock had a great start to September after a federal judge concluded earlier this month that the tech giant could keep Chrome despite its monopoly in internet search. The judge’s reasoning for that was that generative AI would eventually pose “a meaningful challenge to Google’s market dominance.”\n\nGoogle is trying to get ahead of that “meaningful challenge” by fusing AI into its search engine and pouring billions into developing its AI offerings, including its own AI chatbot Gemini.\n\nIt seems that investment cashed out for the company. As of Monday morning, Google Gemini is now the number one free app on Apple’s App Store, relegating OpenAI’s ChatGPT to number two status and giving the much-needed push to the company’s stock.\n\nThe AI hype is inextricably and intricately linked to the significant stock market returns that these tech giants, and many others, have experienced this year. The trillion-dollar question: Is there an AI bubble?\n\nAI hype driving major gains\n\nThe best example of AI hype delivering trillions of dollars of financial gain is perhaps Nvidia, the ultimate AI darling of the stock market. Due to its immense market share in AI chips and the meteoric rise it experienced thanks to the technology, the company is largely considered the face of the AI hype.\n\nEarlier this summer, Nvidia made history as the first company to ever hit $4 trillion market valuation.\n\nApple, considered the least AI-savvy of the four companies to breach the $3 trillion benchmark, was the first company to ever be worth $3 trillion but is still yet to hit $4 trillion. Meanwhile, both Nvidia and Microsoft have outperformed Apple and already reached that milestone. Microsoft’s breach of the $4 trillion benchmark was also thanks to AI.\n\nLate July, Microsoft posted an earnings report that showed stellar revenue for its cloud computing platform Azure. The stock move following the report pushed Microsoft briefly above $4 trillion market value.\n\nFellow cloud infrastructure provider Oracle also benefited greatly from an AI-demand-driven stock move. Chairman Larry Ellison became the richest man on Earth last week after Oracle stock skyrocketed more than 42% on news that the company expects to collect half a trillion dollars (and potentially billions of dollars more) in the coming quarter on AI deals alone.\n\nIs there a bubble?\n\nAll this is great news for tech companies and their financial metrics, but is it substantiated? That question has been plaguing investors for some time now.\n\nAccording to some experts (and OpenAI CEO Sam Altman), there is indeed an AI bubble.\n\n“Are we in a phase where investors as a whole are overexcited about AI?” Altman said last month in a dinner with journalists, according to The Verge. “My opinion is yes.”\n\nAn AI report from MIT fueled those worries further just a few weeks ago. The researchers shared that despite the push to scale AI in the corporate world, fewer than one in ten AI pilot programs have actually generated revenue gains.\n\nAI is currently deployed mostly by larger firms in select fields. But even there, AI adoption is now declining, according to the latest U.S. Census Bureau findings.\n\nIf AI is indeed in a bubble, the burst could be catastrophic. So much is riding on the AI wave right now, including the entire U.S. economy.\n\nIn a paper published in July, Fed researchers said that if AI demand does not scale proportionally with investment, it can lead to “disastrous consequences,” and compared it to the railroad over-expansion of the 1800s and the economic depression that followed. Also in July, economist Torsten Slok called the AI bubble of today even worse than the 1999 Dot-com bubble.",
    "url": "https://gizmodo.com/fueled-by-ai-hype-google-becomes-fourth-company-to-pass-3-trillion-market-cap-2000658927",
    "source": "newsapi",
    "author": "Ece Yildirim, James Pero, Bruce Gil, Aj Dellinger",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "market",
      "trillion",
      "stock",
      "company",
      "bubble",
      "tech",
      "microsoft",
      "hype",
      "there",
      "benchmark"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:29:43.531813+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": "2025-09-15T19:25:38+00:00"
  },
  {
    "id": "16c72afeb9bf7f9050da26b5b1b7d4c5",
    "title": "Retail spending is starting to look more and more like the labor market",
    "content": "This is The Takeaway from today's Morning Brief, which you can sign up to receive in your inbox every morning along with:\n\nThe Chart of the Day\n\nWhat we're watching\n\nWhat we're reading\n\nEconomic data releases and earnings\n\nThe economy can count on the American consumer.\n\nThat was true in the pandemic years and the high-inflation era that followed, just as it is in the first months of the new tariff regime. But the question of who is doing all that spending has taken on greater importance, especially as talk of an economic slowdown has grown.\n\nThe most affluent consumers account for a bigger share of total US spending, reinforcing the lopsided dynamic of unbothered consumption for the wealthy and more cautious shopping for everyone else.\n\nAmericans in the bottom 80% of the income distribution, those making less than $175,000 a year, are barely keeping their spending on pace with inflation, according to an analysis by Mark Zandi, chief economist for Moody's Analytics. Meanwhile, the top 20% of consumers are growing their spending.\n\n\"The data also show that the US economy is being largely powered by the well-to-do,\" Zandi said.\n\nIt's a similar bifurcation to the labor market. As Fed Chair Jerome Powell noted in January, \"If you have a job, it's all good. But if you have to find a job, hiring rates have come down.\" (It's gotten even worse since then.)\n\nRead more: How the Fed rate decision affects your bank accounts, loans, credit cards, and investments\n\nSign up for the Yahoo Finance Morning Brief Subscribe By subscribing, you are agreeing to Yahoo's Terms and Privacy Policy\n\nConsumers in the top 10% of the income distribution accounted for 49.2% of total spending in the second quarter, registering the highest level recorded since 1989.\n\nThe sharpening contrast comes as other economic metrics show a rough going for summer's end. Unemployment is on the rise as hiring has slowed. Inflation remains stubbornly high, and consumer sentiment has flagged.\n\n\"As long as they keep spending, the economy should avoid recession, but if they turn more cautious, for whatever reason, the economy has a big problem,\" Zandi said.\n\nStill, economists pointed to specific categories to underscore softness, even as retail sales topped expectations.\n\n\"Tariff pressures are becoming increasingly visible, with several retail categories registering volume declines as some households struggle to absorb higher prices,\" EY-Parthenon chief economist Gregory Daco wrote in a note on Tuesday.\n\nBill Adams, chief economist for Comerica Bank, said that weakness in grocery store sales is likely another sign that lower- and middle-income consumers are retrenching.",
    "url": "https://finance.yahoo.com/news/retail-spending-is-starting-to-look-more-and-more-like-the-labor-market-100017692.html",
    "source": "newsapi",
    "author": "September, Min Read",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "spending",
      "economy",
      "consumers",
      "morning",
      "sign",
      "economic",
      "more",
      "zandi",
      "chief",
      "economist"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:29:44.980745+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "29c4d4518831f41858da7dd4551c3747",
    "title": "Faisal Islam: Will the US tech bromance turn around the UK economy?",
    "content": "Faisal Islam: Will the US tech bromance turn around the UK economy?\n\n19 September 2025 Share Save Faisal Islam Economics editor Share Save\n\nEPA The Tech Prosperity Deal inked by this week tacitly aligns the UK with the US administration's pro-tech approach\n\nIn the old Camden Town Hall opposite London's St Pancras station, away from the white tie and tails of the pageantry at Windsor Castle, was perhaps the most substantive display of the consequences of US President Donald Trump's state visit. In front of Prime Minister Sir Keir Starmer, many members of the British and US cabinets and the cream of the European tech industry, a highly-crafted video played, featuring the long history of UK science. It included George Stephenson, Charles Babbage, Ada Lovelace, Alan Turing and Sir Demis Hassabis, with dozens of UK start-up companies from every corner of the country listed. It was a cross between a UK government investment promotion video and the Danny Boyle 2012 Olympic Opening Ceremony, except for one crucial detail - it was voiced by Jensen Huang, the American Nvidia artificial intelligence (AI) and microchip magnate. This week, Trump said the tech tycoon \"was taking over the world\" and the boss of the company, which hit a market value of $4tn (£2.9tn) this summer, appears to have gone all-in on the UK in quite an extraordinary way.\n\nGetty Images Nvidia CEO Jensen Huang is among US tech magnates pouring money into the UK\n\nHuang shouted out the long list of British entrepreneurs Nvidia has taken stakes in and had expanded after a further £2bn of investment. He invited Business Secretary Peter Kyle and his US counterpart Howard Lutnick onto the stage to address the assembled British entrepreneurs. Lutnick, the face of the global trade war, said: \"We are America first, but we are not America only... We want to win, we want you to win.\" This was one vignette from the striking array of the world's biggest Silicon Valley tech companies turning on the transatlantic investment tap. The \"tech bromance\" embraced the UK this week with a hat-trick of multi-billion investments from Nvidia, Microsoft and Google. It was an early win for the government's strategy in attracting this sort of investment to help transform Britain and the UK economy long term. But it is not necessarily proof that this strategy will win in transforming the economy, living standards, and turning the tide on more general negative vibes from the economy and politics.\n\nIndeed, the infectious enthusiasm of the US tech giants about Britain jarred with the more general air of pessimism floating around the country. Huang himself said he was surprised by Britain's image of itself. \"This is the week that I declare that the UK will be an AI superpower,\" he told me, crediting the prime minister and Kyle. \"You [Brits] just don't appreciate it. Come on. You're too humble,\" he said, pointing to the history and reality of tech research coming from the UK. Microsoft announced a £22bn investment and the extension of the Stargate AI plan - intended to expand AI infrastructure over the next four years - to the UK. It's what Microsoft chief executive Satya Nadella described as the pathway for AI becoming a general purpose technology, like electricity or the internet. It feels rather ubiquitous already. On Tuesday, UK Chancellor Rachel Reeves opened Google's new data centre in Essex with its president, Ruth Porat. Google had just announced a £5bn investment in this type of infrastructure and in Deepmind, the London-based AI research company run by Nobel Prize winner Sir Demis Hassabis. Porat is one of the most connected business leaders in the world, born in Manchester, and a regular on presidential trade missions. While she stressed the \"profound opportunity\" for the UK, she also said there was \"work to do\".\n\n'Crumbs from Silicon Valley'\n\nBut amid the upbeat talk, a surprising attack on the array of US investment came from former Deputy PM and Facebook senior executive Sir Nick Clegg. Britain was \"clinging on to the coattails of Uncle Sam\" with \"crumbs from the Silicon Valley table\". \"Not only do we import all their technology, we export all our good people and good ideas as well,\" he said. While there was no explicit quid pro quo in terms of digital taxes or changes to the online safety bill in the Tech Prosperity Deal signed this week, it is clear that the UK has a degree of soft alignment with the US administration's approach, especially when it comes to AI. Lutnick explained to the start-up audience that he scrapped Biden-era AI Safety initiatives in favour of \"leaning forward\" on the technology. The UK government has mirrored some of these moves. The big picture here is that even the three US giants that put in the lion's share of the tech investment last week are now worth $9tn on US stock markets. They are ready to some shopping, and considerable sums are coming to the UK. The plan is that the Silicon Valley stardust will be sprinkled on the scientific Golden Triangle of Oxford-Cambridge-London - \"and don't forget the Open University in Milton Keynes\", said Kyle. So what of the familiar lament of losing our best technology and not being able to grow the biggest companies in the world? DeepMind might be considered an example of that in one way. It was bought by Google for £400m in 2014. Another way to look at it, however, is that the new appreciation for the tech giant is partly because of London-based Deepmind's research into all aspects of frontier technology. The recent surge in its share value to above $3tn is rooted in a perception that it is no longer lagging behind in the AI race. Chip designer Arm Holdings is the other UK champion that was sold off to foreign ownership. Its technology is central to the chips in almost all smartphones, including iPhones. There are suggestions that Arm may look at manufacturing its own chips, as the West looks to de-risk supply chains. It is sometimes forgotten that Huang was very close to buying Arm Holdings in 2022, before regulatory authorities investigated the deal on competition grounds under the previous Conservative government. When I raised this with Huang, he sighed: \"Don't remind me... I tried\".\n\nReuters (L-R) US Commerce Secretary Howard Lutnick, UK Chancellor Rachel Reeves and Business Secretary Peter Kyle",
    "url": "https://www.bbc.com/news/articles/cn4w7wp24llo",
    "source": "newsapi",
    "author": null,
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "tech",
      "investment",
      "said",
      "week",
      "huang",
      "technology",
      "economy",
      "share",
      "nvidia",
      "kyle"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:29:46.884216+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "d60e0d5d894a5a64f87d42941cfdb82a",
    "title": "Top analyst says you weren’t crazy for thinking the economy felt worse than it looked the last 3 years. The ‘rolling recession’ just ended",
    "content": "Economic headlines have been grim recently. The jobs report from July shattered the narrative that the economy of 2025 was strong, revising previous figures downward and revealing something close to an 80% collapse in hiring, even as inflation crept upwards and layoffs rolled. August was another bad one, with just 22,000 jobs added. But what if that was the bottom of a secret, “rolling” recession in place for nearly three years, dating back to 2022? That’s what one of the top minds on Wall Street thinks.\n\nMorgan Stanley’s Chief U.S. Equity Strategist Mike Wilson says the August report is actually more confirmation of his primary thesis that goes back several years. “Central to our view,” Wilson’s team wrote in a note published on the morning of September 8, “is the notion that the economy has been much weaker for many companies and consumers over the past 3 years than what the headline economic statistics like nominal GDP or employment suggest.”\n\nIn other words, amid the many predictions of a recession about to hit the U.S. economy or a revival of 1970s-style stagflation, Wilson has been banging the drum that the recession was already here, just in disguise. The good news is that if a recession was disguised, then the current, early-stage bull market has been, too: “Friday’s weak labor report provides further evidence of our thesis that we are now transitioning from a rolling recession to a rolling recovery. In short, we’re entering an early cycle environment and the Fed cutting rates will be key to the next leg of the new bull market that began in April.”\n\nThe ‘rolling recession’: What happened?\n\nAccording to Wilson and his team at Morgan Stanley, the recession never materialized as a sudden collapse or sharp spike in unemployment. Instead, weakness moved sector-by-sector from pandemic winners like tech and consumer goods to the rest of the economy, with each industry suffering its own downturn at different times. This “rolling recession” meant the usual markers of broad economic pain—soaring unemployment, plummeting GDP—remained muted even as weakness mounted underneath the surface. “We saw most sectors of the economy go through their own individual recessions at different times,” the bank argued.\n\nSeveral factors contributed to this slow-moving pain. Post-pandemic immigration surges, followed by stricter enforcement, distorted many traditional labor-market signals and clouded real-time interpretation of headline statistics. Median earnings growth for companies across the Russell 3000 index remained negative for much of three years—yet the overall stock market seemed to sidestep a crash, until recently.",
    "url": "https://finance.yahoo.com/news/top-analyst-says-weren-t-162013016.html",
    "source": "newsapi",
    "author": "September, Min Read",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "recession",
      "economy",
      "rolling",
      "been",
      "what",
      "economic",
      "report",
      "years",
      "wilson",
      "many"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:29:47.780594+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "c7aeb6d41c7003a51bc11b8e9786eb85",
    "title": "The AI boom is unsustainable unless tech spending goes ‘parabolic,’ Deutsche Bank warns: ‘This is highly unlikely’",
    "content": "The current AI boom is not sustainable, a Deutsche Bank research note warned this morning, because tech spending won’t “remain parabolic.” AI capex is now so massive it is keeping the U.S. out of recession, the bank said. Separately, Bain & Co. estimate there will be an $800 billion shortfall in the revenues needed to fund the demand for AI computing power. About half the S&P 500’s gains this year have been driven by tech stocks.\n\nOn the heels of Nvidia’s $100 billion investment in OpenAI, two research notes out today suggest the current boom in AI may be unsustainable.\n\n“AI machines—in quite a literal sense—appear to be saving the U.S. economy right now,” George Saravelos of Deutsche Bank wrote to clients. “In the absence of tech-related spending, the U.S. would be close to, or in, recession this year.”\n\nSeparately, Bain & Co.’s annual global technology report says that AI won’t be able to generate enough revenue to sustain the computing power it needs to build. “Two trillion dollars in annual revenue is what’s needed to fund computing power needed to meet anticipated AI demand by 2030. However, even with AI-related savings, the world is still $800 billion short to keep pace with demand,” the report says.\n\nThe market has been highly driven this year by the Magnificent 7 tech stocks, based on their spending on AI and the revenues they generate from AI capital expenditure from other companies.\n\nHowever, there isn’t a consensus on Wall Street regarding AI’s longevity. Goldman Sachs took a more bullish view this morning. “We expect productivity gains from artificial intelligence (AI) to boost GDP significantly, by about 0.4% through the next few years and 1.5% cumulatively as adoption rises over the long run. Once it is widely adopted, AI is likely to allow workers and firms to produce more output for a given set of inputs, which will raise [total factor productivity] growth,” Manuel Abecasis and his colleagues told clients in a note seen by Fortune.\n\nEstimates vary as to how much is being spent by AI hyperscalers on the data centers and the massive power infrastructure they need to support them. Goldman Sachs estimated that AI capex totaled $368 billion through August of this year.\n\nWhatever the number is, it is so massive that it’s boosting GDP, Deutsche’s Saravelos said: “It may not be an exaggeration to write that NVIDIA—the key supplier of capital goods for the AI investment cycle—is currently carrying the weight of U.S. economic growth. The bad news is that in order for the tech cycle to continue contributing to GDP growth, capital investment needs to remain parabolic. This is highly unlikely.”",
    "url": "https://finance.yahoo.com/news/ai-boom-unsustainable-unless-tech-105907536.html",
    "source": "newsapi",
    "author": "September, Min Read",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "tech",
      "billion",
      "power",
      "year",
      "bank",
      "spending",
      "massive",
      "needed",
      "demand",
      "computing"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:29:50.106727+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "3f05b410898c6bc9299740807e204ad7",
    "title": "Does Bitcoin Belong on Your Balance Sheet?",
    "content": "This year, mainstream corporate finance has become embroiled in a debate that would have felt unthinkable even a few years ago: How much crypto belongs on your balance sheet? Bitcoin’s latest rallies—nudged by President Trump’s “Strategic Bitcoin Reserve” executive order, a softer dollar, and a friendlier regulatory climate have suddenly made the asset hard to ignore, even for traditionally conservative investors. Sovereign-wealth funds are quietly adding exposure, state treasurers from Texas to Wyoming are sketching reserve playbooks, 401(k) plans can now wade in, and marquee brands from Tesla to Block, Figma and MassMutual have added line items for what has been jokingly called “magic internet money” to their balance sheets.",
    "url": "https://hbr.org/2025/09/does-bitcoin-belong-on-your-balance-sheet",
    "source": "newsapi",
    "author": "Christian Catalini, Is The Founder Of The Mit Cryptoeconomics Lab, A Research Scientist At Mit. He Is Also Co-Founder, Chief Strategy Officer Of Lightspark. Previously, He Was Co-Creators Of Libra, Chief Economist Of The Libra Association. Christian Catalini Advises A Number Of Crypto Companies, Including Coinbase. He Is Also A Member Of The U.S. Commodity Futures Trading Commission S Technology Advisory Committee.",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "even",
      "balance",
      "reserve",
      "year",
      "mainstream",
      "corporate",
      "finance",
      "become",
      "embroiled",
      "debate"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:29:52.556596+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": "2025-09-05T12:15:28+00:00"
  },
  {
    "id": "855d5e20b7d37b9fecae729441ef3d2a",
    "title": "Aldi warns food prices may rise if Budget lifts costs",
    "content": "Aldi warns food prices may rise if Budget lifts costs\n\n15 September 2025 Share Save Emma Simpson Business correspondent Share Save\n\nAldi\n\nThe boss of Aldi has warned that any measures in the Budget that further increase costs on employers could lead to higher food prices. Aldi UK chief executive Giles Hurley, said the impact of last year's National Insurance rise and the cost of new packaging rules had already \"rippled through to prices on the shelf edge\". \"Any policies which affect the operating costs of business should be considered very, very carefully because of the very real risk they find their way... back into the food system and onto prices,\" Mr Hurley told the BBC. The Treasury said the Budget \"will build an economy that works for working people\" such as cutting inflation and \"keeping a tight grip on public spending\".\n\nMore than 60 retailers wrote to Chancellor Rachel Reeves last month ahead of the Budget on 26 November, urging her to avoid further taxes on the industry, which has been among the hardest hit by the government's revenue-raising measures. The issue of business rates, for instance, is worrying many large chains and the industry trade body, the British Retail Consortium, has warned planned reforms could lead to closures of hundreds of stores. Mr Hurley was speaking as Aldi reported that annual sales edged up to £18.1bn but profits dropped by more than a fifth to £435.5m. It said this was largely down to investment in price cuts, infrastructure and higher pay. Aldi has not disclosed how much tax changes are going to cost the business this year.\n\nAldi Aldi UK chief executive Giles Hurley\n\nMr Hurley said so far this year, more than £300m had gone into trying to offset the rising cost of goods and keep prices as low as possible. Even so, supermarket prices for many staple products have rocketed this year. Take a 500g pack of lean beef mince. According to retail expert Ged Futter, it has gone from £3.79 at several large supermarkets at the start of the year to more than £5 at all the main chains now. \"Cattle prices are up 30% this year and herd sizes are dropping and that is playing into the price of mince,\" the Aldi boss told the BBC, walking around one of the company's new stores in Sutton Coldfield. Global factors have had a major impact on food inflation everywhere, including rising commodity prices, said Mr Hurley. But he also believes some domestic policy decisions have \"perhaps inadvertently\" created a more stubborn inflation situation in the UK, \"probably more so than in other developed countries\". UK food inflation increased to 4.9% in July. According to Eurostat figures, it was 3.9% in the EU. The Bank of England has said the new levy on retailers to reduce packaging waste could drive food prices higher this autumn. In its latest outlook, the Food and Drink Federation (FDF) reckons food inflation could reach 5.7% by the end of December and still be running at 3.1% by the end of 2026. It said prices have now stabilised or declined for some key commodities like cocoa, coffee and olive oil. The FDF said the main driver of UK food inflation now is the impact of the rise in the minimum wage and higher National Insurance Contributions for employers. It said new packaging rules will add an estimated £1.1bn in costs for food and drink businesses from next month.",
    "url": "https://www.bbc.com/news/articles/c0r0zr7ed9yo",
    "source": "newsapi",
    "author": null,
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "food",
      "prices",
      "aldi",
      "said",
      "hurley",
      "inflation",
      "more",
      "than",
      "year",
      "budget"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:29:53.768735+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "fe3350882c28a9d65786788d684b84dc",
    "title": "Bitcoin has more room to run in October: A closer look",
    "content": "00:00 Miles\n\nAll right, Bitcoin peaking back above $120,000 on Thursday\n\n00:02 Miles\n\nand there may be more gas in the tank. October is traditionally a strong month for the cryptocurrency and as Fray joins us now to discuss what has the crypto bulls back in control and s.\n\n00:14 Ines Fray\n\nYeah, Miles, and we are seeing Bitcoin at around 120,000 per token.\n\n00:20 Ines Fray\n\nThe second day of the month and for a second day, we've seen Bitcoin rising for October as the Bitcoin Bulls like to put it.\n\n00:26 Ines Fray\n\nUh, you have a uh tailwind as far as liquidity is concerned.\n\n00:33 Ines Fray\n\nYou had a headwind back in September with that uh and now it's a tailwind and you've got another tailwind happening and that's the stable coin issuance. That's been accelerating over the last several months.\n\n00:43 Ines Fray\n\nAnd that bodes well for the entire ecosystem of crypto because you've got these stable coins that are running on blockchains like Ethereum, like Solana.\n\n00:54 Ines Fray\n\nYou also uh have City Group that has their uh has said that the year end target for crypto is 132,000.\n\n01:03 Ines Fray\n\nYou also they also set a 12-month target uh for Bitcoin uh of 181,000.\n\n01:10 Ines Fray\n\nAnd one other interesting note is from Sean Farrell over at Fundstrat and he mentioned the relationship between gold and Bitcoin over the last couple of years.\n\n01:18 Ines Fray\n\nthat they kind of take turns, usually gold front runs Bitcoin.\n\n01:23 Ines Fray\n\nAnd uh gold has been overstretched, has been over in sort of overbought territory and now it may be Bitcoin's term.\n\n01:32 Ines Fray\n\nSo he's seeing a that in the next couple of weeks, you could see a bit of a rotation from gold, from analog gold into digital gold as investors pour into uh Bitcoin and other cryptocurrencies.\n\n01:43 Miles\n\nAll right, Ines Fray with the latest on the crypto trade.",
    "url": "https://finance.yahoo.com/video/bitcoin-more-room-run-october-203130946.html",
    "source": "newsapi",
    "author": "Thu, October, At Pm Gmt",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "fray",
      "ines",
      "bitcoin",
      "gold",
      "miles",
      "crypto",
      "over",
      "back",
      "month",
      "like"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:29:54.994752+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "a6c4e841a3195cf56c048bdc41865f8a",
    "title": "Why Bitcoin whales sold $16bn: ‘It’s not a good signal for the market’",
    "content": "Large holders, or whales, have sold 147,000 Bitcoin since August.\n\nThat translates to over $16 billion.\n\n\"It's not a good signal for the market,\" said Bitwise's André Dragosch.\n\nThings don’t bode well for Bitcoin.\n\nOver the past month, Bitcoin whales, the term for entities that hold upwards of 1,000 Bitcoin, have sold over $16 billion worth of coins. The selling is happening at the fastest monthly rate since Bitcoin’s last halving event, in 2024.\n\n“These whale sellings are generally not a good signal for the market especially if these sales come from long-term holders of bitcoin,” André Dragosch, European head of research at Bitwise, told DL News.\n\nWhy? History, said Dragosch. “Markets tend to react negatively to both whale selling and long-term holder selling.”\n\nBitcoin’s biggest holders are losing their grip.\n\nIn his September 23 newsletter, Bitcoin analyst James Check flagged roughly $2 billion a day of “revived supply,” or coins that long sat dormant and are now moving back into circulation.\n\nThat kind of activity often signals that large, seasoned, and committed Bitcoin investors are moving capital elsewhere — even if they haven’t lost faith in Bitcoin itself.\n\n“It doesn’t look like ‘I lost conviction in Bitcoin, I’m getting out’ sell-side,” Check wrote. This means that “they will rotate back when the market starts moving again.”\n\nDespite the uptick in selling, Bitcoin remains resilient. The top crypto trades at about $113,500, up 2% in the past month, and 80% in the past year.\n\nTwo theories\n\nFor Dragosch, there’s two main theories behind the sell-off.\n\n“One is that they might be using Bitcoin to fund treasury companies,” he told DL News.\n\nIndeed, Bitcoin treasury companies have surged this year. What began in August 2020 as a capital markets gimmick from Michael Saylor has quickly transformed into a multi billion-dollar sector.\n\nAs of Wednesday, 194 public companies held Bitcoin on their balance sheet, up from 170 a month ago, according to BitcoinTreasuries.net. The top 100 public firms hold a staggering 1.03 million Bitcoin worth about $116 billion.\n\nThese firms need loads of capital to keep adding Bitcoin or to finance mergers, and selling into the market can provide that funding.\n\nAnother theory, said Dragosch, is Bitcoin’s four-year cycle.\n\nFour-year cycle\n\nSince Bitcoin was released in 2009, its price has followed a pattern.\n\nEvery four years, a halving cuts the new supply of coins in half, kicking off a bull run. Then, when the price gets too foamy and sentiment a tad too excited, traders take profit and the price plunges into a bear market.\n\nNow, some say that the playbook is dead. Bitwise CIO Matt Hougan, for instance, said in July the forces that have created prior four-year cycles are now weaker. That includes a lesser effect from the halving, and an interest rate cycle that is more positive for crypto.\n\nBut the halving’s waning influence is not a foregone conclusion just yet. Especially for a cohort of Bitcoin investors that has lived through multiple boom-bust cycles and are accustomed to the familiarity of Bitcoin’s price pattern from years past.\n\nWhales “might believe in the four-year halving cycle and therefore expect that Bitcoin has reached its cycle top already,” said Dragosch.\n\nPedro Solimano is DL News’ Buenos Aires-based markets correspondent. Got at a tip? Email him at psolimano@dlnews.com.",
    "url": "https://www.dlnews.com/articles/markets/bitcoin-whales-sell-16bn-in-troubling-signal-expert-says/",
    "source": "newsapi",
    "author": "Pedro Solimano, Kyle Baird, Lance Datskoluo",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "bitcoin",
      "dragosch",
      "market",
      "said",
      "selling",
      "cycle",
      "billion",
      "past",
      "bitcoins",
      "halving"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:29:58.211077+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "6a2311ffa8f851ef509588cf7f24b512",
    "title": "3 reasons the US can't count on wealthy Americans to keep the economy going strong",
    "content": "lighning bolt icon An icon in the shape of a lightning bolt.\n\nlighning bolt icon An icon in the shape of a lightning bolt. Impact Link\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nRich Americans may not be able to power the economy through a slowdown after all.\n\nA lot of economic punditry recently has been focused on high earners as a pillar of continued consumer strength, with their robust spending helping to prop up economic growth.\n\nBut there are a few reasons why that might not be true, analysts at BCA Research said, particularly when surveying other signs of weakness in the economy,\n\nThe firm pointed to the slowdown in hiring as a particular area of weakness.\n\nBCA thinks job gains in the economy are now approaching \"stall speed,\" a level that suggests a slowdown in job creation could lead to a broader economic slowdown.\n\n\"'Now that the top 10% of earners account for 50% of consumption, do nonfarm payrolls matter less than they used to? If stocks keep rising, boosting high-end households' wealth and confidence, can they spend enough to carry the economy through a soft patch in the labor market?' Our answer is a carefully considered 'no,'\" they said.\n\nHere are the reasons BCA isn't counting on top earners to keep the US economy afloat.\n\n1. High earners don't account for as much of spending as some think\n\nHigh earners don't account for as much US spending as some believe, BCA Research said. Consumer Expenditure Survey (BLS), BCA calculations\n\nData from the Fed's Survey of Consumer Finances suggests that the top 10% of earners make up around half of all household income in the US, but that doesn't directly translate into spending, according to BCA's analysis.\n\nThe top 20% of earners in the US have accounted for around 37%-39% of all spending over the last forty years, per BCA's calculations based on Labor Department data.\n\n\"It's a considerable leap from the top quintile punching above its weight by a roughly two-to-one margin to the top decile consuming five times its income share,\" strategists wrote of the discrepancy.\n\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know\n\n2. High-earners are also high-savers\n\nBureau of Labor Statistics, Consumer Expenditure Survey\n\nHigh-earning households accounting for a smaller share of spending appears to be partly driven by the fact that they tend to save more aggressively.\n\nThe top 10% of earners in the US saved a proportionately larger share of their income on average in 2023, Labor Department data shows. The bottom 40% of earners, meanwhile, had a negative savings rate.\n\n3. The wealthy pay large capital gains taxes\n\nMany high-earning households, whose wealth is distributed across stocks and other assets, also pay tax on realized gains. BCA suggested that's another reason their share of total spending may be smaller than some think.\n\n\"The link between rising stock prices and high-end households spending is intuitively appealing, but it's challenged by IRS data on capital gains taxes,\" the strategists wrote.\n\n\"The widely shared conviction that spending by high-end households will overcome labor market weakness is too optimistic,\" the firm added, later stating that it believes the risk of a recession is elevated.\n\nMost forecasters on Wall Street don't expect the economy to slip into a recession this year, but cracks are beginning to show in key areas.\n\nThe US added 22,000 jobs in August, far fewer than economists had expected. Job growth for the last two months was also revised downward, while the unemployment rate edged higher.\n\nConsumer spending, though, has held relatively steady, with personal consumption expenditures picking up the pace slightly to 0.6% in August, according to the Commerce Department.",
    "url": "https://www.businessinsider.com/recession-outlook-americans-wealthy-consumer-spending-stocks-job-market-2025-9",
    "source": "newsapi",
    "author": "Jennifer Sor, Enter Your Email, Follow Authors, Never Miss A Story",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "spending",
      "earners",
      "economy",
      "consumer",
      "households",
      "labor",
      "bolt",
      "icon",
      "insider",
      "slowdown"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:00.708684+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "db271f1cea733326b31241c794e686f0",
    "title": "Dyson Isn’t Doing So Great",
    "content": "Consumer electronics giant Dyson’s profits were nearly halved in 2024, despite selling more products this year than they have ever before.\n\nThe company’s pre-tax profit for 2024 fell to £561 million (roughly $754 million) from £1.1 billion ($1.48 billion) the year before.\n\nIt was also the first time the company reported a fall in sales in over two decades, according to The Telegraph, despite selling a record-breaking 20 million products this past year. Dyson’s new product launches in 2025 included an AI-powered robot combination vacuum and wet floor cleaner, and the company’s billionaire owner, Sir James Dyson, has said that they are preparing for more product launches in the home appliances category. The company invested £8m (around $10.8 million) per week in research and development in 2024 and filed 238 new patents.\n\nKnown for hit products like the bagless vacuum and TikTok-famous hand dryers, Dyson’s 2024 was marked by a cost-cutting initiative despite being in the midst of a popularity boom the past two years.\n\nYearly revenue fell from £7.1 billion (a little over $9.5 billion) to £6.6 billion (roughly $8.8 billion) in what the company’s CEO Hanno Kirner has called “a difficult but necessary year of transformation.”\n\nIn July 2024, the company laid off around 1,000 employees in the UK, equaling one-third of its British workforce, and in October, the company laid off an undisclosed number of workers in Singapore.\n\nGlobally, Dyson has 10,000 employees, down from 13,000 in early 2022. Although a British company at heart, Dyson moved its headquarters to Singapore in 2019 and manufactures most of its goods in the region.\n\nAt the time of the UK layoffs, Dyson blamed “increasingly fierce and competitive global markets.” Dyson’s major competitors include the buzzy SharkNinja, German home appliance manufacturer Miele, and Samsung.\n\nIn Monday’s earnings press release, Dyson executives blamed one-off factors for the massive decline, like currency volatility in Asia and Turkey, where Dyson sells most of its products, a global reorganization of the business, and a factory fire that led to a shortage of supply in its beauty products.\n\nBut despite those one-off factors weighing on profit, executives did admit that the financial strain was still due in part to “slower economic growth in 2024 and reduced consumer confidence in some key markets.”\n\nAlthough a worldwide recession is still not in the cards, the global economy is set for its weakest run in nearly two decades.\n\n“Heightened trade tensions and policy uncertainty are expected to drive global growth down this year to its slowest pace since 2008 outside of outright global recessions,” the World Bank wrote in a press release in June. “If forecasts for the next two years materialize, average global growth in the first seven years of the 2020s will be the slowest of any decade since the 1960s.”\n\nThe U.S. is experiencing (and causing via Trump’s tariffs) its fair share of economic pressure as well. U.S. consumer confidence declined to a five-month low in September due to inflation and a weakening job market, according to data from the Conference Board that was unveiled on Tuesday.\n\nCorrection 10/1/25: An earlier version of this article referred to Dyson’s announcement as being an earnings call. It was a press release.",
    "url": "https://gizmodo.com/dyson-isnt-doing-so-great-2000665674",
    "source": "newsapi",
    "author": "Ece Yildirim, Dua Rashid, Dan Ackerman, Andrew Liszewski",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "billion",
      "dyson",
      "global",
      "dysons",
      "products",
      "year",
      "company",
      "despite",
      "million",
      "consumer"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:02.125711+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": "2025-09-30T19:25:18+00:00"
  },
  {
    "id": "2204d3b6a61daae67c1c0f6983fe98ce",
    "title": "Nvidia invests $5 billion into Intel to jointly develop PC and data center chips",
    "content": "is a senior editor and author of Notepad , who has been covering all things Microsoft, PC, and tech for over 20 years.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nNvidia is throwing Intel a $5 billion life raft, just weeks after similar stakes from the US government and SoftBank. Nvidia is investing $5 billion in Intel common stock in a collaboration that will see the pair “jointly develop multiple generations of custom data center and PC products.”\n\nNvidia says Intel will help build “x86 system-on-chips (SoCs) that integrate Nvidia RTX GPU chiplets.” These chips will power a “wide range” of PCs, by closely integrating Intel’s CPUs with Nvidia’s GPUs. Intel and Nvidia already have a close partnership on many gaming laptops, but combining both on a single SoC is a big step further.\n\nIt will help Intel and Nvidia better compete with AMD, which has been gaining ground on Intel with its impressive gaming desktop CPUs, APUs, and a wide variety of AI laptop processors. It also raises further questions about the future of Intel’s Arc graphics card business, especially if the company is now relying on Nvidia’s GPU expertise.\n\nNvidia’s investment in Intel comes after the chipmaker has reportedly been working with MediaTek to develop an accelerated processing unit (APU) that combines an Arm-powered CPU with Nvidia’s Blackwell GPU architecture. Nvidia has been rumored to be working on Arm-based laptop chips for years, and a recent report suggested Nvidia’s Arm-powered gaming laptop could launch later this year with Alienware.\n\nNvidia and Intel will also work together on connecting both their architectures via Nvidia’s NVLink communications link system that’s used in data centers to link GPUs together. “Intel will build Nvidia-custom x86 CPUs that Nvidia will integrate into its AI infrastructure platforms and offer to the market,” says Nvidia.\n\n“This collaboration tightly couples Nvidia’s AI and accelerated computing stack with Intel’s CPUs and the vast x86 ecosystem — a fusion of two world-class platforms,” says Nvidia CEO Jensen Huang. “Together, we will expand our ecosystems and lay the foundation for the next era of computing.”\n\nThe US government agreed to take an around 10 percent stake in Intel last month, valued at $8.9 billion. SoftBank is also investing $2 billion into Intel, as the struggling chipmaker has been pulling back on spending and laying off thousands of workers.\n\nIntel’s stock price jumped 28 percent in pre-market trading after Nvidia’s announcement.",
    "url": "https://www.theverge.com/news/780792/nvidia-intel-investment-pc-chips-data-center",
    "source": "newsapi",
    "author": "Tom Warren",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "nvidia",
      "intel",
      "nvidias",
      "been",
      "billion",
      "intels",
      "cpus",
      "after",
      "says",
      "gaming"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:03.973867+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": "2025-09-18T11:37:15+00:00"
  },
  {
    "id": "9a5c772607e3e94b1d1498c8b97fc5bd",
    "title": "Government shutdown could delay key economic reports at an especially sensitive time",
    "content": "Government shutdown could delay key economic reports at an especially sensitive time\n\ntoggle caption Spencer Platt/Getty Images\n\nA key report on the job market will not be published on Friday, as scheduled, as a result of the government shutdown. That means businesses and policymakers will be left guessing about the strength of the labor market at a time when the U.S. economy appears to be slowing.\n\nIf the shutdown drags on for more than a few days, a report on inflation scheduled for mid-October could also be delayed. That report is part of the formula used to calculate the cost-of-living adjustment (COLA) that Social Security recipients receive next year.\n\nThe number-crunching bureau at the Labor Department is one of many government agencies idled by the shutdown. A similar work stoppage in 2013 delayed key economic reports for more than two weeks.\n\nThe shutdown comes at a sensitive time for the economy. Hiring slowed sharply in recent months, and government tallies showed that employers actually cut jobs in June for the first time since 2020. The unemployment rate inched up to 4.3% in August — its highest reading in almost four years. The September jobs report would ordinarily help shed light on whether those trends continued into early fall.\n\nSponsor Message\n\nConcerns about weakness in the job market prompted the Federal Reserve to cut interest rates in September for the first time all year. The Fed faces another rate-setting decision in four weeks, and policymakers would like to have up-to-date information on hiring and unemployment.\n\nConsumer prices data could also be delayed\n\nInflation has also heated up slightly in recent months, partly as a result of President Trump's tariffs. Consumer prices in August were up 2.9% from a year ago, compared with a 2.7% annual increase the previous month. Inflation figures for September are supposed to be released on Oct. 15. The cost-of-living readings for July, August and September are used to calculate the annual Social Security COLA.\n\nWhile there are alternative measures of economic activity, none can match the reach of the federal government, which surveys tens of thousands of households and businesses every month.\n\nEven before the shutdown, staffing cuts at the Bureau of Labor Statistics had forced the government to scale back its monthly price checks. The agency says that during the shutdown, it will not collect, process or share economic data. Once funding is restored, the BLS says, it will resume normal operations and publish an updated schedule of when data will be released.",
    "url": "https://www.npr.org/2025/10/01/nx-s1-5558020/government-shutdown-economic-data-jobs-inflation",
    "source": "newsapi",
    "author": "Scott Horsley",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "shutdown",
      "government",
      "time",
      "economic",
      "report",
      "september",
      "could",
      "market",
      "labor",
      "inflation"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:05.440170+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": "2025-10-01T00:00:00"
  },
  {
    "id": "e7a7a6002a077419362847639cf507b9",
    "title": "Elon Musk responds to Tesla pay proposal by buying $1 billion worth of stock",
    "content": "is transportation editor with 10+ years of experience who covers EVs, public transportation, and aviation. His work has appeared in The New York Daily News and City & State.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nElon Musk is responding to the unprecedented pay package proposal from Tesla’s board of directors by slightly increasing his stake in the company. Musk bought $1 billion in Tesla stock through an irrevocable trust on September 12th, according to a regulatory filing released Monday. Tesla shares were trading up over 5 percent on the news, pushing the company’s value into positive territory for the year.\n\nIt was Musk’s first open-market purchase of Tesla stock in over five years, according to Bloomberg. He offloaded more than $20 billion of the company’s shares in 2022, which was the year he acquired Twitter. Other Tesla executives have similarly sold off some of their shares this year, including several board members.\n\nThe purchase comes more than a week after Tesla’s board proposed a pay package that, if enacted, would make Musk the world’s first trillionaire. Musk would need to meet a series of ambitious milestones to receive the compensation, including producing over a million robots, a million robotaxis, and creating $7.5 trillion in value for Tesla’s shareholders.\n\nIt was Musk’s first open-market purchase of Tesla stock in over five years.\n\nMusk is currently Tesla’s largest shareholder, with a 13 percent stake in the company. But the CEO has said that he wants more control over the company in order to have more sway over its mission — which the board’s plans aims to produce. Musk’s purchase of 2.57 million shares last week increases his stake in Tesla by less than 1 percent.\n\nTesla’s stock price has been on a rollercoaster this year, as rising competition in the EV market combined with Musk’s political activities have weighed on the once high-flying company. The company’s share of the EV market in the US slipped below 40 percent recently, as EV sales continue to slow and other models lure buyers away.\n\nMusk is betting the company’s future on AI and robotics, recently releasing a new master plan that appears to downplay Tesla’s core business of making and selling electric cars. But he has also cautioned that the company could be in for a “few rough quarters” as the US government phases out EV incentives and sales are expected to fall even more.",
    "url": "https://www.theverge.com/news/778103/elon-musk-tesla-shares-purchase-billion-dollars",
    "source": "newsapi",
    "author": "Andrew J. Hawkins",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "musk",
      "teslas",
      "tesla",
      "over",
      "company",
      "more",
      "stock",
      "shares",
      "percent",
      "companys"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:07.056236+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": "2025-09-15T15:02:42+00:00"
  },
  {
    "id": "80d00bbd6cb06427355d43700563463b",
    "title": "Job seekers at their wits' end are finding a few silver linings",
    "content": "Recent job seekers told Business Insider they've tried various techniques to find a job but are still looking.\n\nRecent job seekers told Business Insider they've tried various techniques to find a job but are still looking. Joe Raedle/Getty Images\n\nRecent job seekers told Business Insider they've tried various techniques to find a job but are still looking. Joe Raedle/Getty Images\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nMichael Moeller is exhausted from searching for a full-time job since being laid off from his director-level role in April.\n\nHe said that it was \"brutal\" to keep getting rejection emails from companies. \"But also to be quite frank, these are jobs that I don't even remember applying to at this point either,\" he added.\n\nBut Moeller, who is in his early 30s, said there's a silver lining to still being stuck on the job hunt. He can build his business, Kentucky Hop Water, more quickly. He also has some time to train for marathons and take on bartending work to make some income.\n\nHe hopes to get a job soon and return to running his brand on the side, but it's been fairly quiet recently.\n\n\"It's been more than a month since I've gotten even the opportunity for a screening, so I don't quite understand what's going on,\" Moeller said.\n\nMichael Moeller has been job searching while working on his business. Michael Moeller\n\nLast week brought even more dismal news for job seekers. Friday's brutal jobs report showed anemic growth in August and even a decline in June. It followed Wednesday's data release showing slightly more unemployed workers in July than job openings for the first time since the post-COVID reopening in 2021.\n\nOf course, softer job growth alone doesn't mean a recession is certain. \"The low-hire, low-fire labor market, like the slow-growth economy, is at risk of a recession, but it's not enough to cause a recession,\" Claudia Sahm, chief economist for New Century Advisors, said in August.\n\nAspiring job seekers like Moeller may have to consider part-time work, turn passions into businesses, or look for temporary jobs.\n\nThis job market slowdown is different from the past\n\nWage growth and remote work postings have cooled, and job growth has been concentrated in just a handful of industries, like healthcare, although even that has begun to slow.\n\nHowever, economists said that while the market is unusual, the US isn't in a recession.\n\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know\n\n\"We've been through periods where job openings decline, where job growth slows, where the unemployment rate rises, but typically those periods are pretty short-lived because a lot of times they end in a recession,\" Dante DeAntonio, a senior director at Moody's Analytics, said in July.\n\nGuy Berger, a workforce economist in residence at Guild and a senior fellow at the Burning Glass Institute, said in August that the length and moderation of the job market slowdown mean it may not lead to a recession because lower immigration and an aging population suggest the US has \"turned the labor supply tap off,\" so slower job growth may not be as big a problem as it was a few years ago.​​\n\nAre you struggling to get a job, or have you pivoted to self-employment? Reach out to this reporter to share your story at mhoff@businessinsider.com.\n\nA disheartening job search\n\nThe lack of an official recession likely doesn't comfort the 7 million unemployed people in the US. About a dozen job seekers recently spoke with Business Insider, including some who've been unemployed for at least a year. Many of them have tried networking, upskilling, and leveraging AI. Some said they have expanded their search, while others have tried to keep it targeted.\n\nThey described job searching as brutal, frustrating, and disheartening.\n\n\"I feel like companies are really looking for their unicorn person,\" said Laura Perry-Fields, who has been on the job hunt for the past few months. \"They're looking for this perfect person, and if you don't check all their boxes, they're still hoping that somebody else can fill that need.\"\n\nSome people are excited to try something new, like building a business or trying contract work. Roy Miller, 61, was laid off and navigating his first serious job search in about a decade. The job search has been tough, but he has also used the time to reflect on how else he can leverage his skills.\n\n\"I don't want to wear my khakis and polo shirt to an office every day,\" Miller said. \"So I've been looking at, OK, what's next? What does this new season bring? Increasingly, it's let's get back to being an entrepreneur and use the skillset that I have.\"\n\nRoy Miller is excited for a potential new chapter in his career after being laid off. Roy Miller\n\nHow to get a job right now\n\nSo what do you do if you need a job in this low-hiring, low-firing market? Workplace experts and job seekers said you may have to apply for short-term roles or lean on side hustles that can help build experience and fill gaps while looking for full-time work.\n\nSam DeMase, a career expert at ZipRecruiter, suggested pivoting to an open role \"that already values existing skill sets you have, rather than you having to go get a new degree or learn new skills from scratch,\" such as a teacher applying to be a curriculum builder for corporate training.\n\nDeMase said to identify a few top-aligned skills and figure out how to boast about those during the job search.\n\nLaid-off employees can also use their skills to move into self-employment and expand their job search from just full-time roles. Michelle Reisdorf, a district director at talent solutions firm Robert Half, suggested people shift their mindsets about needing a permanent job because sometimes companies need someone temporarily to help meet project deadlines.\n\n\"You might be out there interviewing and not have enough skills to land the perfect job you want, but by taking a contract role, you could pick up many skills that suddenly make you that much more attractive to an employer,\" Reisdorf said.\n\nShe said a contract gig could also lead to a full-time position when there's an opportunity.\n\nThomas Reynolds would be happy if contract work at a friend's law firm led to generating full-time work. For the past few months, he's been mainly looking at the private sector for new work after his government position was cut in January. Reynolds, who is a lawyer, also just went back to law school to get an additional degree and to buy some job-search time.\n\n\"My friend is really gracious, and he said that this could turn into something bigger, and we can help support you, and I can do some business development, and he's definitely still keeping me in mind for projects,\" Reynolds said.",
    "url": "https://www.businessinsider.com/what-to-do-if-need-job-frustrating-frozen-labor-market-2025-9",
    "source": "newsapi",
    "author": "Madison Hoff, Enter Your Email, Follow Authors, Never Miss A Story",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "said",
      "business",
      "been",
      "insider",
      "looking",
      "work",
      "seekers",
      "some",
      "recession",
      "still"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:08.589550+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "9715eb69e5c65fc0de6f8a314cb4f3d3",
    "title": "The Next Two Weeks Could Redefine Tech",
    "content": "There’s always something at risk when it comes to investing. But right now, it is definitely smart to keep your eyes open for major market disturbances.\n\nWith the risk-reward balance in the U.S. equities market stabilizing, Wall Street has entered a pivotal stretch over the next 14 trading sessions that may determine its near-term direction. In a span often defined by uncertainty, key economic data and Fed policy will weigh heavily on investor sentiment.\n\nNo sector is more vulnerable than tech.\n\nWhat’s happening in the next two weeks?\n\nInvestors will navigate a dense calendar featuring the latest employment figures, a critical inflation gauge, and the Federal Reserve’s interest-rate decision, each offering clues about the path of monetary policy.\n\nBloomberg posits that these events may crystallize Wall Street’s path for the remainder of the year.\n\nTech in the spotlight\n\nNowhere is the market’s vulnerability more visible than in technology stocks, which have driven much of this year’s advance.\n\nThe so-called “Magnificent Seven” account for more than 30% of the S&P 500’s weighting. Their performance in the coming two weeks could dictate whether the broader market weathers potential shocks or stumbles.\n\nRecent earnings have underscored both resilience and risk. Nvidia, for instance, posted record quarterly revenue on the back of AI demand, but analysts warn its lofty valuation leaves little room for disappointment. Apple’s iPhone cycle and cloud revenues at Amazon and Microsoft will be closely watched, with any softness potentially magnified across the index.\n\nHistory suggests volatility in tech can quickly ripple outward. In September 2020, a sharp pullback in mega-cap tech erased trillions in market value in a matter of weeks. This year, valuations again look stretched: The NASDAQ trades near 30 times forward earnings, well above its long-term average.\n\nIf it is calm now, why worry?\n\nEquity markets remain unusually tranquil. The S&P 500 has not suffered a 2% drop in 91 straight trading sessions, the longest stretch since July 2024. Meanwhile the the VIX volatility index has stayed below the 20 threshold nearly without interruption since late June.\n\nThomas Lee, head of research at Fundstrat Global Advisors, warns that while a correction is plausible, calling for a 5% to 10% pullback in the fall. But the index could still rebound toward 6,800 to 7,000 points by year-end, The Economic Times Reports.\n\n“Investors are assuming correctly to be cautious in September,” Lee told Bloomberg. “The Fed is re-embarking on a dovish cutting cycle after a long pause. This makes it tricky for traders to position.”\n\nSeasonal risks and overvaluation\n\nSeptember is historically one of the weakest months for stocks. Bloomberg notes that over the past three decades, the S&P 500 has averaged declines in September, falling in four of the last five years, adding weight to the caution.\n\nMoreover, the index trades at approximately 22 times forward earnings. That is a valuation level seen only during the dot-com bubble and the post-pandemic tech frenzy.\n\n“We’re buyers of big tech,” Tatyana Bunich, president and founder of Financial 1 Tax, told Bloomberg. “But those shares are very pricey right now, so we’re holding some cash on the sidelines and waiting for any decent pullback before we add more to that position.”\n\nSummary Table: Market Dynamics at a Glance\n\nFactor Current Position Upcoming Catalysts Jobs report, inflation data, Fed decision in next 14 sessions Volatility Level (VIX) Sub-20, historically low S&P 500 Momentum No 2% intraday drop in 91 sessions Expected Fall Corrective Move Possible 5–10% pullback, then rebound to 6,800–7,000 Valuation Concern Trading at ~22× forward earnings (historical peaks) Seasonal Pattern September tends to be weak historically\n\nSo does the risk outweigh the return?\n\nThe message from Wall Street’s data-driven bull is clear: remain cautious in the short term, even as optimism for a year-end recovery holds.\n\nThe unusual calm in volatility may be lulling investors into complacency, setting the stage for a sudden selloff if data or the Federal Reserve defy expectations. But if the policy outlook turns favorable, markets may resume their march upward.\n\nThis two-week window is shaping up less like a routine market cycle and more like a crossroads split between correction and breakout.\n\n“I expect this stock rally to stall soon,” famous bull Ed Yardeni of Yardeni Research, told Bloomberg.\n\n“The market is discounting a lot of happy news, so if CPI is hot and there’s a strong jobs report, traders suddenly may conclude rate cuts aren’t necessarily a done deal, which may lead to a brief selloff,” he said. “But stocks will recover once traders realize the Fed can’t cut rates by much because of a good reason: The economy is still strong.”",
    "url": "https://gizmodo.com/the-next-two-weeks-could-redefine-tech-2000653033",
    "source": "newsapi",
    "author": "Riley Gutiérrez Mcdermid, Aj Dellinger",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "market",
      "tech",
      "more",
      "bloomberg",
      "september",
      "sessions",
      "earnings",
      "index",
      "volatility",
      "pullback"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:10.020744+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": "2025-09-04T11:00:52+00:00"
  },
  {
    "id": "e89b736a8d89c81c54d3eaa96b0fd1cc",
    "title": "$55 billion EA buyout hands Madden over to investors including Saudi Arabia and Jared Kushner",
    "content": "The transaction was approved by EA’s Board of Directors, is expected to close in Q1 FY27 and is subject to customary closing conditions, including receipt of required regulatory approvals and approval by EA stockholders. Following the close of the transaction, EA’s common stock will no longer be listed on any public market.\n\nThe transaction will be funded by a combination of cash from each of PIF, Silver Lake, and Affinity Partners as well as roll-over of PIF’s existing stake in EA, constituting an equity investment of approximately $36 billion, and $20 billion of debt financing fully and solely committed by JPMorgan Chase Bank, N.A., $18 billion of which is expected to be funded at close. Each of PIF, Silver Lake, and Affinity Partners plan to fund the equity component of the financing entirely from capital under their respective control.",
    "url": "https://www.theverge.com/news/787112/electronic-arts-55-billion-privacte-acquisition-pif-silver-lake-affinity-partners",
    "source": "newsapi",
    "author": "Emma Roth",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "transaction",
      "close",
      "billion",
      "expected",
      "funded",
      "each",
      "silver",
      "lake",
      "affinity",
      "partners"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:11.760418+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": "2025-09-29T12:51:27+00:00"
  },
  {
    "id": "0ea112215faab0e122ae5d2aacf499f8",
    "title": "Ethereum Plummets Below $4,000 As Whale Trader Takes $36 Million Loss",
    "content": "Ethereum (CRYPTO: ETH) has dipped below the $4,000 mark, triggering massive losses for one whale trader and renewing fears about further downside.\n\n\n\n\n\nCryptocurrency Ticker Price Market Cap 7-Day Trend Ethereum (CRYPTO: ETH) $3,988.08 $481.5 billion -12.9% Bitcoin (CRYPTO: BTC) $111,359.45 $2.2 trillion -5% XRP (CRYPTO: XRP) $2.82 $168.9 billion -9.5%\n\nTrader Notes: Trader CrediBULL Crypto emphasizes that a 30% drop from all-time highs isn't alarming, citing Bitcoin's similar 20–40% corrections during the 2017 bull run.\n\nHe stresses that structural support levels matter more than the size of the drop.\n\nThe high-timeframe impulse starts at $2,090, so a dip below the current zone would still be healthy, though a bounce would be ideal. He cautions, \"Don't start screaming \"ETH is dead\" again like you guys did under $2,000 just because of a dip.\"\n\nCold Blooded Shiller pointed out that ETH has gained 280% over four months, compared to gold's 12% upside.\n\nHe argued that routine pullbacks are normal and only weekly closes below key support should shift the bearish narrative.\n\nTrader Mags notes that ETH is testing a critical support zone after 1,127 days of consolidation, cautioning that a daily close under $4,000 could signal a bearish trend.\n\nStatistics: Lookonchain data highlighted an Ethereum whale that got liquidated on a 9,152 ETH, worth $36.4 million, long position as prices dropped below the $4,000 mark. This takes his total loss to more than $45.3 million.\n\nCommunity News: Hashdex Asset Management and Nasdaq Global Indexes announced the expansion of the Hashdex Nasdaq Crypto Index US ETF (NCIQ) to now include spot Bitcoin, Ethereum, XRP, Solana, and Stellar.\n\nRead Next:\n\nImage: Shutterstock\n\nUNLOCKED: 5 NEW TRADES EVERY WEEK. Click now to get top trade ideas daily, plus unlimited access to cutting-edge tools and strategies to gain an edge in the markets.\n\nGet the latest stock analysis from Benzinga?\n\nThis article Ethereum Plummets Below $4,000 As Whale Trader Takes $36 Million Loss originally appeared on Benzinga.com\n\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.",
    "url": "https://finance.yahoo.com/news/ethereum-plummets-below-4-000-132235572.html",
    "source": "newsapi",
    "author": "September, Min Read",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "crypto",
      "ethereum",
      "below",
      "trader",
      "whale",
      "support",
      "million",
      "mark",
      "trend",
      "billion"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:13.304500+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "9b118d043150f8fb0144125aea3b9d8e",
    "title": "What the Hell Is Going on With Crypto Billionaire Justin Sun and Donald Trump?",
    "content": "World Liberty Financial’s crypto token WLFI started trading on exchanges Monday, which was great news for President Donald Trump’s family, who holds a reported 22.5 billion tokens. The move instantly created billions in wealth for America’s ruling family of fascists (at least on paper).\n\nBut Justin Sun, a pro-Trump crypto billionaire who reportedly bought about $75 million of the token, says his wallets have been frozen. And nobody is sure why.\n\nThe Trump family was instrumental in launching World Liberty in Oct. 2024, a highly controversial and unprecedented move given the fact that Donald Trump was running for the nation’s highest office at the time. A company controlled by the Trumps owns about 60% of the crypto firm, according to ABC News. And Trump has spent his first eight months in office doing everything he can to benefit the crypto industry.\n\nThe 35-year-old Sun, an advisor to World Liberty and ally of Trump, apparently tried to transfer about 50 million WLFI ($9 million worth) on Thursday after the value of the coin crashed 40% in just a few days, according to Bloomberg. But that’s when World Liberty blacklisted Sun, about 6 hours later. And he took to X to complain about it.\n\n“To the World Liberty Financials team and the global community,” Sun wrote late Thursday on X, “As one of the early major investors in World Liberty Financials, I have contributed not only capital but also my trust and support for the future of this project. My goal has always been to grow alongside the team and community, and to jointly build a strong and healthy WLF ecosystem. However, during the course of operations, my tokens were unreasonably frozen.”\n\nSun went on to make an appeal that his wallets not be blacklisted, claiming that tokens are “sacred and inviolable,” something that sounds rather amusing in a situation like this.\n\n“As one of the early investors, I joined together with everyone—we bought in the same way, and we all deserve the same rights. I love and respect every member of this community. Tokens are sacred and inviolable—this should be the most basic value of any blockchain. It’s also what makes us stronger and more fair than traditional finance,” Sun wrote.\n\nSun, who previously pledged not to sell his coins, seemed quite upset in his tweet Thursday, though he didn’t reveal details about why he believed his wallets were frozen. About 80% of Sun’s tokens are supposed to be locked up based on rules for early investors, according to Bloomberg.\n\n“I call on the team to respect these principles, unlock my tokens, and let’s move forward together toward the success of World Liberty Financials. I believe that a truly great financial brand must be built on fairness, transparency, and trust—not on unilateral actions that freeze investor assets. Such measures not only violate the legitimate rights of investors, but also risk damaging broader confidence in World Liberty Financials.”\n\nTo the World Liberty Financials team and the global community, As one of the early major investors in World Liberty Financials, I have contributed not only capital but also my trust and support for the future of this project. My goal has always been to grow alongside the team… — H.E. Justin Sun 👨‍🚀 (Astronaut Version) (@justinsuntron) September 5, 2025\n\nSun acknowledged earlier Thursday in a much shorter post that he had moved some tokens, but insisted they were “tests” of “very small amounts” and that no buying or selling had happened. The tweet seemed to suggest that World Financial thought he was attempting to unload too many coins early.\n\nOur address only carried out a few general exchange deposit tests with very small amounts, followed by an address dispersion. No buying or selling was involved, so it could not possibly have any impact on the market. — H.E. Justin Sun 👨‍🚀 (Astronaut Version) (@justinsuntron) September 4, 2025\n\nTypically, wallets are frozen in extreme cases, like at the request of law enforcement. But there’s nothing publicly available that would suggest Sun’s tokens were frozen for illegal activity.\n\nThe billionaire has come under scrutiny in the past, though an investigation into Sun by the Securities and Exchange Commission was paused after Trump took office, according to the Wall Street Journal.\n\nSun’s wallet wasn’t the only one that was blacklisted by World Liberty. All told, more than 270 wallets were flagged by the crypto firm over the past week, according to crypto researcher Zack Pokorny in a tweet on X.\n\nLooks like WLFI has blacklisted 272 addresses over the last week, a few of the transactions were bulk blacklists. 50 addresses here: https://t.co/wYaY2Gc18o 215 more here: https://t.co/Uc4GKTKgbT 3 more here: https://t.co/IMZ4NVsvMH — Zack (@ZackPokorny_) September 4, 2025\n\nWorld Liberty isn’t Trump’s only crypto venture. The president launched his own memecoin just a few days before his inauguration on Jan. 20. Sun also invested heavily in Trump’s memecoin and attended a dinner hosted by the sitting president back in May for people who bought his crypto. First Lady Melania Trump also has her own memecoin. Both coins are down significantly since they were launched, with $TRUMP down about 90% since its peak immediately after launch.\n\nOn my way to Trump dinner @GetTrumpMemes pic.twitter.com/CInPrawsvI — H.E. Justin Sun 👨‍🚀 (Astronaut Version) (@justinsuntron) May 22, 2025\n\nThe WLFI token is currently trading at $0.18, according to CoinMarketCap, up 4% on the day but still down 20% on the week. World Liberty and Justin Sun didn’t immediately respond to a request for comment on Friday. Gizmodo will update this article if we hear back.",
    "url": "https://gizmodo.com/justin-sun-wlfi-cryptocurrency-donald-trump-2000654420",
    "source": "newsapi",
    "author": "Matt Novak, Ece Yildirim, Aj Dellinger, Ed Cara",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "world",
      "liberty",
      "crypto",
      "tokens",
      "about",
      "trump",
      "financials",
      "according",
      "only",
      "also"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:16.491510+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": "2025-09-05T17:30:06+00:00"
  },
  {
    "id": "d14ad3b745f6f1adac40c0163b12487c",
    "title": "Five challenges facing Mark Carney",
    "content": "Five challenges facing Canada's Mark Carney\n\n15 September 2025 Share Save Jessica Murphy BBC News, Toronto Share Save\n\nBloomberg via Getty Images Mark Carney became the first new Canadian prime minister in nine years when he was elected six months ago\n\nA trade war with its largest economic partner, a faltering economy - and a lot of promises to deliver on. These are only some of the high-stake tests facing Canadian Prime Minister Mark Carney as parliament returns for the autumn sitting on Monday. Here is a look at some of the political pressures on his Liberal government's horizon.\n\nVoters want action on lofty pledges\n\nCarney's Liberals made a series of lofty promises during the recent election campaign, from making Canada's economy the strongest in the G7 to \"turbo-charging\" major infrastructure projects and massively ramping up housing development. Now, voters are ready to see progress. Canadians \"will be looking for clear actions that make a difference, and that's where the rubber will really hit the road for Mark Carney\", said Sébastien Dallaire, an executive vice-president with polling firm Leger. There has been some movement on big issues. Last week, the prime minister unveiled the first series of \"nation-building\" projects that Ottawa will review for fast-track approvals - a key part of his wider economic agenda. They include a plan to double production of liquefied natural gas (LNG) at a British Columbia plant, the expansion of part of Montreal's port, and building a small modular nuclear reactor in Ontario. Carney has also announced $13bn (£6.9bn, $9.4bn) for a new federal housing agency to help build new homes, and vowed to diversify trade away from the US. In politics it's usually prudent to under-promise and over-deliver, said Marci Surkes, chief strategy officer at public affairs firm Compass Rose and a former policy director to Carney's predecessor, Justin Trudeau. \"Mr Carney has taken quite a different tack, where he has really set the bar very high in terms of expectations,\" she said. She added: \"There's already impatience from those who are waiting to see results.\"\n\nEconomic woes surpass Trump fears\n\nAnxiety around an unpredictable US president helped propel Carney to power last April. Donald Trump has since imposed punishing tariffs on some sectors of the economy, like steel and autos, but has granted a majority of Canadian goods a broad tariff exemption under the current US-Mexico-Canada free trade deal. Mr Dallaire said Canadians know it won't be \"an easy ride\" for the next few years. \"The question has turned to: 'OK, what now?'\" Recent opinion polling suggests that voters are feeling less panicked by Trump but increasingly worried about the economy. Canada's unemployment rate rose to 7.1% last month, a level not seen since 2016, excluding the pandemic, and economic growth slowed sharply over the summer, contracting by 1.6%. A poll released by Abacus Data this month indicates that six in 10 respondents felt the Ottawa government was too focused on the US president at the expense of pressing concerns like housing, healthcare, and affordability. Still, for Carney, there's some silver lining. Many don't blame him directly for the economic shocks of Trump's policies - but they will be watching how the prime minister navigates what he has called a \"rupture\" in the global economy. \"A souring economy will become a drag on the popularity of the government, but it really depends to what extent it happens and to what extent Canadians see visible changes,\" said Mr Dallaire.\n\nAn opposition leader back in the saddle\n\nPierre Poilievre is making his return to the House of Commons. The Conservative leader lost his long-held seat in the April election to a Liberal challenger and was forced to spend his summer seeking a path back to parliament. In August, he won a by-election in Alberta, securing a new seat and a chance to be a foil for Carney in the House. \"The real fighting match is about to begin, and Mr Carney is going to have to swat away or figure out how to handle the punches that will be coming at him,\" said Ms Surkes. In an open letter to Carney last week, Poilievre set the stage, saying: \"So far, you have been judged only by the lofty things you have promised to do one day, not by what you have done.\" Poilievre has sharply focused his message on cost-of-living and crime issues and he plans to target the Liberals - who have been in power since 2015 - on their record, as well as on immigration. That includes pushing them on the number of temporary foreign workers allowed into the country, a programme that has seen a significant expansion in recent years.\n\nAn 'austerity' warning\n\nAn \"austerity and investment\" federal budget is expected later this autumn - a financial balancing act Carney has said is possible with \"discipline\". The prime minister has criticised government spending under Trudeau as \"unsustainable\" and has asked his finance minister to find programme spending cuts across departments that would increase to 15% reductions over the next three years. \"We need to rein in spending. We need to find efficiencies,\" Carney has said. But the prime minister will also have to find a way to deliver on major commitments, including a multi-billion dollar increase in defence spending promised to Nato partners, notably the US. It comes amid lower revenues from tariffs and other financial challenges, likely leaving officials \"shaking every couch cushion loose for change\", said Ms Surkes. \"Here we have a circumstance where the government is trying to walk and chew gum at the same time, if you will - where it is both trying to identify cuts and restraint, but also has committed publicly to some very significant investments,\" she said.\n\nBloomberg via Getty Images Canada will look to fast-track a project that will double LNG Canada's production of liquefied natural gas in the coming years\n\nPushback on the horizon",
    "url": "https://www.bbc.com/news/articles/ckg2700vzrko",
    "source": "newsapi",
    "author": null,
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "carney",
      "said",
      "minister",
      "prime",
      "economy",
      "some",
      "years",
      "economic",
      "what",
      "canadas"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:18.218458+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "2b2bdf930a7f8cb4a53df88932be1388",
    "title": "Coinbase Trading Above 200-Day SMA: Is it Time to Add the Stock?",
    "content": "Coinbase Global COIN is trading above its 200-day simple moving average (SMA), signaling a bullish trend. The 50-day and 200-day SMAs are key indicators for traders and analysts to identify support and resistance levels. These are considered particularly important as they are the first markers of an uptrend or downtrend.\n\n\n\nCOIN, the crypto leader, is poised to benefit from listing a broader range of crypto assets and tokenized equities, international expansion, strategic buyouts and increased volatility. It is continually undertaking strategic growth initiatives, fortifying its on-chain consumer strategy by building on DeFi-powered consumer applications, launching a unique equity index future and joining traditional finance with crypto, among others. CEO Brian Armstrong envisions Coinbase to be the “everything exchange.”\n\nCOIN's 200-Day SMA\n\nZacks Investment Research\n\n\n\nImage Source: Zacks Investment Research\n\nCOIN: An Outperformer\n\nShares of Coinbase have rallied 98.7% year to date compared with the industry’s increase of 18.1%, the sector’s rise of 17.6% and the Zacks S&P 500 composite’s gain of 18.1%.\n\nZacks Investment Research\n\n\n\nImage Source: Zacks Investment Research\n\nShares of Robinhood Markets HOOD and Interactive Brokers Group, Inc. IBKR, both crypto-oriented companies, have gained 211.7% and 45.2% year to date , respectively.\n\n\n\nRobinhood has evolved from a brokerage firm mainly trading in digital assets to a more mature and diversified entity, striving to widen its market and reach. Robinhood continues to diversify its product base to acquire new clients and gain market share.\n\n\n\nInteractive Brokers is known for its advanced electronic trading platforms and global market access. The company leverages proprietary systems to automate nearly every aspect of the brokerage process — from trade execution and risk management to compliance and customer onboarding —enabling it to operate with minimal human intervention and significantly lower costs than traditional brokers.\n\n\n\nShould you consider adding COIN to your portfolio only based on positive price movements? Let’s delve deeper and find out the factors that can help investors decide whether it is a good time to add COIN stock to their portfolios.\n\nFactors Acting as a Tailwind for COIN Stock\n\nCoinbase, America’s largest registered crypto exchange, stands to gain from increased volatility and rising prices in the crypto asset market. The accelerating adoption of stablecoins is poised to further boost revenues. Coinbase posted positive EBITDA for eight consecutive quarters, supported by the durability of its subscription-based model.\n\n\n\nCoinbase stands to gain from strengthened banking relationships, new licenses and the introduction of customized products for diverse customer segments. With a clear growth strategy, the company is increasing its market share in both the U.S. spot and derivatives markets, broadening its product suite and expanding its presence globally.\n\n\n\nWhile the Derbit acquisition establishes Coinbase as a global force in futures, options and perpetuals, deals like Liquifi and One River Digital broaden COIN's tokenization and institutional services.\n\n\n\nCOIN added DEX trading to its app for U.S. users, except New York State. This expands access from 300 tokens to potentially millions of assets instantly. The DEX integration supports COIN’s goal of a unified and centralized DeFi platform.\n\n\n\nRecently, the founders of Sensible joined Coinbase to boost its on-chain consumer roadmap. The crypto leader believes the future of finance is on-chain and the team will fortify its on-chain consumer strategy by building on DeFi-powered consumer applications.\n\n\n\nA strong liquidity position enables continued strategic investments aimed at enhancing offerings and driving sustainable growth. Coinbase is a fundamentally strong company. It ended 2024 with $9.3 billion in resources, defined as cash & cash equivalents and USDC, up $3.8 billion year over year. Debt has been decreasing over the past several quarters, while the total debt capital ratio has been improving. Also, its higher times interest earned implies that the company can comfortably service its debt. However, Coinbase recently priced $2.6 billion convertible notes, which increases concerns about dilution and financial leverage.",
    "url": "https://finance.yahoo.com/news/coinbase-trading-above-200-day-174000932.html",
    "source": "newsapi",
    "author": "September, Min Read",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "coinbase",
      "coin",
      "crypto",
      "consumer",
      "zacks",
      "market",
      "trading",
      "onchain",
      "investment",
      "research"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:19.784879+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "14b61efcde50dca83b6a1561e1fc2013",
    "title": "Peter Schiff Challenges Michael Saylor's BTC Strategy",
    "content": "Peter Schiff Challenges Michael Saylor's BTC Strategy\n\nEuro Capital CEO Peter Schiff is challenging Michael Saylor’s bitcoin strategy over the critical issue of liquidity. The crypto skeptic argued that billions of dollars in gold could be sold with limited market impact, while trying to exit a similar bitcoin position could hit prices hard and set off copycat selling. Whose side are you on? CoinDesk’s Jennifer Sanasie hosts “CoinDesk Daily.”",
    "url": "https://videos.coindesk.com/previews/2gv4H3Y5",
    "source": "newsapi",
    "author": "CoinDesk",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "peter",
      "schiff",
      "michael",
      "saylors",
      "strategy",
      "bitcoin",
      "could",
      "challenges",
      "euro",
      "capital"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:23.236426+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "3120484de866438c8a869f6005245d38",
    "title": "From hedge funds to banks: 3 execs reveal their go-to hiring question",
    "content": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nThere's an art to conducting a good job interview — especially for high-stakes, high-intensity roles on Wall Street. Hiring managers have to make a spot-on assessment of candidates they don't know in a short amount of time for roles that can impact their bottom line in a big way. So how do leaders at the top financial firms do it?\n\nIt's all about asking the right questions.\n\nBusiness Insider spoke with three Wall Street executives across business lines, firms, and expertise to get insight into their approach to interviews. We asked each of them to share the one question they ask in every interview — and what they're hoping to learn from it.\n\nWe heard from a trader who previously worked at Citadel and started his own hedge fund, a partner and veteran at Goldman Sachs, and a CEO who runs a wealth management firm.\n\nTheir answers revealed that they try to avoid obvious and predictable \"stock\" interview questions in favor of ones that help uncover what type of person the applicant is. Their responses have been edited for length and clarity.",
    "url": "https://www.businessinsider.com/interview-questions-goldman-sachs-hedge-funds-cintive-michael-lehman-2025-9",
    "source": "newsapi",
    "author": "Emmalyse Brownstein, Enter Your Email, Bradley Saacks",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "their",
      "business",
      "insider",
      "interview",
      "they",
      "roles",
      "wall",
      "street",
      "firms",
      "questions"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:24.854609+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "95471ec16c2f8719f43f5e6a1c227025",
    "title": "BlackRock Continues to Offload Millions in Bitcoin, Ethereum, But for How Long?",
    "content": "Key Notes\n\nBlackRock deposited significant crypto holdings to Coinbase Prime, suggesting potential market-making activities or reserve adjustments.\n\nETF flow data conflicts with on-chain movements, showing mixed signals between institutional demand and actual crypto transfers.\n\nAnalysts remain bullish despite apparent sell pressure, citing Federal Reserve rate cut expectations and Tether's recent $2B minting activity.\n\nBlackRock is the world’s largest asset manager and the leading institution in Bitcoin BTC $122 399 24h volatility: 1.5% Market cap: $2.44 T Vol. 24h: $71.09 B and Ethereum ETH $4 501 24h volatility: 0.3% Market cap: $543.21 B Vol. 24h: $36.76 B exchange-traded funds (ETFs), offering via iShares products IBIT and ETHA, traded on Nasdaq. Differently from TradFi, part of BlackRock’s activities can be seen on-chain, with BTC and ETH moves to (deposits) and from (withdrawals) Coinbase Prime accounts, usually representing sales and purchases, respectively.\n\nOn that note, Lookonchain and other on-chain analytic tools have been monitoring BlackRock activity, spotting recent likely sell-offs in the past two days, with significant deposits to Coinbase.\n\nAsset Manager Moves $640M in Crypto Assets Over Two-Day Period\n\nOn September 9, BlackRock-owned accounts deposited 44,774 ETH, worth $195.29 million, and 900 BTC, worth $101.67 million, to Coinbase Prime, based on Lookonchain’s post. Before that, on September 8, the asset manager was seen depositing 72,370 ETH, worth $312 million, and 266.79 BTC, worth $29.88 million.\n\nETF Flows Show Conflicting Signals With On-Chain Activity\n\nBlackRock’s market-making activities are a direct reflection of the ETFs’ net capital flows. They should represent the real-world adjustment and settlement of the ETFs’ holdings to match investor demand for shares, bridging traditional finance (TradFi) trading on Nasdaq with the crypto market. Nevertheless, the deposits and withdrawals are not necessarily representing all the sales and purchases in real time—simply reserve adjustments.\n\nFor example, on September 8, IBIT and ETHA saw net flows of +229 BTC, worth $25.50 million, and -43,770 ETH, worth $192.70 million, respectively, according to data from Coinglass. On September 9, however, IBIT added 227 BTC. Lookonchain reported this movement in the September 9 update, showing similar numbers that conflict with the recently observed on-chain activity.\n\nBoth assets had massive outflows last Friday, on September 5, which may have required the reserve adjustments on Coinbase Prime, as seen earlier today from the Lookonchain report, causing large deposits and sell-offs. Or, institutions are positioning in advance of a yet unknown pricing event, as smart money like BlackRock can be seen as a market canary.\n\nCrypto Analysts Signal Potential Bull Rally Despite BlackRock Sell Pressure\n\nNow, the price charts appear to be forming a bullish structure for Bitcoin, Ethereum, and other cryptocurrencies, potentially signaling a recovering institutional interest, again conflicting with the signal from Wall Street whales.\n\nAdditionally, Arkham has reported BlackRock is “buying more” cryptocurrencies, reaching over $100 billion in total reserves.\n\nBLACKROCK NOW HOLDS OVER $100B IN CRYPTO AND THEY’RE BUYING MORE pic.twitter.com/7eRAzJ0fod — Arkham (@arkham) September 9, 2025\n\nCrypNuevo, a prominent Bitcoin analyst with a relevant accuracy rate, believes BTC is poised for a bull rally in the following days, hunting upward liquidity in the expectation of a Federal Reserve interest rate cut.\n\n$BTC Sunday update: 10 days until the first Interest Rate cut this cycle, and the chart is undecided with choppy Price Action. Uptrend structure is intact but sentiment is bearish in this pullback and many are calling it a sell the news event. How am I playing this? 🧵↓(1/7) pic.twitter.com/h1Y4DhFXK7 — CrypNuevo 🔨 (@CrypNuevo) September 7, 2025\n\nOther indicators, like Tether minting 2 billion USDT during a market dip, very similar to what happened in December 2024, could also suggest it is time to buy and not sell, as seen in BlackRock’s recent activities.\n\nAll that only evidences the volatility and complexity of short-term speculation, which is affected by a lot of nuance and different factors, together with big players’ movements.\n\nDisclaimer: Coinspeaker is committed to providing unbiased and transparent reporting. This article aims to deliver accurate and timely information but should not be taken as financial or investment advice. Since market conditions can change rapidly, we encourage you to verify information on your own and consult with a professional before making any decisions based on this content.",
    "url": "https://www.coinspeaker.com/blackrock-continues-to-offload-millions-in-bitcoin-ethereum-but-for-how-long/",
    "source": "newsapi",
    "author": "Vini Barbosa, Parth Dubey, Tristan Greene, Bhushan Akolkar",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "september",
      "blackrock",
      "crypto",
      "market",
      "worth",
      "million",
      "coinbase",
      "reserve",
      "onchain",
      "seen"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:26.661041+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": "2025-09-09T22:24:24+00:00"
  },
  {
    "id": "72880282c1081e900b47e5f08c504c13",
    "title": "From the bench to the boardroom: What sports taught me about winning in finance",
    "content": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nSara Naison-Tarajano is a Goldman Sachs partner who says her rise on Wall Street was shaped by her years playing competitive sports — starting with a defining moment when she was nearly benched from her youth basketball team for being the only girl.\n\n\"We won the city championships, and another team tried to kick me out of the league,\" Naison-Tarajano told Business Insider, adding: \"It was very confusing.\"\n\nThis was pre-TikTok, but the story went viral in its own 1980s way: It was covered extensively in New York-area newspapers such as The New York Times and Newsday. Naison-Tarajano said it was also featured in a three-minute Sesame Street segment.\n\n\"It was a big thing, and I was little, I was in fifth grade,\" she told BI.\n\nToday, Naison-Tarajano is a partner and 26-year veteran at Goldman Sachs. She says sports have helped shape her career, which has spanned investment banking, derivatives, and now private wealth management. She talked to BI about how what she learned from playing tennis and basketball, and fighting for her right to play with the boys, helped carve the path to Wall Street.\n\n\n\nNaison-Tarajano on the right at a game. Sara Naison-Tarajano\n\nFrom courts to markets\n\nNaison-Tarajano was big into sports such as tennis and basketball growing up, thanks in part to her father.\n\n\"He felt that it was really important that his daughter have confidence and strength, and he really viewed sports as an incredible outlet for that,\" she said.\n\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know\n\nWhen Naison-Tarajano was 11 (then Naison-Phillips), she was just starting her third year playing on a basketball team made up of kids from Park Slope, Brooklyn. She happened to be the only girl on the team and in the league.\n\nHer team had won the city championship, and when it came time to play the next season, the team they had beaten refused to play against them unless Naison-Phillips was sidelined. The opposing team's coach told the Times he was \"not sure she deserves to be playing,\" and the league considered barring her, the paper reported.\n\nNaison-Tarajano ultimately prevailed in part because her teammates refused to play without her.\n\n\"The fact that they said they wouldn't play without me made me feel supported and gave me the confidence to stand up for myself and other girls,\" Naison-Tarajano recalled in an interview with BI. \"My parents were also incredibly supportive and stood up for me.\"\n\nThe experience, she said, taught her to focus on what she could control.\n\n\"Because I wasn't as tall as the boys, I focused on the skills I could continue to develop, like being aggressive, playing great defense, and becoming a great shooter,\" she said. \"Even though I wasn't the highest scorer, I ultimately was a starter and got playing time because I hustled, was consistent, and never gave up — all of which I have carried with me throughout my career.\"\n\nTennis, however, is where she really found her stride. Naison-Tarajano was eventually recruited to play for Yale and went on to be captain of the university's women's team. One summer, between semesters, a bond trader who was helping her train suggested she had the right personality for Wall Street. She took his advice and started as an investment banking analyst at Goldman in 1999.\n\nNow she says she can see how the characteristics that made her a standout athlete helped shape her success in finance and at Goldman.\n\n\"You know how to deal with losing, how to pick yourself up. I also think something that's pretty important is the ability to keep things in perspective and work well under stress and pressure,\" she said. \"For me, I think that's been a big edge in my career.\"\n\nAfter starting in investment banking, she spent nearly a decade in derivatives before moving to wealth management. Now, she's the global head of private wealth management capital markets, which means she helps clients buy and sell stocks, bonds, or other investments in the financial markets. She also heads Goldman Sachs Apex, a team that gives ultrawealthy family office clients advice and special investment opportunities.\n\nKey to career success on Wall Street, she said, is to find a part of the business that \"genuinely excites you,\" and figure out how to add value, including by voicing your ideas and taking risks.\n\n\"Some of the best moments in my career happened when I stepped outside of my comfort zone and navigated periods of discomfort.\"\n\nShe added: \"Always operate with a growth mindset by being open to feedback, asking questions, and seeking guidance and perspectives from your leaders and peers.\"",
    "url": "https://www.businessinsider.com/goldman-partner-sara-naison-tarajano-basketball-getting-sidelined-wealth-management-2025-9",
    "source": "newsapi",
    "author": "Emmalyse Brownstein, Enter Your Email, Follow Authors, Never Miss A Story",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "naisontarajano",
      "team",
      "said",
      "playing",
      "play",
      "business",
      "insider",
      "goldman",
      "street",
      "career"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:28.961726+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "9462da5dfcc7c6b42310d0151550f6e2",
    "title": "The former CEO of Goldman Sachs thinks that America is due for a crisis — and pinpoints the area of the market he's most worried about",
    "content": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nThe chief executive who led Goldman Sachs during one of the most turbulent periods in the history of markets thinks the US economy may be due for a crisis.\n\nLloyd Blankfein, the former CEO of Goldman Sachs who helmed the bank during the Great Financial Crisis, says he's watching for another big economic event to materialize.\n\nHistorically, the US has had \"the crisis of the century\" once every four to five years, Blankfein told CNBC on Thursday, pointing to the quick succession of crises in the 1990s and early 2000s, like the sovereign debt crisis, the bursting of the dot-com bubble, and the subprime mortgage crisis.\n\n\"There's a lot of 1% risks, but it's not a 1% risk that something bad will happen,\" Blankfein said. \"I'm saying we're due. And it doesn't matter you can't see where it's coming from.\"\n\nMost people's base case doesn't involve a full-blown financial crisis, with stocks at all-time highs and the economy remaining generally resilient despite pockets of weakness.\n\nBut there's one clue as to where the economy's next big problem could arise, in Blankfein's view: credit markets.\n\n\"It usually revolves around leverage. And, in this time, now, probably credit — leverage in places that you don't see it,\" he said of the potential for another big market event.\n\nHere are some of the warning signs Blankfein said he saw in the credit space:\n\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know\n\nCredit spreads are historically narrow. Spreads refer to the yield paid over a benchmark like Treasurys. \"Narrow\" spreads mean that investors perceive less risk in the market, while \"wider\" spreads indicate investors want to be compensated more for higher perceived risk. Similar to warnings of complacency when the stock market is at record highs, some market pros think that historically narrow credit spreads could be a warning that investors are mispricing risk, given recent signs of weakness in certain industries and in the broader economy. The ICE Bank of America US High Yield Index Option-Adjusted Spread hovered near 2.84% in the last week, near a historic low.\n\nMoney flowing into private credit. Private credit, which refers to investors lending to private companies, has been having a big moment in recent years. That's partly because private corporate loans tend to come with higher yields. Assets under management in private credit is growing a 14.5% year-over-year pace, according to data cited in one JPMorgan Private Bank report. \"People trying to, you know, goose their returns a little bit by leveraging up in kind of odd ways,\" Blankfein said, later pointing to the the investment activities of some insurers that have been active in the private credit space. \"Leverage starts to sink in. I think of the places where this is being done,\" he added. \"If I were an insurance regulator at some point, I might say, are those assets really worth what you say they're worth?\"\n\nStill, Blankfein said he remained bullish on markets and the US economy overall.\n\nThat's partly because the Fed looks poised to lower interest rates, a move that could propel stocks further into bull market territory.\n\nThe investing environment also looks \"phenomenal,\" he said, referring to excitement around AI and its potential to boost growth in the US.\n\n\"I have all these bearish thoughts, but I'm still 100% in on equities,\" he said. \"I've lived through waves of technology and experienced things that changed the world. And I experienced things that changed our fortunes because we overinvested in stuff.\"\n\nBlankfein's long-term outlook doesn't differ much from the house view of the bank he used to run. Recently, Goldman's economists stated that they believe the US is entering a fresh secular bull market. In a note, strategists said they saw big opportunities for investors in areas like technology, services, and manufacturing, as well as diversification opportunities outside of the US.",
    "url": "https://www.businessinsider.com/us-economy-outlook-crisis-debt-private-credit-lloyd-blankfein-goldman-sachs-2025-9",
    "source": "newsapi",
    "author": "Jennifer Sor, Enter Your Email, Follow Authors, Never Miss A Story",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "credit",
      "said",
      "private",
      "crisis",
      "blankfein",
      "market",
      "spreads",
      "investors",
      "insider",
      "economy"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:30.623763+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "c13ea70de0278f594719c53584f606ca",
    "title": "Market ructions and cabinet reshuffles will help shape Reeves' Budget",
    "content": "Market ructions and cabinet reshuffles will help shape Reeves' Budget\n\n7 September 2025 Share Save Faisal Islam Economics editor Share Save\n\nWPA Pool/Getty Images\n\nIt's been a bruising first week back for the government, full of resignations, reshuffles, and ructions in markets. All of this will have an impact on what ends up in the chancellor's famous red box outside No 11 in 11 weeks' time. The first thing to note is that it will be Rachel Reeves holding that briefcase for the second time on 26 November. Whatever occurred with the deputy prime minister, the security of Reeves' position was apparent in her conversation with me in Birmingham to announce the date of the Budget. In Downing Street, the message received from the market reaction to the chancellor's summer tears in the Commons was that the cost of borrowing went up when it was thought she was leaving office. When I saw her, brandishing a hard hat and trowel at a housebuilding site, there seemed no question of her going anywhere. \"We need you to get qualified and get more flats and houses up,\" she told two bricklaying apprentices, while not entirely convincing with her own trowel technique. She rather robustly dismissed speculation about Budget measures, large black hole forecasts, and had some sharpish words even for the Office for Budget Responsibility, which we will come back to.\n\nThe chancellor spent the summer travelling the country \"listening to business\" and taking some time off on the Cornish coast. During that same period global bond markets have been looking fragile. Some economists have even floated the idea there is a £50bn black hole that could lead to the need for loans from the IMF. As politicians returned to work this week, and US traders returned on Tuesday from a national holiday, the 30-year gilt rate - the effective interest rate facing the UK government for very long-term borrowing - was heading for highs not seen since the early days of Tony Blair and Gordon Brown. There was some significance to the unwanted landmark: the gains from nearly three decades of relative macroeconomic stability since the Bank of England became independent were being unwound. I put to the chancellor that fragile bond markets were a reflection of the government's, and her own, personal credibility issue. I have had similar interactions with previous chancellors, including Kwasi Kwarteng. Reeves was adamant that this was not the case, that the move in bond markets since the beginning of the year had been in line with global trends. \"Serious economists\" were not talking about the IMF or a UK-specific challenge, she said. By the end of the week, her bullishness was being proven accurate. The 30-year yield had fallen back, not just to where it was on Monday, but significantly lower, mainly off the back of weaker-than-expected US jobs data. This was in common with many major economies. In other words, this week's bond markets rollercoaster was not a verdict on UK domestic, economic or political developments.\n\nLeon Neal/Getty Images Despite a cabinet reshuffle around her, Rachel Reeves remains as chancellor and will deliver her second Budget this autumn\n\nIndeed, by Wednesday the Bank of England governor Andrew Bailey was playing down the entire focus on this measure, saying, \"It is quite a high number but it is not what is being used for funding at all at the moment actually.\" He was referring to the fact that such long-term borrowing only makes up a small fraction of overall government debt. And in terms of demand, there was no sign of a lack of appetite in actual sales of UK debt last week, with record demand on some measures. The bigger picture though is that these forms of debt do not directly affect, for example, five-year fixed mortgage rates.",
    "url": "https://www.bbc.com/news/articles/cqxzr0jdpngo",
    "source": "newsapi",
    "author": null,
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "reeves",
      "budget",
      "markets",
      "some",
      "week",
      "back",
      "there",
      "bond",
      "been",
      "government"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:32.182801+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "31958b6ec2c48c4badf46048b5c4bca9",
    "title": "SoundHound AI (SOUN) Stock Trades Up, Here Is Why",
    "content": "What Happened?\n\nShares of voice AI technology company SoundHound AI (NASDAQ:SOUN) jumped 2.1% in the afternoon session after it received continued positive commentary from Wall Street analysts.\n\nThe move follows several bullish actions, including DA Davidson analyst Gil Luria maintaining a \"Strong Buy\" rating and increasing the price target from $15 to $17 on September 10. Additionally, Wedbush's Daniel Ives reiterated a \"Buy\" rating on September 11. This optimistic analyst sentiment is supported by the company's strong performance, with a recent report noting that SoundHound AI's revenue tripled in the second quarter compared to the previous year. The company's voice AI platform has now surpassed 1 billion queries per month, positioning it to capitalize on the growing use of AI in devices, cars, and homes.\n\nAfter the initial pop the shares cooled down to $14.37, up 1.8% from previous close.\n\nIs now the time to buy SoundHound AI? Access our full analysis report here, it’s free.\n\nWhat Is The Market Telling Us\n\nSoundHound AI’s shares are extremely volatile and have had 92 moves greater than 5% over the last year. In that context, today’s move indicates the market considers this news meaningful but not something that would fundamentally change its perception of the business.\n\nThe previous big move we wrote about was 5 days ago when the stock dropped 4.9% on the news that markets pulled back, reversing early gains, as investor sentiment remained cautious despite a softer-than-expected inflation reading.\n\nStocks rose in the morning session after an unexpected drop in the Producer Price Index (PPI) for August signaled easing inflation and raised expectations for a potential Federal Reserve interest rate cut. The U.S. Bureau of Labor Statistics reported that the PPI, which measures wholesale prices, edged down 0.1% last month, contrary to analyst expectations for a 0.3% rise. This data gives the Federal Reserve more flexibility to consider lowering interest rates to stimulate the economy.\n\nSoundHound AI is down 28.7% since the beginning of the year, and at $14.37 per share, it is trading 40.7% below its 52-week high of $24.23 from December 2024. Investors who bought $1,000 worth of SoundHound AI’s shares at the IPO in April 2022 would now be looking at an investment worth $1,915.\n\nUnless you’ve been living under a rock, it should be obvious by now that generative AI is going to have a huge impact on how large corporations do business. While Nvidia and AMD are trading close to all-time highs, we prefer a lesser-known (but still profitable) semiconductor stock benefiting from the rise of AI. Click here to access our free report on our favorite semiconductor growth story.",
    "url": "https://finance.yahoo.com/news/soundhound-ai-soun-stock-trades-183609103.html",
    "source": "newsapi",
    "author": "September, Min Read",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "soundhound",
      "shares",
      "after",
      "move",
      "analyst",
      "report",
      "previous",
      "year",
      "down",
      "what"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:33.811484+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "051daace171b42151e6bb889592d1277",
    "title": "Bank of England raises alarm over new tax raid",
    "content": "In a highly anticipated move, the Bank also said it would scale back the sale of long-term debt amassed during lockdown and the financial crisis in a move that should ease pressure somewhat on Ms Reeves.\n\nThe Bank’s policymakers held interest rates at 4pc on Thursday following last month’s cut from 4.25pc.\n\nHer comments raise the prospect of another fuel duty freeze, with Treasury officials also examining the idea of removing VAT on gas and electricity bills in a move that would save households about £86 a year at a cost of £1.75bn.\n\nThe Chancellor said ministers would do “everything in our powers to keep costs down and lower them”, adding that she had ordered the Cabinet to look at ways to ease price rises.\n\nThe Bank’s agents said: “Family and individually owned private businesses are concerned about changes in inheritance tax laws making them less willing to invest”.\n\nBosses warned that Ms Reeves’s inheritance tax raid on farmers and entrepreneurs was having a chilling effect on the economy too.\n\nThe Bank has previously warned that recently introduced net zero packaging taxes are also pushing food prices higher, with inflation on supermarket shelves expected to continue for the rest of this year.\n\nMr Bailey blamed higher inflation partly on government policy. In an open letter explaining why it was almost double the Bank’s target at 3.8pc in August, Mr Bailey cited “the increase in employer National Insurance Contributions (NICs) and pay growth in sectors with a large share of employees at or close to the National Living Wage (NLW).”\n\nHowever, Governor Andrew Bailey said: “Although we expect inflation to return to our 2pc target, we’re not out of the woods yet so any future cuts will need to be made gradually and carefully.”\n\nOfficials warned the economy was deteriorating and said the jobs market had ground to a halt, with two of the nine members of the Monetary Policy Committee (MPC) calling for an immediate rate cut to support growth.\n\nThe Bank’s agents, who speak to business leaders across the country, described “consumer caution” as a “key theme”, with “some now worrying about potential impacts on confidence from the upcoming autumn Budget”.\n\nThreadneedle Street’s latest survey of businesses found widespread fear of another slew of tax rises in the upcoming Budget. Economists have warned that Rachel Reeves must find anywhere between £20bn and £50bn in either tax increases or spending cuts to maintain her fiscal plans.\n\nThe Bank of England has warned that fears of another Labour tax raid are already impacting the economy as it kept interest rates on hold at 4pc.\n\nStory Continues\n\nThe Bank said it would shrink its balance sheet by £70bn in the year ahead, a slower pace than the £100bn reduction of last year.\n\nIn an open letter to Mr Bailey, Ms Reeves admitted that inflation was too high but blamed international factors for the increase.\n\nShe added: “The Prime Minister and I recognise that we must do everything in our powers to keep costs down and lower them, and we have asked Cabinet to work with their officials to look at what further action can be taken ahead of the Budget in November. Low and stable inflation is essential for long-term economic growth and sustained increases in living standards.”\n\nSigning off...\n\nThanks for joining us on this live blog.\n\nThat’s all for today but you can follow the latest Telegraph stories on business and the economy here.\n\nSpike in inflation ‘still expected to be temporary’, says Bailey\n\nThe recent spike in inflation is “still expected to be temporary”, according to Andrew Bailey, the Bank of England Governor.\n\nIn a letter to the Chancellor, Mr Bailey wrote: “The recent increase in CPI inflation has owed largely to food prices and\n\nadministered prices, including water bills and Vehicle Excise Duty.”\n\nHe added that food inflation had added around 0.4 percentage points to the level of inflation in August, as global food prices climbed.\n\nFigures from the Office for National Statistics released on Wednesday showed that inflation remained at 3.8pc in August, the same level as in July and a 19 month high.\n\nRachel Reeves’s decision to increase employers’ National Insurance Contributions and increase the minimum wage in last year’s autumn Budget has also been blamed for pushing up inflation. Businesses said they had been left with no choice but to pass on the extra costs to consumers.\n\nIn his letter to the Chancellor, Mr Bailey explained the tax rise had postponed a decline in labour cost growth.\n\nHe wrote: “A reduction in total labour cost growth also appears to have been delayed by the increase in employer National Insurance Contributions (NICs) and pay growth in sectors with a large share of employees at or close to the National Living Wage (NLW).”\n\nReeves looking at measures to lower inflation ahead of the autumn Budget\n\nIn a letter to Bank of England Governor, Andrew Bailey, Rachel Reeves said government officials were examining measures to lower inflation ahead of the upcoming autumn Budget.\n\nMs Reeves wrote: “The Prime Minister and I recognise that we must do everything in our powers to keep costs down and lower them, and we have asked Cabinet to work with their officials to look at what further action can be taken ahead of the Budget in November.\n\n“Low and stable inflation is essential for long-term economic growth and sustained increases in living standards.”\n\nIt comes as official figures released on Wednesday showed that inflation remained at 3.8pc in August. Bank of England forecast expect inflation to rise to 4pc in September.\n\nThe Governor of the Bank of England and the Chancellor are required to send a letter to each other when the inflation is 1pc above or below the 2pc target.\n\nBank rate to remain at 4pc for the rest of the year, Oxford Economics says\n\nBank of England policymakers are likely to cut rates slowly at it heads towards a neutral policy rate, according to Oxford Economics.\n\nAndrew Goodwin, chief UK economist at Oxford Economics, said the minutes from today’s meeting show that most members of the Monetary Policy Committee (MPC) “are more worried about cutting too quickly than too slowly”.\n\nMr Goodwin added that he expects the MPC to hold the bank rate at 4pc for the rest of the year, with the next rate cut to take place in 2026.\n\nHe said: “By then, the MPC will likely have to factor in the prospect of tighter fiscal policy. We expect growth to miss the BoE’s forecasts.\n\n“And we think there will be better news on wages and inflation, with it becoming apparent to the MPC that the increase in NICs has played a bigger role in this year’s stickiness in services inflation.”\n\nOxford Economics expects the Bank to make just two rate cuts in 2026, brining the bank rate to 3.5pc by the end of next year.\n\nThe timing of future interest rate cuts ‘looks less clear’\n\nEconomists at ING have said that the timing of future cuts looks less clear but still expects two to three more rate cuts from the Bank.\n\nJames Smith, a developed markets economist at ING, said: “given that not much has changed since the August meeting that would have warranted a more major shift in stance today.”\n\nHe explained that recent data on the UK labour market and inflation had largely been in line with projections from the Bank.\n\nMr Smith said: “August’s decision made it abundantly clear that the Bank is growing more reticent to cut rates further from here.”\n\nThe Bank’s policymakers will meet again on November 6 to decide whether to make another rate cut, but the decision “looks 50-50” to economists at ING.\n\nInflation remains a ‘source of discomfort’ for the Bank\n\nThe current level of inflation remains a ‘source of discomfort’ for rate setters at the Bank of England, according to economists at Investec.\n\nOfficial figures released by the Office for National Statistics on Wednesday showed that inflation remained at 3.8pc in August, the same as it was in July.\n\nEllie Henderson, from Investec, said: “There does seem to be greater concern than last month that this [current inflation levels] could feed through into persistently higher inflation expectations.”\n\nShe added the Bank’s job of returning inflation to its 2pc target could be made “more difficult” if current high inflation levels embed themselves into wage setting.\n\nChancellor must show ‘spending restraint’ to limit borrowing costs\n\nRachel Reeves must show “spending restraint” to bring down the cost of government borrowing, a think tank has warned.\n\nThe Institute of Economic Affairs said the Bank of England had taken “sensible” measures to reduce the pace of its quantitative tightening programme as it held interest rates at 4pc.\n\nExecutive director Tom Clougherty said: “It is hard to make a case for a more aggressive loosening of monetary policy while measured inflation remains stubbornly high.\n\n“However, growth in broad money is low, which suggests that price rises are coming from supply-side factors – like taxes and regulatory restrictions that drive up costs.\n\n“That is regrettable, but not something the Bank can or should do much about.\n\n“What we really need now is spending restraint and a much more ambitious pro-growth agenda from the Government.”\n\nReeves urges Bailey to ‘liaise closely’ with debt office over bond sales\n\nRachel Reeves urged the Bank of England to “liaise closely” with UK officials over its plans to sell UK bonds after policymakers voted to scale back the pace of quantitative tightening.\n\nThe Chancellor welcomed the MPC’s decision to scale back the speed at which it is reducing its balance sheet from a pace of £100bn a year to £72bn a year.\n\nHowever, she raised concerns about the potential impact on the bond market in a letter to Governor Andrew Bailey.\n\nShe said: “It is important that the Bank continues to liaise closely with the Debt Management Office to ensure the Bank’s operations do not impact on the government’s wider gilt issuance strategy.”\n\nUK bond yields have edged up today despite the promised slowdown in quantitative tightening – the Bank’s programme of reducing the £895bn UK debt pile it built up between 2009 and 2021 in the wake of the global financial crisis and the pandemic.\n\nIt has been accused of destabilising the bond market by actively selling too many gilts. It sold £13bn of gilts last year and plans to sell another £21bn over the next year.\n\nBank of England ‘in no rush’ says former rate setter\n\nInterest rates will continue to fall but the Bank of England is “in no rush” amid persistent inflation, according to a former policymaker.\n\nMichael Saunders, a member of the Monetary Policy Committee from 2016 to 2022, said the “current elevated level of inflation expectations will keep pay growth relatively high”.\n\nHe warned: “Before cutting again, the MPC will need to see stronger evidence that pay growth is slowing to a target-consistent pace and that slower pay growth will feed through to lower services inflation.\n\n“This points to early 2026 for the next rate cut, rather than before the end of this year.\n\n“The decision to slow QT and scale back sales of long gilts is sensible and reduces risks that – in current stressed gilt market conditions – QT could have adverse side effects by adding significant upward pressure on yields.”\n\nMichael Saunders said the next rate cut would likely come early next year - Heathcliff O'Malley\n\nUS stocks jump after rate cut\n\nWall Street’s main indexes jumped at the open a day after the Federal Reserve delivered a quarter-point interest rate cut.\n\nFed chairman Jerome Powell said that the softening jobs market was a priority for the central bank after it delivered the highly expected cut, indicating more reductions could follow at its October and December meetings.\n\nMeanwhile Intel climbed after Nvidia decided to build a stake in the company.\n\nThe chipmaker jumped 26pc after Nvidia said it will invest $5bn (£3.7bn) in the company, throwing its heft behind the struggling US chip foundry. However, it stopped short of giving it a crucial manufacturing deal.\n\nNvidia was up 2.76pc, bouncing back from Wednesday’s declines when a report said Chinese tech firms might stop buying its chips.\n\nAt the start of trading, the S&P 500 rose 0.4pc to 6,627.16 and the tech-heavy Nasdaq Composite climbed 0.8pc to 22,445.49. The Dow Jones Industrial Average edged down 0.1pc to 45,974.08.\n\nReeves gets no help from Bank of England with nightmare Budget\n\nAndrew Bailey has done little to ease the monumental challenge facing Rachel Reeves in her Budget in November.\n\nThe Chancellor is expected to have to find anywhere between £20bn and £50bn of tax rises and spending cuts to get her financial plans back on track.\n\nLower borrowing costs and more support in the debt markets from the Bank of England could help the Chancellor, as it would reduce the strain of paying interest on the £2.9tn national debt.\n\nUnfortunately for Reeves, the Governor and his eight colleagues on the Monetary Policy Committee (MPC) declined to provide much help in either department on Thursday.\n\nAndrew Bailey has declined to provide help in lowering borrowing costs and providing more support in the debt markets for the Chancellor - Kirsty O'Connor/Treasury\n\nNovember rate decision ‘tricky’ ahead of Budget\n\nThe Bank of England faces a “tricky” decision on interest rates at its next meeting in November before Chancellor Rachel Reeves announces her fiscal plans in the Budget.\n\nAnna Leach, chief economist at the Institute of Directors, said the decision to hold rates at 4pc today was “the right call” amid rising inflation.\n\nShe said: “November’s decision, however, will be a tricky one.\n\n“Business confidence and hiring remain under pressure as we head towards a difficult Budget with a substantial fiscal hole to fill.\n\n“At the same time, firms continue to face acute cost and pricing pressures following the rise in employment costs.\n\n“Given the UK’s recent inflation history, the priority must remain to squeeze out any remaining price pressures.”\n\nReeves’s job ‘made tougher’ by Bank of England\n\nRachel Reeves’s faces an “even greater burden” in trying to balance the public finances after the Bank of England announced its plans for reducing its portfolio of UK government bonds, according to a wealth manager.\n\nRathbones said the muted reaction of the pound and in bond markets suggested “some disappointment that the Bank did not go further” as it reduced its quantitative tightening programme from £100bn a year to £70bn.\n\nHead of market analysis John Wyn-Evans said: “With accumulated debt at elevated levels and annual deficits not shrinking fast enough, the Government has to issue large amounts of gilts and Treasury bills every year to fund its spending as well as the interest payments on existing debt.\n\n“Its task in this respect has been made tougher by having to compete with the Bank of England itself which has been reducing the amount of government debt built up on its own books (through past episodes of quantitative easing), not only by not replacing maturing gilts but also through active sales.\n\n“Combined with global pressure on bonds, which has pushed yields on longer-dated issues up to levels not seen for several decades in the UK, the US and Japan, this places an even greater burden on the Chancellor.\n\n“Today, again as investors had been led to believe, the Bank reduced its planned sales in the year ahead from £100bn to £70bn.\n\n“This is certainly a positive development and relieves some of the supply pressure from the market. Further good news is that the Bank will focus on selling more bonds with shorter maturities and only 20pc of sales will be from longer-duration issues with maturities beyond 2055 (versus around a third previously).”\n\n“Initial market reactions, with bond yields marginally higher and sterling a touch weaker, seem to suggest some disappointment that the Bank did not go further.”\n\nRate cut this year ‘very much on the table’\n\nThe Bank of England has kept its options open about making another rate cut this year, according to Deutsche Bank, after policymakers kept their language around the path ahead unchanged.\n\nChief UK economist Sanjay Raja expects one more reduction in the Bank Rate this year, in December, and two more in 2026.\n\nHe said: “The MPC stuck to its long-held guidance that a ‘gradual and careful approach to the further withdrawal of monetary policy restraint remained appropriate’.\n\n“The MPC also reiterated that monetary policy was not on a pre-set path – and the MPC ‘would remain responsive to the accumulation of evidence’.\n\n“Put simply, a Q4-25 rate cut remains very much on the table with the MPC doing little to shift market expectations one way or another.”\n\nMathieu Savary, a strategist at BCA Research, said a weakening economy would eventually force policymakers to act.\n\nHe said: “The Bank of England continues the deal with a bifurcated picture. Inflation remains too elevated to cut interest rates quickly now, but the weak economy will eventually force its hand.\n\n“Slowing the pace of QT only signals that easing will ultimately prevail.”\n\nBeef, cocoa beans and coffee prices pushing up food inflation, says Bank\n\nHigher prices in Britain and around the world for goods like beef, cocoa beans and coffee have helped drive up food and drink inflation, the Bank of England said.\n\n“Labour costs and costs associated with new packaging regulation had also accounted for some of the increase in food prices,” the MPC wrote in the summary of its rate decision.\n\nSeveral large retailers and industry groups have warned that rising business costs – namely National Insurance contributions, the minimum wage, and new packaging taxes – have put pressure on prices in shops.\n\nThe MPC said the outlook for global trade policy continued to be “highly uncertain” as a result of rising US tariffs.\n\nWhile global growth has so far been steady, this might be partly to do with companies “front-loading” exports, new tariff rates being put on pause, and some goods exports being rerouted, according to the committee.\n\nThe impact of higher tariffs could therefore be “slower, although not necessarily smaller” than the Bank had previously assumed.\n\nTraders boost bets on rate cuts\n\nMoney markets indicated there is a greater chance of the Bank of England cutting interest rates again this year following its decision to scale back the pace of quantitative tightening.\n\nTraders are betting there is a 37pc probability of another reduction in borrowing costs before the end of the year, compared to less than 30pc before the latest announcement by the Monetary Policy Committee.\n\nUK bonds were outperforming European peers, with the yield on 10-year UK gilts flat at 4.62pc, compared to rises of around one basis points in the likes of France and Germany.\n\nYields indicate the return the government must pay to buyers of its debt.\n\nFTSE 100 higher despite Bank inflation fears\n\nThe FTSE 100 rose even as economists warned that inflation worries would prevent the Bank of England making more rate cuts this year.\n\nThe UK’s blue-chip index climbed 0.3pc after a brief drop in the run-up to the decision, while the mid-cap FTSE 250 gained 0.4pc.\n\nPaul Dales of Capital Economics said: “The key point is that the Monetary Policy Committee’s worries that the recent rise in inflation could feed into wages and the price-setting process haven’t diminished.\n\n“Some elements of the policy statement could be interpreted to suggest the MPC has become a little more concerned, but this change feels marginal.”\n\nHowever, he added that he still thinks a bigger fall in inflation next year than most expect “will prompt the Bank to resume cutting interest rates in February and to reduce them to 3pc by the end of the year”.\n\nInvestors expect rates to fall to only 3.5pc.\n\nDoubtful rate cuts will resume near year, warns Schroders\n\nIt is “doubtful” that the Bank of England will resume interest rate cuts next year, a FTSE 100 asset manager has warned.\n\nGeorge Brown, senior economist at Schroders, said: “With inflation heading in the wrong direction, there was no question that the Bank would be on hold today. But while markets are betting on rate cuts resuming next year, we remain doubtful this will materialise.\n\n“In our view, the balance of risks is drifting towards renewed tightening given persistent domestic inflationary pressures. We continue to expect rates to remain on hold this year and next, but we can’t rule out the possibility that the Bank’s next move will be up, rather than down.\n\n“A slowdown in quantitative tightening from £100 billion was clearly flagged, the only question would be to what extent. The Bank’s announcement that it will allow £70 billion of gilts to roll off its balance sheet was broadly in line with our expectations, albeit meaning that active gilt sales will have to step up to £21bn.”\n\nPound flat as rates kept on hold\n\nThe value of the pound was little changed following the widely expected decision by the Bank of England to keep interest rates on hold.\n\nSterling was flat against the dollar at $1.363 and was down 0.1pc versus the euro at €1.152.\n\nBank should have abandoned bond sales, says think tank\n\nThe Bank of England should have completely stopped actively selling gilts to ease pressure on government borrowing costs, a think tank has warned.\n\nCarsten Jung, associate director for economic policy at IPPR and former Bank of England economist, said: “The Bank was right to slow the unwinding of its economic support programme – quantitative tightening.\n\n“It has added unnecessary pressure on gilt yields at a time of global pressures. The Bank should have in fact gone further and fully stopped active gilt sales, as these are not needed for its monetary policy strategy.\n\n“Meanwhile, the expected inflation bump over the summer is projected to ease and the Bank of England should more strongly signal how it intends to lower rates over the coming months, given a range of factors pointing to weaker demand.”\n\nFear of fresh tax raid hurting the economy, says Bank\n\nBusinesses are already worried about the potential impact of further tax rises, according to a Bank of England survey.\n\nIts latest poll described “consumer caution” as a “key theme”, with “some now worrying about potential impacts on confidence from the upcoming Autumn Budget”.\n\nBosses also warned that Rachel Reeves’s inheritance tax raid on farmers and entrepreneurs in the Budget last Autumn was having a chilling effect on the economy.\n\n“Family and individually owned private businesses are concerned about changes in inheritance tax laws making them less willing to invest”.\n\nRate setters ‘focused on squeezing out’ inflation pressure\n\nPolicymakers held rates steady as they remain “focused on squeezing out any existing or emerging persistent inflationary pressures”.\n\nThe MPC pointed to inflation hitting 3.8pc in August, which they expect to “increase slightly in September, before falling towards the 2pc target thereafter”.\n\nThe committee “remains alert to the risk that this temporary increase in inflation could put additional upward pressure on the wage and price-setting process”.\n\nIn their latest report, rate setters said: “There has been substantial disinflation over the past two and a half years, following previous external shocks, supported by the restrictive stance of monetary policy.\n\n“That progress has allowed for reductions in Bank Rate over the past year. The Committee remains focused on squeezing out any existing or emerging persistent inflationary pressures, to return inflation sustainably to its 2pc target in the medium term.\n\n“Underlying disinflation has generally continued, although with greater progress in easing wage pressures than prices.”\n\nBank to slow quantitative tightening in boost for Reeves\n\nThe Bank of England said it would slow down the reduction of its UK government bond portfolio in a potential boost for the Chancellor.\n\nThe Bank said it would lower its stock of UK government bond purchases by £70bn over the next year, taking its total to £488bn.\n\nThis represents a slowdown from its previous pace of £100bn a year. The reduction follows concerns that the Bank was pushing up borrowing costs by smothering the bond market with UK debt.\n\nGovernor Andrew Bailey said: “Today we reduced the size of our annual QT target from £100bn to £70bn.\n\n“The new target means the MPC can continue to reduce the size of the Bank’s balance sheet in line with its monetary policy objectives while continuing to minimise the impact on gilt market conditions.”\n\nBailey: Rates must be cut ‘gradually and carefully’\n\nThe Governor of the Bank of England has said interest rates must be cut “gradually and carefully” after voting to hold borrowing costs at 4pc.\n\nMembers of the Monetary Policy Committee were split 7-2 on the decision, with Swati Dhingra and Alan Taylor backing a quarter of a percentage point reduction.\n\nAndrew Bailey said: “We held interest rates at 4pc today. Although we expect inflation to return to our 2pc target, we’re not out of the woods yet so any future cuts will need to be made gradually and carefully.”\n\nBank of England holds rates at 4pc\n\nInterest rates have been left unchanged by the Bank of England at 4pc amid persistent inflation and wage rises.\n\nMarket gives 0pc chance of rate cut\n\nTraders are officially pricing in a zero per cent chance that the Bank of England will cut interest rates at noon.\n\nThere is a 29pc chance of there being one more cut over the remaining two meetings this year.\n\nReeves awaits Bank decision on bond sales\n\nThe pace of the Bank of England’s quantitative tightening programme matters because it influences how much money Chancellor Rachel Reeves will have to keep the public finances in balance.\n\nA slowdown in how fast the Bank reduces its balance sheet could help lower yields on bond markets – the return that issuers of debt, like the Treasury, must pay to buyers.\n\nHowever, it could also increase the costs faced by the Chancellor in terms of the coupon payments the British taxpayer must pay to the Bank of England for holding Treasury debt. It is all a balancing act.\n\nUltimately, Ms Reeves wants to address the deficit, as bringing it down will lower the amount the government borrows, and thus the amount it spends on servicing the national debt.\n\nThis has significant implications for Britain’s economic growth.\n\nJoachim Klement, an analyst at Panmure Gordon, said: “It remains a well-established fact that countries with higher debt loads see a decline in GDP growth.\n\n“One driver of this slowdown is that debt costs rise, and governments must spend more on debt servicing while reducing spending on other areas that could boost growth.\n\n“Another is that the increasing long-term government bond yields also increase the cost of debt for businesses.”\n\nBorrowing costs ease ahead of fresh quantitative tightening plan\n\nGovernment borrowing costs have edged lower ahead of an announcement by the Bank of England on the pace of its quantitative tightening programme.\n\nThe yield on two-year, 10-year and 30-year gilts nudged downwards in morning trading despite rises across other European markets.\n\nYields – the returns the government promises to buyers of its debt – slipped ahead of an expected reduction in the speed at which the Bank of England will sell off its holdings of UK debt.\n\nThe Bank carried out an £895bn bond-buying campaign between 2009 and 2021 to prop up the British economy in the wake of the global financial crisis and the pandemic.\n\nIt has since begun reducing its balance sheet by either selling those bonds at a loss or allowing them to mature, at a rate of £100bn a year.\n\nHowever, many analysts expect the Bank to slow down this pace amid concerns it is causing volatility in bond markets, which in turn pushes up the cost of government borrowing.\n\nTaiwan holds interest rates at 2pc\n\nIn a big week for central bank rate decisions, Taiwan’s CBC left its borrowing costs unchanged amid “rapid economic growth and low inflation”.\n\nTaiwan’s central bank kept interest rates at 2pc after its economy expanded by 3.1pc in the second quarter amid booming exports related to demand surrounding AI.\n\nJason Tuvey of Capital Economics said: “ Growth is likely to remain solid over the next few quarters.\n\n“Even if export growth slows from its current rapid rates, domestic demand is likely to pick up, supported by accelerating real wage growth and buoyant investment.”\n\nHe added: “All told, we expect the CBC to leave interest rates on hold at 2pc for the foreseeable future whereas the consensus is for some modest monetary easing over the next couple of years.”\n\nLabour is strangling the economy, warns Next boss\n\nLabour’s policies are strangling the UK economy and risk fuelling years of “anaemic growth”, the boss of high street giant Next has warned.\n\nLord Wolfson, the retailer’s chief executive, warned that the future of the UK economy “does not look favourable” because of new red tape and unsustainable government spending.\n\nHe said: “At best we expect anaemic growth, with progress constrained by four factors – declining job opportunities, new regulation that erodes competitiveness, government spending commitments that are beyond its means, and a rising tax burden that undermines national productivity.”\n\nLord Wolfson, Next’s chief executive, has issued a warning over the future of the UK economy - Chris Ratcliffe/Bloomberg\n\nPound edges higher ahead of rate decision\n\nThe value of the pound has edged higher amid expectations from traders that interest rates will be kept on hold.\n\nSterling was up 0.1pc versus the dollar to $1.364 as money markets suggested a near zero chance of a reduction in UK borrowing costs later.\n\nIt comes a day after the US Federal Reserve announced its first interest rate cut of the year.\n\nThe pound was down 0.1pc versus the euro at €1.153.\n\nNorway cuts interest rates to 4pc\n\nNorway’s central bank has announced that it has cut interest rates today but policymakers warned of the threat of higher inflation.\n\nNorges Bank reduced borrowing costs by a quarter of a percentage point to 4pc despite warning that economic growth has been stronger than anticipated while inflation is likely to be higher than previously expected.\n\nJack Allen-Reynolds of Capital Economics said: “With the economy growing at a decent pace and underlying price pressures stubbornly high, the case for additional interest rate cuts does not look particularly strong.”\n\nTraders fear next rate cut could come as late as April\n\nMoney markets indicate the next interest rate cut from the Bank of England could come as late as April next year.\n\nInterest rates were cut from 4.25pc to 4pc in August, releasing some pressure for borrowers and mortgage holders.\n\nBut economists believe the MPC may avoid cutting rates at meetings in November and December. Traders are betting there is more than 70pc chance that rates will be left unchanged.\n\nSandra Horsfield, an economist for Investec, said August’s inflation data “revealed price rises being stuck at uncomfortably high rates” with the overall consumer prices index rate “considerably above” the Bank’s 2pc target level.\n\n“The likelihood of a rate cut this week seemed in any case remote; but beyond that too, we judge that it will take evidence of falling inflation to persuade a majority on the MPC that further rate cuts are appropriate,” she said.\n\n“Therefore, we expect the MPC to sit out the November and December meetings too and only resume rate cuts early next year.”\n\nBank of England to be ‘cautious’ amid high inflation\n\nThe Bank of England will be “cautious” about interest rate cuts after inflation climbed to 3.8pc in August, economists have said.\n\nMonica George Michail, associate economist for the National Institute of Economic and Social Research (Niesr), said: “Given price pressures from higher labour costs, elevated inflation expectations, and upside risks from food prices, we think the MPC will keep interest rates on hold this Thursday.\n\n“While a faster pace of rate cuts would support economic growth and lower the Government’s borrowing costs, the Bank will likely remain cautious in the next few months as it focuses on keeping inflation under control.”\n\nGood morning\n\nThanks for joining me with our coverage of the Bank of England’s next interest rate decision.\n\nPolicymakers are expected to keep rates on hold but Chancellor Rachel Reees will also be closing watching their plans for quantitative tightening, which could impact the cost of government borrowing.\n\nWe will have all the latest here throughout the day. Here is what you need to know.\n\n5 things to start your day\n\nWhat’s happened so far\n\nUK stocks were mixed at the start of trading ahead of the Bank of England’s interest rate decision.\n\nThe benchmark FTSE 100 was up 0.2pc to 9,222.95 in early trading after the US Federal Reserve cut interest rates for the first time this year on Wednesday.\n\nHowever, the domestically-focused FTSE 250 slipped 0.1pc to 21,605.99 as markets pinned little hope on a boost from thee Bank of England.\n\nEuropean shares jumped higher in the wake of the Fed decision, with the Cac 40 in Paris up 0.7pc and the Dax in Frankfurt climbing 1.2pc. Asian shares were mixed.\n\nStocks in the US closed near their record highs after the Federal Reserve cut interest rates by 25 basis points to 4.25pc, in a move that was no surprise to Wall Street.\n\nHowever, Fed officials indicated they expect to make two further cuts by the end of the year and one cut in 2026. It marks a change from market forecasts which had anticipated that the Fed would be making the first of five cuts.\n\nThe major indices on Wall Street flowed between gains and losses. The S&P 500 slipped 0.1pc to 6,600.35. The Dow Jones Industrial Average rose 260 points, or 0.6pc to 46,018.32, while the Nasdaq composite fell 0.3pc to 22,261.33.\n\nThe US dollar index, which measures the greenback against a basket of currencies, rose 0.4pc. US 10-year government borrowing costs rose six basis points during the day to 4.08pc.",
    "url": "https://uk.finance.yahoo.com/news/bank-england-raises-alarm-over-171911421.html",
    "source": "newsapi",
    "author": "Min Read",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "bank",
      "inflation",
      "said",
      "rate",
      "year",
      "england",
      "rates",
      "interest",
      "costs",
      "growth"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:36.725349+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "6d8a2da0997ea52a6da3058ab5a2118e",
    "title": "This housing data is the ‘most critical economic variable’ for predicting recessions, and it’s now at the lowest level since pandemic shutdowns",
    "content": "The housing market is long been seen as an early warning sign for recessions, and one data point in particular has caught the attention of Moody’s Analytics chief economist Mark Zandi.\n\nIn social media posts on Sunday, he noted that Moody’s own leading economic indicator that uses machine learning has estimated the odds of a recession in the next 12 months are now at 48%.\n\nEven though it’s less than 50%, Zandi pointed out that the probability has never been that high previously without the economy eventually slipping into a downturn.\n\nA crucial component in the Moody’s indicator comes from the housing market.\n\n“The algorithm has identified building permits as the most critical economic variable for predicting recessions. And while permits had been holding up reasonably well, as builders supported sales through interest rate buydowns and other incentives, inventories of unsold homes are now high and on the rise,” Zandi warned.\n\n“In response, builders are pulling back, and permits have started to slump. They are now as low as they’ve been since the pandemic shutdowns.”\n\nLast month, the Census Bureau reported that residential building permits in July were at a seasonally adjusted annual rate of 1.35 million, down 2.8% from the prior month and down 5.7% from a year ago.\n\nIn July, Zandi singled out the housing market for concern, escalating it to a “red flare” as home sales, homebuilding, and house prices were getting squeezed by elevated mortgage rates.\n\nWhile the 30-year fixed rate has since come down from near 7% to about 6.3%, it’s not clear yet if that’s low enough to revive builders or how much it will continue to drop. On Sunday, Zandi said all eyes should be on August permit data, which will come out on Wednesday.\n\n\n\n“They are sure to provide another reason why the Fed should and will announce a rate cut later that day,” he predicted.\n\nIn fact, Federal Reserve policymakers have already started worrying about the housing market. Minutes from the central bank’s July meeting revealed concerns about weak housing demand, rising supply, and falling home prices.\n\nAnd not only did housing show up on the Fed’s radar, officials flagged it as a potential risk to jobs, along with artificial intelligence technology.\n\n“In addition to tariff-induced risks, potential downside risks to employment mentioned by participants included a possible tightening of financial conditions due to a rise in risk premiums, a more substantial deterioration in the housing market, and the risk that the increased use of AI in the workplace may lower employment,” the minutes said.",
    "url": "https://finance.yahoo.com/news/housing-data-most-critical-economic-190933391.html",
    "source": "newsapi",
    "author": "September, Min Read",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "housing",
      "market",
      "zandi",
      "been",
      "permits",
      "rate",
      "moodys",
      "builders",
      "july",
      "down"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:39.818591+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "e5e2d87bac8fdc190bcb744e4f8a09df",
    "title": "Would a government shutdown hurt the economy? Experts explain",
    "content": "The federal government is hurtling toward a possible shutdown at a delicate moment for the nation's economy, as a hiring slowdown stokes recession fears and inflation proves difficult to fully contain.\n\nFederal Reserve Chair Jerome Powell last week said policymakers face a \"challenging situation\" while they attempt to navigate the economy through a \"turbulent period.\"\n\nA government shutdown typically risks only modest damage for the U.S. economy, stemming mainly from furloughed public workers, who temporarily lose out on pay and put a dent in U.S. consumer spending, analysts told ABC News.\n\nThe impact of a shutdown could be more significant this time around, however, since the wobbly economy may strain under the weight of a potentially prolonged interruption, while a halt in the release of key economic data could make it more difficult for policymakers to steer the economy, they added.\n\n\"In stable times, this is not a particularly big deal,\" Marc Goldwin, senior vice president and senior policy director at the Committee for a Responsible Federal Budget, told ABC News. \"It's probably a little bit of a bigger deal now.\"\n\nTop congressional leaders met with President Donald Trump at the White House on Monday afternoon in a last-ditch effort to avert a government shutdown -- but as a stalemate persists just one day from the deadline, a shutdown seems nearly inevitable barring an unexpected breakthrough.\n\nLawmakers from both sides of the aisle are digging in ahead of the Tuesday night deadline.\n\nEach week of a potential government shutdown would reduce annualized real gross domestic product growth in the quarter by about 0.1%, Mark Zandi, chief economist at Moody's Analytics, told ABC News in a statement.\n\nFor reference, the economy grew by an average annualized rate of 1.8% over the first half of 2025, meaning it would take several weeks of a government shutdown for notable damage to be incurred.\n\nTypically, lawmakers resolve government shutdowns quickly. Since 1977, the U.S. government has failed to meet a funding deadline on 20 separate occasions, posting an average shutdown length of 8 days, the Bank of America Institute, or BAI, said in a memo on Monday. However, the most recent shutdown – which took hold in 2018, during Trump's first term – lasted far longer than average, clocking in at 35 days.\n\nMany federal employees deemed non-essential would be furloughed without pay during a shutdown, and some government contractors could temporarily lose business. In recent shutdowns, the total number of furloughed workers amounted to about 800,000 people, though it would likely be smaller this time around due to government cuts, the BAI said.\n\nSpeaker of the House Mike Johnson, R-La., joined at right by Majority Whip Tom Emmer, R-Minn., talks to reporters at the Capitol in Washington, D.C., on Sept. 16, 2025. J. Scott Applewhite/AP\n\nThe Trump administration has threatened to fire some federal workers in the event of a shutdown, which could heighten the economic impact, some experts said. The economy usually recovers a large share of lost output after a government shutdown, once furloughed workers receive back pay, but such a resurgence would not occur if those workers were to be fired.\n\nEssential services like defense and law enforcement would continue throughout a shutdown, as would mandatory spending programs like Social Security and Medicare, BAI added.\n\n\"If it's a long shutdown, it almost certainly will be quite negative,\" Gerald Epstein, a professor of economics at the University of Massachusetts, Amherst, told ABC News.\n\nIn addition to some lost economic activity, a government shutdown risks a decline in consumer sentiment, experts said. Consumer sentiment fell more than 7 points from December 2018 to January 2019, coinciding with the most recent government shutdown, according to a Committee for Responsible Federal Budget analysis of University of Michigan survey data. A souring of consumer sentiment, albeit modest, occurred over each of the three most recent shutdowns that preceded 2018.\n\n\"Consumer sentiment is usually a pretty big predictor of consumption, and consumption accounts for about 70% of spending in our economy,\" Epstein said. \"If the economy is fragile, then any given force will have more impact.\"\n\nConsumer Sentiment has Soured During Recent Government Shutdowns University of Michigan Index of Consumer Sentiment\n\nTo be sure, experts said the effects of a government shutdown could still prove minimal, especially if the shutdown were to be resolved in a matter of days.\n\nFor its part, the stock market has defied financial fears during recent government shutdowns. The S & P 500 moved upward during each of the last four shutdowns, including the 2018 shutdown, during which the S & P 500 rose more than 10%, Brian Gardner, chief Washington strategist at wealth management firm Stifel, told ABC News in a statement.\n\nAs policymakers steer the economy through the twin threats of a cooling labor market and rising inflation, they may lose out on some key economic data to be provided by the federal government.\n\nOn Monday, the U.S. Department of Labor said some data would not be released in the event of a shutdown, including the highly anticipated monthly jobs report set to come out on Friday.\n\nThe Fed, which opted to cut interest rates earlier this month, is guided by a dual mandate to keep inflation under control and maximize employment. Powell said a sharp cooldown of hiring over the summer had shifted the balance of risks toward greater concern over the labor market rather than inflation.\n\nStill, Powell voiced concern about the trajectory for prices, saying, \"uncertainty around the path of inflation remains high.\"\n\nIn the event of a shutdown, central bankers will still avail themselves of private sector data sources, but a loss of some federal data would make their task more difficult, Goldwin said.\n\n\"They're walking a tight rope to figure out whether and how to cut interest rates,\" Goldwin added. \"They need the best data to do that. When you're on a tight rope and you have a little bit of a blurry vision in the corner of your eye, it's not good.\"\n\nABC News' John Parkinson and Lauren Peller contributed to this report.",
    "url": "https://abcnews.go.com/Business/government-shutdown-hurt-economy-experts-explain/story?id=126038221",
    "source": "newsapi",
    "author": "Abc News",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "shutdown",
      "government",
      "economy",
      "said",
      "would",
      "federal",
      "consumer",
      "data",
      "some",
      "news"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:42.577952+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "9dd04395226680752d9e9e45b5b8d7dd",
    "title": "A finance veteran says junior bankers aren't doomed — they're actually supercharged by AI",
    "content": "Sopnendu Mohanty, who spent nearly two decades at Citi, told Business Insider that using AI will benefit both banks and their junior hires.\n\nSopnendu Mohanty, who spent nearly two decades at Citi, told Business Insider that using AI will benefit both banks and their junior hires. GFTN\n\nSopnendu Mohanty, who spent nearly two decades at Citi, told Business Insider that using AI will benefit both banks and their junior hires. GFTN\n\nlighning bolt icon An icon in the shape of a lightning bolt.\n\nlighning bolt icon An icon in the shape of a lightning bolt. Impact Link\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nJunior bankers should not worry that their jobs are on the line because of AI, says Sopnendu Mohanty, the CEO of Global Finance & Technology Network, an advisory and investment firm.\n\nMohanty, 53, spent nearly two decades working at Citi, where he helped lead the bank's global consumer lab network and programs. In 2015, he became the Singapore central bank's first chief fintech officer.\n\nHe said AI, like the internet and smartphone, will help make bankers more productive. With AI, a single banker would be able to engage more clients, Mohanty told Business Insider.\n\n\"When I joined banking in 1997, my ability to reach out to customers was limited. Smartphones and call centers — all those came later,\" he added.\n\nUsing AI will be a win-win situation for the banks and their junior hires, Mohanty said.\n\n\"Your productivity goes up, you are engaging more customers, you will enjoy better customer loyalty in the process,\" he added.\n\nMohanty isn't the only finance executive who said AI will help, rather than hurt, the careers of junior bankers.\n\nKerry Blum, a partner at Goldman Sachs, said in an interview with the Financial Times published earlier this month that AI will \"really improve the quality of the work that our junior people are doing.\"\n\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know\n\n\"They're going to get to do high-impact work while they're learning from the AI assistant or while the AI assistant is doing other things to help them,\" Blum, the global head of the equity-structuring group within private wealth management at Goldman Sachs, said.\n\n\"I know if I was an intern or an analyst, I would be a top user of the assistant tool right now,\" she added.\n\nThe rise of AI has fueled concerns that it could disrupt the job market by eliminating jobs. In May, Anthropic CEO Dario Amodei said in an interview with Axios that AI could wipe out 50% of entry-level office jobs in the next five years.\n\nJeremy Barnum, the chief financial officer of JPMorgan Chase, told investors at the company's annual presentation in May that AI would make the bank more efficient.\n\nBarnum said his colleagues shared that they found AI to be useful, and it has helped them \"quite a bit too with their efficiency.\"\n\n\"It's not just the amateurs who are helped by these tools. It's amazing stuff, and we have high hopes for the efficiency gain,\" he added.",
    "url": "https://www.businessinsider.com/finance-veteran-ai-will-not-doom-junior-bankers-2025-9",
    "source": "newsapi",
    "author": "Kwan Wei Kevin Tan, Enter Your Email, Follow Authors, Never Miss A Story",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "mohanty",
      "insider",
      "business",
      "junior",
      "said",
      "banks",
      "their",
      "told",
      "sopnendu",
      "spent"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:43.995636+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "2864f41b90731c474c33ca3f601ad488",
    "title": "Bitcoin At $113,000 Waiting For 'Final Rotation' As Analyst Forecasts One Last Dominance Push",
    "content": "Bitcoin (CRYPTO: BTC) is hovering around $113,000 as analysts expect the crypto king to stage a dominance rebound in the upcoming month.\n\nWhat Happened: Crypto analyst Benjamin Cowen expects Bitcoin dominance to surge in October, marking the start of a \"final rotation\" back into BTC ahead of the next altcoin rally.\n\nHe says the September low around 57.17% has already formed, following patterns seen in 2017 and 2020.\n\nCurrent dominance near 58% sets the stage for a potential rise toward 63%–64%, or at minimum a return to the 20-week moving average.\n\nCowen outlined three scenarios, all supporting higher dominance:\n\nA dip below the 20-week SMA would strengthen BTC's dominance. Consolidation near current support favors Bitcoin over altcoins. A rally toward all-time highs would similarly lift dominance, consistent with historical market cycles\n\nAlso Read: Bitcoin Underperforms Ethereum By 60% In Q3: Which Coin WIll Perform Better In Q4?\n\nWhy It Matters: October has historically been exceptional for Bitcoin dominance.\n\nCowen notes that monthly returns for dominance average +4.8%, highlighting October as the best month for gains.\n\nHe cautioned against expecting an immediate altcoin surge, pointing to low social interest and repeated altcoin trend rejections as structural hurdles.\n\nHe set clear invalidation levels: dominance falling below 55%–56% would challenge his outlook.\n\nOverall, Cowen remains bullish for the next five weeks, positioning October as a BTC-led phase before altcoins resume their momentum later in the bull market cycle.\n\nRead Next:\n\nImage: Shutterstock\n\nUNLOCKED: 5 NEW TRADES EVERY WEEK. Click now to get top trade ideas daily, plus unlimited access to cutting-edge tools and strategies to gain an edge in the markets.\n\nGet the latest stock analysis from Benzinga?\n\nThis article Bitcoin At $113,000 Waiting For 'Final Rotation' As Analyst Forecasts One Last Dominance Push originally appeared on Benzinga.com\n\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.",
    "url": "https://finance.yahoo.com/news/bitcoin-113-000-waiting-final-153729531.html",
    "source": "newsapi",
    "author": "Tue, September, At Pm Gmt, Min Read",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "dominance",
      "bitcoin",
      "cowen",
      "october",
      "crypto",
      "next",
      "altcoin",
      "week",
      "would",
      "around"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:45.612513+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "561c73ecf0eab288b270008a48693e4b",
    "title": "$3.38 Billion in Bitcoin Options Expiry Raises Concerns of September Volatility",
    "content": "Key Notes\n\nBitcoin’s implied volatility rebounded to 40%, with nearly 30% of options volume concentrated in puts.\n\nDespite the cautious sentiment, BTC price is showing an upside move, eyeing a breakout past $113,000 levels for a sustained rally.\n\nAnalysts highlighted September’s weak historical track record for crypto, citing institutional rollovers and subdued capital inflows.\n\nWith $3.38 billion of Bitcoin BTC $122 390 24h volatility: 1.5% Market cap: $2.44 T Vol. 24h: $72.11 B options expiry on Sept. 5, BTC price is showing some strength with 1.77% upside. Now it has increased to $112,500 levels. Analysts are expecting September to be a month of subdued volatility and weaker performance, according to the historical trends.\n\nBTC Price Jumps amid $3.38 Billion in Bitcoin Options Expiry\n\nBitcoin (BTC) leads this cycle of expiring options, with a notional value of $3.38 billion. Data from Deribit shows total open interest at 30,447 contracts.\n\nThe max pain level, where the most options are likely to expire worthless, sits at $112,000. Meanwhile, the put-call ratio is 1.41, indicating a bearish tilt and a cautious market sentiment.\n\n$3.38 billion in Bitcoin options expire on Sept. 5| Source: Deribit\n\nAmid this options expiry, implied volatility (IV) across Bitcoin maturities has rebounded to around 40% following a month-long correction that drove BTC price more than 10% below its all-time high.\n\nAnalysts note that traders remain cautious, as shown by a surge in block trading of put options, which make up nearly 30% of today’s total options volume.\n\nBitcoin price has gained 1.7% in the last 24 hours, soaring past $112,500 levels as of press time. Crypto analyst Rekt Capital said Bitcoin has now fully confirmed its breakout. He noted that a daily close or successful retest of the ~$113,000 level would further validate the move and support continued upside momentum.\n\n#BTC Bitcoin has technically fully confirmed its breakout A Daily Close and/or retest of the ~$113k region (red) would ensure additional trend continuation to the upside$BTC #Crypto #Bitcoin https://t.co/5YkzaHtB6v pic.twitter.com/vf9Mt8uHrB — Rekt Capital (@rektcapital) September 5, 2025\n\nSeptember Uncertainty Remains on Radar\n\nMarket sentiment is turning cautious, with Greeks.live noting that September has historically been a weak month for cryptocurrencies. Institutional rollovers and quarterly settlements often weigh on capital inflows, they said.\n\n“The options market, in general, lacks confidence in September’s performance,” the analysts observed. With the broader downtrend and crypto equity correction, investors and traders prefer to stay risk-averse at this stage.\n\nBitcoin VDD Signals Easing Long-Term Holder Pressure “If this selling pressure keeps easing, it will certainly provide relief to the market and may allow for a renewed move higher, provided demand steps in.” – By @Darkfost_Coc pic.twitter.com/65zAo2NLp7 — CryptoQuant.com (@cryptoquant_com) September 5, 2025\n\nOn-chain analytics firm CryptoQuant reported that Bitcoin’s Value Days Destroyed (VDD) metric indicates easing selling pressure from long-term holders. The firm noted that if this trend continues, it could provide relief to the market and open the door for a renewed upward move. However, this needs to be backed by a strong demand surge.\n\nDisclaimer: Coinspeaker is committed to providing unbiased and transparent reporting. This article aims to deliver accurate and timely information but should not be taken as financial or investment advice. Since market conditions can change rapidly, we encourage you to verify information on your own and consult with a professional before making any decisions based on this content.",
    "url": "https://www.coinspeaker.com/3-8-billion-in-bitcoin-options-expiry-raises-concerns-of-september-volatility/",
    "source": "newsapi",
    "author": "Bhushan Akolkar, Parth Dubey, Zoran Spirkovski",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "options",
      "bitcoin",
      "market",
      "price",
      "september",
      "volatility",
      "cautious",
      "move",
      "analysts",
      "crypto"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:47.842594+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": "2025-09-05T10:46:04+00:00"
  },
  {
    "id": "6cbe6f3faba4991f6ec2d76c248837c7",
    "title": "Why a near-fistfight at a MAGA nightspot spells danger for the global economy",
    "content": "Donald Trump Tariffs See all topics Follow\n\nIt gives new meaning to the term economic meltdown.\n\nReports that fists almost flew between two members of President Donald Trump’s crack finance team are hardly reassuring with the economy perched on the precipice of a jobs slump and a possible deeper slowdown.\n\nBut the story that Treasury Secretary Scott Bessent threatened to punch Federal Housing Finance Agency chief Bill Pulte in the face at an exclusive MAGA club last week is a sensational morsel of Beltway gossip.\n\nThe spur for the near-fisticuffs was Bessent’s belief that Pulte had bad-mouthed him to the big boss, two sources familiar with the evening told CNN. The White House declined to comment. CNN has reached out to the offices of the alleged potential pugilists.\n\nBessent’s combativeness — he allegedly told Pulte he wanted to “take the matter outside” — might draw quips about the first Treasury Secretary Alexander Hamilton and the most notorious duel in American history.\n\nBut it offers two worrying insights into tensions inside Trump’s brain trust at a pivotal moment.\n\nFirst, the supposed showdown, first reported by Politico, lifts the lid on Trump’s nest-of-vipers political operation. Trump’s second administration has lagged the vicious infighting of his first, since he’s jettisoned anyone who saw themselves as an “adult in the room.” But the Bessent-Pulte bureaucratic cage match shows that Trump’s eight cacophonous months back in power are taking a toll.\n\nThe true currency of Trump world\n\nMost presidents would recoil in horror at reports of senior aides on the verge of a brawl. Former President Barack Obama used to talk of his Lincoln-style team of rivals. But it’s hard to imagine his cerebral Treasury Secretary Timothy Geithner throwing down the gauntlet to a Cabinet colleague during the Great Recession in 2009.\n\nTrump, being Trump, might welcome the friction, seeing in it a chance to play his warring lieutenants against one another to his advantage.\n\nBut there’s a graver reason why a cocktail hour brouhaha in Georgetown will send alarm bells around the world.\n\nThe alleged shouting match reveals there’s only one currency in MAGA world: uber loyalty to Trump. Bessent was apparently furious because he thought his colleague had been talking about him with Trump behind his back. The Treasury secretary has emerged as an impressive inside player in the bruising Washington game and knows that his capacity to do his job — calming the markets, shaping the president’s wildest instincts and stabilizing the global economy — requires Trump’s absolute confidence. Once Trump turns against someone, it’s a tough road back. If Bessent starts to sense he’s on the outs, investors might panic.\n\nPresident Donald Trump holds a cabinet meeting at the White House in Washington, DC, on August 26. Aaron Schwartz/CNP/Bloomberg/Getty Images\n\nIt’s obvious that the first duty of Trump’s officials is to cater to his self-image of greatness rather than to the public. Hence the fawning North Korea-style genuflections that Trump requires in Cabinet meetings.\n\nBut flattery exacts a price. Trump’s team must tell him what he wants to hear — not what he should hear. Such self-censoring is always dangerous for presidents, who live inside bubbles of deference even in normal times.\n\nIt’s even more hazardous under Trump, since the president is embarked on the riskiest, most unorthodox economic experiment in generations. His tariff wars have ripped up a global trading system that made the US the world’s mightiest economic power. Now, Trump wants to crush another cornerstone of US financial superiority: the independence of the Federal Reserve.\n\nHe’s not just pursuing another long-term obsession — scything interest rates. He could also get his hands on the Fed’s other levers, like regulating banks and bailouts, in a way that could profit him and his rich friends in the event of a major financial shock.\n\nPulte’s clash with Bessent, meanwhile, will only thicken intrigue about his growing behind-the-scenes role. He’s recently emerged as a key player since his agency has been unearthing alleged irregularities on mortgage forms filed by some of the president’s top targets, including Lisa Cook, whom Trump is trying to fire as a Fed governor.\n\nAs Trump’s team spars, Americans are getting really worried about the economy\n\nInternecine feuding may be another distraction from what Americans care about most.\n\nNews of tensions inside Trump’s top team emerged days after a grim jobs report suggested that Trump’s outlandish economic approach is beginning to cause damage. The report, released on Friday, showed the economy added only 22,000 positions last month. The data showed the consumer goods sector is now suffering from rising prices brought on by tariffs, the volatile way they are being imposed and the resulting slowdown in hiring. The employment rates among Black Americans and young people, often harbingers, are worsening fast.\n\nBut Trump’s officials cannot break any of this down in public to avoid angering the president. A month after their boss fired the head of the Bureau of Labor Statistics, his top aides are still claiming that the numbers are off.\n\nOn recent TV talk shows, Bessent warned that August was the “noisiest” month for employment numbers. National Economic Council Director Kevin Hassett warned of “dissonance” in the data. Commerce Secretary Howard Lutnick, chief cheerleader for Trump’s elusive golden age, said on CNBC: “Wait until a year from today. Wow, it will be amazing numbers.”\n\nHere’s hoping they are right. Maybe Trump’s irregular approach will reap dividends with jobs returning home and a manufacturing boom. Perhaps lower interest rates will boost growth. And the US economy has previously made fools of those who’ve bet against its resilience.\n\nJob seekers wait in line to enter a job fair event in Silver Spring, Maryland, on April 16, 2025. Roberto Schmidt/AFP/Getty Images\n\nBut that would require almost everything most people know about the economy to be wrong.\n\nThere was a worrying moment on NBC’s “Meet The Press” on Sunday. Bessent made a claim that was hard to take at face value from such a serious figure. He refused to agree with what almost every credible economist believes — that tariffs are an effective tax on consumers. “No, I don’t,” Bessent said. He also claimed that investment banking behemoth Goldman Sachs, which calculated that most tariffs were being paid by the US consumer, was not a credible source. (Bessent has previously argued the idea of tariff-based inflation is “the dog that didn’t bark.”)\n\nAny other answer would have busted his relationship with Trump and offered new ammunition to alleged adversaries inside the administration like Pulte.\n\nBut voters, a plurality of whom turned to Trump in the 2024 election in the hope that he’d alleviate the high anxiety of punishing prices for groceries and housing, are watching.\n\nWhile Trump is bolstering his appeal to his base by threatening to send troops into Chicago and cranking up the pace of his mass deportation drive, most Americans want him to do something else — fix the economy. A CBS News poll published last week showed that just 36% of voters think the economy is good. Some 64% think prices have been going up in recent weeks and 56% think the economy is getting worse. In a new NBC News survey, Trump’s approval is weakening on vital economic issues. Only 39% approve of his handling of inflation and 41% back his handling of trade and tariffs. He’s down to his most loyal base on the economy and has pushed away independents and more moderate crossover voters who helped send him back to the White House.\n\nCardiff Garcia, the editorial director of the Economic Innovation Group, a bipartisan public policy organization, told CNN’s Audie Cornish on Monday that workers were becoming more pessimistic about the economy and Trump’s tariff strategy.\n\n“They’re most worried about the same things that they actually were worried about during the Biden administration, which is the cost of basic goods and services and the cost of housing. They really wish that the administration and the Congress would focus on that instead,” he said. “Tariffs actually ranked dead last as what workers think that the president should be prioritizing right now.”\n\nThe economy is on a knife’s edge. The data is turning bad. And two top members of the president’s team almost came to blows.\n\nNo wonder the country is worried.",
    "url": "https://www.cnn.com/2025/09/09/politics/bessent-pulte-trump-lutnick-economy-tariffs-analysis",
    "source": "newsapi",
    "author": "Stephen Collinson",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "trumps",
      "trump",
      "economy",
      "about",
      "most",
      "bessent",
      "economic",
      "tariffs",
      "president",
      "team"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:48.991540+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": "2025-09-09T00:00:00"
  },
  {
    "id": "4c8494d40aeef92565958a80516e6390",
    "title": "Undervalued Small Caps With Insider Activity To Explore In September 2025",
    "content": "Alerus Financial, a small company in the U.S., has shown a significant increase in financial performance, with net income rising to US$20.25 million for Q2 2025 from US$6.21 million a year ago. Despite being dropped from several Russell indices by June 2025, insider confidence is evident through share purchases over the past year. The board declared an increased dividend of $0.21 per share on August 27, 2025, reflecting potential for future growth despite recent challenges.\n\nOperations: Alerus Financial's revenue is primarily derived from Banking including Mortgage, Wealth Advisory Services, and Retirement and Benefit Services. The company has experienced fluctuations in net income margin, which was 0.07% at the end of 2023 but increased to 0.15% by mid-2025. Operating expenses have been a significant component of their cost structure, with General & Administrative Expenses consistently being the largest expense category over several periods.\n\nOverview: Alerus Financial operates as a diversified financial services company, providing banking, wealth advisory, retirement and benefit services with a market capitalization of $0.53 billion.\n\nWe're going to check out a few of the best picks from our screener tool.\n\nAs September 2025 unfolds, the U.S. stock market faces renewed volatility with major indices like the S&P 500 and Nasdaq Composite starting the month on a downward trend amid ongoing tech sector challenges and tariff uncertainties. Despite these headwinds, small-cap stocks remain an area of interest for investors seeking opportunities in undervalued segments that may benefit from insider activity and broader economic shifts.\n\nStory Continues\n\nOverview: Avidbank Holdings operates as a bank providing a range of financial services and products, with a market cap of $0.06 billion.\n\nOperations: Avidbank Holdings primarily generates revenue from its banking operations, which reached $82.09 million in the latest period. The company consistently reports a gross profit margin of 100%, indicating no cost of goods sold recorded. Operating expenses are significant, with general and administrative expenses being the largest component, totaling $44.38 million recently. The net income margin has shown variability over time, most recently at 28.67%.\n\nPE: 11.6x\n\nAvidbank Holdings has been making waves with a recent IPO raising US$60.03 million, positioning it as a promising player among smaller firms. Their financials show growth, with Q2 net income rising to US$5.8 million from last year's US$3.47 million, reflecting improved earnings per share from continuing operations at US$0.77 up from US$0.47 previously. Insider confidence is notable as executives have been purchasing shares consistently over the past year, signaling strong belief in future prospects despite shareholder dilution concerns earlier this year.\n\nAVBH Share price vs Value as at Sep 2025\n\nSimply Wall St Value Rating: ★★★★★☆\n\nOverview: Trinity Capital is a financial services company specializing in providing venture capital to growth-stage companies, with a market cap of approximately $0.68 billion.\n\nOperations: The company primarily generates revenue through its venture capital segment, with recent figures reaching $254.89 million. Operating expenses have shown a steady increase over the periods, with the latest reported at $63.47 million. The net income margin has fluctuated significantly, peaking at 1.73% and most recently recorded at 0.54%. Gross profit margins have consistently been reported at 100%, indicating that all revenue contributes directly to gross profit without any direct costs of goods sold being deducted.\n\nPE: 8.2x\n\nTrinity Capital, a smaller player in the financial sector, recently reported solid earnings growth with second-quarter revenue hitting US$69.48 million, up from US$54.64 million the previous year. Despite high-risk funding through external borrowing and no customer deposits, they show potential for growth with new leadership appointments aimed at expanding their Equipment Finance business in Europe. The withdrawal of a US$250 million equity offering suggests strategic financial maneuvering amid industry challenges and opportunities for value realization remain as earnings are projected to grow annually by 4.97%.\n\nTRIN Share price vs Value as at Sep 2025\n\nKey Takeaways\n\nDelve into our full catalog of 82 Undervalued US Small Caps With Insider Buying here.\n\nHold shares in these firms? Setup your portfolio in Simply Wall St to seamlessly track your investments and receive personalized updates on your portfolio's performance.\n\nTake control of your financial future using Simply Wall St, offering free, in-depth knowledge of international markets to every investor.\n\nReady To Venture Into Other Investment Styles?\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nCompanies discussed in this article include ALRS AVBH and TRIN.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com",
    "url": "https://finance.yahoo.com/news/undervalued-small-caps-insider-activity-113942474.html",
    "source": "newsapi",
    "author": "September, Min Read",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "million",
      "financial",
      "company",
      "services",
      "your",
      "income",
      "year",
      "despite",
      "share",
      "over"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:50.662878+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "4b17928dd2c8fca1de0b6d77dd8195b8",
    "title": "Klarna chairman sent a stark post-IPO message to CEO: 'We're 10 years behind Revolut'",
    "content": "Klarna went public on the New York Stock Exchange in September.\n\nKlarna went public on the New York Stock Exchange in September. Martin Öberg/ Klarna\n\nKlarna went public on the New York Stock Exchange in September. Martin Öberg/ Klarna\n\nlighning bolt icon An icon in the shape of a lightning bolt.\n\nlighning bolt icon An icon in the shape of a lightning bolt. Impact Link\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nAt Klarna's big employee conference last week in Stockholm, CEO Sebastian Siemiatkowski swapped spreadsheets for a rap performance and then confronted a sobering reality. Even as Klarna basks in its $15 billion IPO, chairman Michael Moritz warned staff of a rival: \"We are 10 years behind Revolut.\"\n\nThe Swedish fintech gathered about 3,000 employees in Stockholm for the convention, which featured keynote speeches, workshops, and team-building activities aimed at celebrating the company's recent milestones and boosting employee engagement.\n\nSiemiatkowski kicked off its \"Smoooth week\" with a lip-sync performance of a rap about Klarna, according to two current employees who spoke on condition of anonymity since they were not authorized to speak publicly.\n\nThe Klarna chief also spoke about the company's recent IPO milestone and the flood of congratulatory messages he had received. Among them was a stark text message from chairman Michael Moritz, which was displayed on a screen at the venue in Stockholm.\n\nAccording to a photo of the displayed message seen by Business Insider, Moritz told Siemiatkowski, \"Sebastian. As we celebrate 20 years, we need to remember we are 10 years behind Revolut.\"\n\nKlarna declined to comment.\n\nFounded in 2015, Revolut is a British neo-bank with over 52 million customers. What started as a prepaid foreign exchange card has rapidly grown into a wide-ranging financial platform, covering everything from banking and savings to investing, crypto, insurance, and business accounts. The company is now working toward its goal of becoming a full-service global bank.\n\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know\n\nWhile Klarna is a licensed bank in Sweden, its activities are largely limited to payments and short-term lending. But it launched a US debit card pilot in June to venture into traditional banking and lay the foundation for its \"super app\" ambitions.\n\nKlarna now has about 111 million users, and the vast majority of its business comes from the merchant-funded zero-percent interest financing it offers customers, Siemiatkowski told CNBC earlier this month. He also noted that Klarna sees a significant opportunity to disrupt the US credit card market.\n\nKlarna went public on the New York Stock Exchange earlier this month, raising about $1.37 billion. The offering valued the Swedish fintech at $15 billion.",
    "url": "https://www.businessinsider.com/klarna-ceo-chairman-ipo-message-behind-revolut-2025-9",
    "source": "newsapi",
    "author": "Jyoti Mann, Enter Your Email, Follow Authors, Never Miss A Story",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "klarna",
      "business",
      "exchange",
      "insider",
      "about",
      "went",
      "public",
      "york",
      "stock",
      "bolt"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:53.042940+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "8cbb790acea450024eba3450d35545f8",
    "title": "Top 5 Investments Boomers Should Make in Retirement — Even if It’s Begrudgingly",
    "content": "While baby boomers may prefer the comfort of traditional savings accounts and certificates of deposit (CDs), financial experts are urging retirees to embrace investments they might otherwise avoid.\n\nFor You: Here’s Why You Might Want To Invest Your Retirement Savings in a Roth 401(k)\n\nTrending Now: 4 Affordable Car Brands You Won't Regret Buying in 2025\n\nDespite market volatility concerns, these strategic moves could be crucial for protecting purchasing power and ensuring retirement funds last.\n\nKeep Some Growth Stocks (Yes, Really)\n\nRetirees need at least some stocks in their portfolios to ensure they don’t run out of money later, according to CNBC.\n\nWhile the instinct is to flee to bonds and cash, maintaining 30% to 40% stock allocation can help combat inflation over a 20-30-year retirement. Consider broad market ETFs or dividend-paying bluechips for steady growth without the stress of individual stock picking.\n\nBe Aware: 10 Bills That Drain Your Retirement Savings — and How To Cancel Them\n\nTreasury Inflation-Protected Securities (TIPS)\n\nWith inflation eroding purchasing power, investment options may include dividend-paying stocks, real estate investment trusts (REITs), inflation-protected bonds and Treasury inflation-protected securities (TIPS), according to Kiplinger. TIPS adjust their principal value based on inflation, making them essential protection against rising costs, even if their returns seem modest compared to traditional bonds.\n\nReal Estate Investment Trusts (REITs)\n\nMany boomers are house-rich but hesitant about real estate investments beyond their primary residence. REITs offer exposure to commercial real estate, healthcare properties and industrial facilities without the headaches of direct ownership. They typically provide higher dividend yields than traditional stocks while offering inflation protection.\n\nHigh-Yield Savings and Money Market Accounts\n\nMarket declines can threaten retirees’ income; investments like TIPS, annuities and high-yield savings accounts can protect principal, according to U.S. News. While these won’t make you rich, they’re offering competitive rates in 2025 and provide liquidity for emergencies — something many retirees overlook in favor of longer-term certificates of deposit (CDs).\n\nTarget-Date Funds (Post-Retirement)\n\nEach of the Target Retirement Funds invests in Vanguard’s broadest index funds, giving you access to thousands of U.S. and international stocks and bonds, according to Vanguard. Many boomers abandon these after retirement, but target-date funds designed for retirees automatically adjust allocations as you age, taking the guesswork out of rebalancing.",
    "url": "https://finance.yahoo.com/news/top-5-investments-boomers-retirement-125507372.html",
    "source": "newsapi",
    "author": "Fri, October, At Pm Gmt, Min Read",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "retirement",
      "savings",
      "retirees",
      "funds",
      "stocks",
      "while",
      "market",
      "their",
      "according",
      "bonds"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:54.300001+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "9ec107b71816ffd0d62913cfe2453600",
    "title": "Deutsche Bank Notices That a Needle Is Getting Dangerously Close to the AI Bubble",
    "content": "Money seems to endlessly flow in the AI space, whether it’s Nvidia announcing a $100 billion investment in OpenAI or OpenAI planning to build more massive data centers before the first $500 billion project is even completed. Eventually, some of the folks who have poured money into these ventures are going to expect to see some return on investment. According to a research note from Deutsche Bank, it’s getting harder and harder to see how that is going to happen.\n\nFortune reports that a note written by George Saravelos of Deutsche Bank warned that spending in the AI sector is “parabolic.” In fact, it is so vast, the researcher said, that it might single-handedly be propping up the American economy. “AI machines—in quite a literal sense—appear to be saving the U.S. economy right now,” he wrote. “In the absence of tech-related spending, the U.S. would be close to, or in, recession this year.” That checks out: earlier this year, the Wall Street Journal reported capital expenditure spending for AI contributed more to growth in the US economy than all consumer spending combined has so far this year.\n\nIf you want to narrow it down even further, you can. Saravelos pointed to chipmaker Nvidia specifically and says the company is “currently carrying the weight of U.S. economic growth.” All that has to happen for the company to continue shouldering the entirety of the economy on its back is for its growth to be endlessly exponential. No problem, right? “The bad news is that in order for the tech cycle to continue contributing to GDP growth, capital investment needs to remain parabolic. This is highly unlikely,” Saravelos warned.\n\nShoot.\n\nNow, you don’t really have to be an economist to know that it’s usually a bad idea to have all your eggs in one basket. But just in case, here is one to tell us: Torsten Sløk, the chief economist at asset management firm Apollo, wrote last week that “The bottom line is once again that there is an extreme degree of concentration in the S&P 500, and equity investors are dramatically overexposed to AI.”\n\nTo put some numbers to it, here’s some math from a recent report published by consulting company Bain & Company. The firm says that “AI’s compute demand grows at more than twice the rate of Moore’s Law,” and by 2030, the computing power needed to satisfy AI demand would come at a cost of two trillion dollars per year. “The world is still $800 billion short to keep pace with demand,” Bain & Co writes.\n\nPair that with the report that came out of MIT earlier this year, which found that just 5% of businesses that have adopted generative AI tools have managed to achieve “rapid revenue acceleration,” while the rest have largely fallen flat, and it becomes a little hard to see the case for profitability being just around the corner. But hey, who knows, maybe we’re just another small $500 billion investment away from making it all click. Any takers?",
    "url": "https://gizmodo.com/deutsche-bank-notices-that-a-needle-is-getting-dangerously-close-to-the-ai-bubble-2000663370",
    "source": "newsapi",
    "author": "Aj Dellinger, James Pero, Bruce Gil",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "year",
      "billion",
      "investment",
      "some",
      "spending",
      "economy",
      "growth",
      "company",
      "just",
      "more"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:56.591662+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": "2025-09-25T11:00:00+00:00"
  },
  {
    "id": "e66abd182f8d219ccc728ae9402508ab",
    "title": "3 S&P 500 Bank Stocks With More Than 4% Dividend Yield to Watch",
    "content": "With the Federal Reserve reducing interest rates and economic growth showing resilience, the outlook for the banking sector is turning more favorable. Lower borrowing costs will likely stimulate loan demand and consumer spending, while steady economic expansion will support credit quality and profitability.\n\nIn this favorable scenario, several S&P 500 banks, including KeyCorp KEY, Bank of Hawaii BOH, and Comerica CMA, offer solid dividend yields that stand out as appealing opportunities. Hence, given attractive income potential with solid fundamentals, these banks should remain on investors’ radar.\n\nTo choose these banks, we ran the Zacks Stocks Screener to identify stocks with a dividend yield in excess of 4%. Also, these stocks have a Zacks Rank of 2 (Buy) or 3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nFurther, all three bank stocks rose more than 10% in the past year, underscoring the market’s growing confidence in their earnings power and balance-sheet resilience.\n\nPrice Performance\n\nZacks Investment Research\n\nImage Source: Zacks Investment Research\n\n3 Bank Stocks With Solid Dividend Yield to Keep an Eye on\n\nKeyCorp, headquartered in Cleveland, OH, is one of the leading regional banks in the country. The company provides a wide range of products and services, such as commercial and retail banking, commercial leasing, investment management, consumer finance and investment banking products.\n\nKeyCorp is well-placed to benefit from solid loans and deposit balances, relatively lower interest rates, and a robust balance sheet. The company has been witnessing top-line growth over the past several years. Supported by decent loan demand, Fed rate cuts, and the company’s efforts to strengthen fee income, its top line is expected to keep improving.\n\nKeyCorp’s business expansion efforts are impressive. Given the buyouts/expansion initiatives, it has strengthened its product suites and market share. Though it is less likely to pursue any depository buyouts in the near term, the bank remains focused on acquiring entrepreneurial niche businesses, which will support fee income growth.\n\nAs of June 30, 2025, KEY had a total debt of $19.1 billion. Its cash and due from banks and short-term investments were $13.3 billion as of the same date. Given a decent liquidity position and earnings strength, capital distribution plans seem sustainable.\n\nThe company has a dividend yield of 4.4%. In the last five years, KeyCorp increased its dividends twice, with a payout ratio of 60%. It carries a Zacks Rank 3, at present.\n\nKeyCorp Dividend Yield (TTM)\n\nKeyCorp Dividend Yield (TTM)\n\nKeyCorp dividend-yield-ttm | KeyCorp Quote",
    "url": "https://finance.yahoo.com/news/3-p-500-bank-stocks-153800985.html",
    "source": "newsapi",
    "author": "September, Min Read",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "keycorp",
      "dividend",
      "zacks",
      "stocks",
      "banks",
      "yield",
      "bank",
      "solid",
      "investment",
      "growth"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:30:58.098566+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "d68bebe40164dbf6baea80e67b8e7113",
    "title": "Powell says AI may be hurting entry-level jobs: 'Hard to say how big it is'",
    "content": "Federal Reserve Chair Jerome Powell said it's difficult to determine how big of any effect AI is having on the job market.\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nFederal Reserve Chair Jerome Powell says there is evidence that AI is already upending the workforce.\n\n\"I think my view, which is also a bit of a guess, but widely shared, I think, is that you are seeing some effects but it's not the main thing driving it,\" Powell said during a news conference after the conclusion of the Fed's September meeting.\n\nOverall, Powell said his view is that AI is probably a factor affecting the job market for recent college graduates, but it is \"hard to say how big it is.\"\n\n\"It may be that companies or other institutions that have been hiring younger people right out of college are able to use AI more than they had in the past,\" he said. \"That may be part of the story. It's also part of the story, though, that job creation more broadly has slowed down.\"\n\nPowell is now one of the highest-profile figures to weigh in on the job displacement conversation that has upended Silicon Valley and split CEOs, some of whom lead the nation's largest AI companies.\n\nAnthropic CEO Dario Amodei sparked the debate earlier this summer when he told Axios that AI could wipe out half of all entry-level, white-collar jobs within the next one to five years. Ford CEO Jim Farley has also sounded a similar alarm.\n\nSome rival leaders, including OpenAI's Sam Altman, have questioned Amodei's prediction. (Altman spoke at a Fed conference earlier this summer.) Anecdotally, some companies, including JPMorgan and Klarna, have said AI is already leading them to reduce their headcount.\n\nIn previous testimony before Congress, Powell said that AI had the potential to significantly change the economy.\n\n\"I think it has enormous capabilities to make really significant changes in the economy, in the labor force,\" Powell said before the Senate Banking Committee in June. \"It can either augment people's productivity, or it can replace people, or it can do a little bit of both. But it's going to be something.\"",
    "url": "https://www.businessinsider.com/powell-ai-entry-level-jobs-market-2025-9",
    "source": "newsapi",
    "author": "Brent D. Griffiths, Enter Your Email, Follow Authors, Never Miss A Story",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "powell",
      "said",
      "some",
      "story",
      "think",
      "also",
      "companies",
      "federal",
      "reserve",
      "chair"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:31:01.196483+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  },
  {
    "id": "cf2adfde814ea0c9ddf6f2a298a2f5f7",
    "title": "Forget the September slump: Why this market continues to rally",
    "content": "0:05 spk_0\n\nWelcome to Stocks and Translation, Yahoo Finance's video podcast that cuts through the market mayhem, the noisy numbers, and the hyperbole to give you the information you need to make the right trade for your portfolio. I'm Jared Blickery, your host, and with me is Yahoo Finance's Allie Cannell, who's here to keep the discussion simple, accessible, and also lively. Today we're gonna be talking about theCooling labor market. If the Fed is once again too slow to cut rates and how to square that with a stock market that keeps hitting record highs. Our phrase of the day is the September effect. History says we're in the worst month of the year right now, and the weakness tends to come in the back half of the month. So how much do investors really need to care about history rhyming?And this episode is brought to you by the number 9.7. That's how many percentage points of pure profit you would have missed out on, had you panic sold after Liberation Day and missed the single best day of the year, how to make an investing plan that keeps you cool and calm when the headlines, they get scary.And today we're welcoming back Phil Rosen, co-founder of the Opening Bell Daily. He recently left Business Insider to build his independent data-driven markets outlet along with Anthony Pomliano, and he's also a published author, twice over, penning a collection of New York centric vignettes in lifeween moments, as well as a travel novel, everywhere but Home. So Phil, it is great to see you here.And uh we're gonna get to our phrase of the day, September effect in a minute. Just tell us how you're seeing the markets right now overall.\n\n1:35 spk_1\n\nSo, uh, first of all, thank you both for having me. It's great to be back. Um, the market right now, we have a lot of positive momentum and I think that is the, the twist in history right now. So typically we're going into September, very weak and very jittery and investors across the board are expecting this pull back, but I do think.This year, uh, you know, famous last words this time is different. However, uh, the rate cut on September 17th, which is pretty much guaranteed at this point, I think that is going to see markets finish higher in September, which is very unusual because I think in the last 10 years September's finished down 2% on average, and if you go back to 1950, it's down like 0.8% or something like that. Yeah,\n\n2:18 spk_0\n\nand so that's perfect. Let's get into our phrase of the day that would be the September effect.And this is the historical tendency for stocks to post returns that are weaker in September than the other months, and it's important to note that this is just a pattern based on history, which may or may not pan out, but I'm wondering how you think about seasonality in general, seasonality just being, you know,The same types of things, patterns that we see in the market happen year after year. How much do they play into your analysis?\n\n2:46 spk_1\n\nSo I think a lot of this, especially in September, is a self-fulfilling prophecy, right? Investors are expecting this September effect to take hold, but again,I don't know if it applies as much this year because this has also been one of the wildest, most eventful years in market history, and you know we all know this as reporters we're writing about it every day, but we have, uh, the Federal Reserve has been pushing back and forth with the White House. We have these tariffs and we have this now widely expected rate cut in a week. So all this, I think anything is uh up for grabs right now, but I, I don't think seasonality will have as much of a play.As history suggests, you\n\n3:28 spk_2\n\ncan even look at go away. That that trend did not work\n\n3:32 spk_0\n\nout. Yeah, well, I, and I've done, I've done some studies on this go away. It's more like hedge and may and go away. It's evolved over the years, but we've seen different patterns from like 1940s to 1980s versus 1980s to now.Um, you've said some interesting things here, and you mentioned the fact that this is a wild year, Phil, and I was looking at seasonality coming into the, uh, the Trump presidency, and you can do seasonality. You can slice it, uh, and dice it several different ways. And one of the ways is to look at what year of the presidential cycle we're in. This is the first year. This is Donald, even though it's his 2nd term, it's his first year of this term.And I got to tell you what happened around liberation Day completely destroyed the seasonality chart, and then the market kind of came back and it seemed like at the end of August, we were right on track again according to some models. But in general, just talk to us about, especially maybe as, as in terms of how you cover these markets, what you've seen and how this has surprised you this year, some of the wildcards.\n\n4:29 spk_1\n\nSo I, I think right now the S&P 500.Actually having a better than average year generally, but also a better than average post-election year. So all this is going against the, let's say the tariff doomers in the start of the year. Everyone thought tariffs would destroy the market. They thought the Fed independence battle that would also destroy the market, but pretty much investors have not even paid attention to this, uh, let's say when you zoom out. So I, I think, um.A lot of the bearishness has been sort of eked out of the market right now, and almost every single firm has turned bullish for the year, and uh this.The narrative of betting against the Bears, I think that is the story of the year because the Bears have been the loudest, certainly in the first half of the year, but all the Bulls have been the ones that ended up right.\n\n5:18 spk_2\n\nBut it is interesting to me as a reporter like you were saying, covering this day in and day out, there are a lot of bulls out there, but there also are more cautious voices even when we talk about rate cuts, Eddie Denny from your Denny Research, he's a fan of the show, friend of the show, and he said that maybe the Fed shouldn't be cutting right now, and that could actually maybe lead to a market melt up and there could be a lot of money running in here at a time when you haveInflation that's still hot. There's also this debate about whether or not we're not too heavy, too concentrated in the market. So it does feel like at the same time there are a lot of unknowns and there is this tension among strategists about what comes next.\n\n6:01 spk_1\n\nSo I think your Danny is definitely not alone in that view, right? And I read his research all the time. He's super smart. I will say our team at opening Bill Daily, we've pretty much been calling for a rate cut.It's about March. Um, so we do think the Fed has been slow to respond in policy, and I think the, the jobs report really confirmedthat.\n\n6:22 spk_0\n\nYeah, that was that was dismal in a lot of ways. And then we know, we learned retroactively that one of the months, a few months ago, I think it was June turned negative and that's always had it, had it been negative in June, we probably would have had a rate cut already. And so that kind of brings to the forefront the issue is Jerome Powell and the Fed a little bit too late? What do you think about that?\n\n6:42 spk_1\n\nI do think they are too late, but I don't think it's necessarily Jerome Powell's fault. I think it's a structural deficiency of the Fed because it's a backward looking institution, right? But markets move so rapidly the economy can change faster than we think, but the Fed is pretty much working with uh a backward looking.Mandate, right? And then also the data can be hit or miss on whether you believe it or not. Maybe not believe is not the right word, but it's always revised, right? So the Fed's working with a pretty difficult circumstance. So I, I, I don't know if it's necessarily Jerome Powell. I think if anyone was in theThat job, they would probably be late this year.\n\n7:20 spk_0\n\nYeah, I don't, I don't envy anybody in that slot. You just brought up the data and I'm wondering what you've, you've thought about all the controversy surrounding the BLS, um, and a lot of this comes from the fact that since the pandemic, peoplehaven't been responding to these government surveys and so there's, you can't, you can't rely on the data as much. The margin of error is greater. And so I think it's no surprise that we have June being revised negative. There's a, there's a huge uh leeway that you got to give this data. So what do you think about the issue that, um, you know, Trump has raised the question of integrity. Do you think that's an issue?\n\n7:56 spk_1\n\nSo I, I don't know if replacing the head of the BLS is going to change the integrity of the data. I think the data was pretty, um, let's say, uh, it was gonna be revised no matter who is in charge, right? So I don't know if Trump putting his own person in there is gonna improve or worsen the data because I, I think it's, again, these are very old, you know.Methods that they're using to track all this data and I for one, I try to look at alternative sources of data, try to accrue a bunch of different sources when I make my analysis on the market and I would never just rely on let's say the BLS to determine what I think is gonna happen next in the market.\n\n8:36 spk_2\n\nSo what are those sources of data for you.really inform your viewpoints when it\n\n8:40 spk_0\n\ncomes to what do you look at every morning? Yeah.\n\n8:42 spk_1\n\nSo I, I think anecdotally, um, I talked to a lot of people, so I talked to a lot of strategists, as you both do. I talked to a lot of economists, and I talked to people in hiring manager, manager positions, right? Are they hiring? Are they not hiring? Um, you know, I actually met this engineer the other day and um.He told me that, so he's been at this firm for about a decade, this is a big tech company, and he used to do 2 interviews a week. This was about a year and a half ago, and now he does about an interview per quarter, and to me that was like a very uh red flag, let's say on the labor market.\n\n9:17 spk_0\n\nI want to talk about some of the market stuff that we're seeing. concentration has been a big issue, you know, do we, is too much of the market's gain due to just a few companies and arguably it's been that case over the last few years. And the other thing is we're in the 3rd year of this bull market now.And that's typically, you don't see the gains that you saw in the first two years. I would say 23 and 24, we had gains of 20+% and the S&P 500, now we're looking, I think we're on track for 9 or 10, which is not bad, uh, for especially for a third year, but how do you see the concentration issue evolving?\n\n9:50 spk_1\n\nSo I, I do think that's a very um relevant issue to talk about, right? It's super concentrated we're at dotcom levels and that's certainly not a comparison you want to hear in any context. You never want to be compared to the dotcom bubble, um, but I, I think the difference today is that the companies that are at the top of this concentration, the mag 7, right, we've never seen companies this profitable with this large balance sheets.And that to me that does give some cushion to that concentration argument right that the earnings have justified it maybe, yes, I, I think earnings have definitely justified it and I don't know if that's gonna last for much longer, but up to this point, I don't think it's um let's say something we should be overly concerned about. And again, I, I think I've seen um.S&P 493 earnings are slowly gonna catch up in the coming quarters while Mag 7 slows down, so that is something I think worth monitoring as well. Yeah,\n\n10:43 spk_2\n\nand Torsten Stock from Apollo, our parent company, he did publish uh quite a bit of research about how concentrated we are in this market, and that's because of those hyper scalers and the data demand and how much CapEx they're spending.Given that we just finished wrapped up this latest earnings season, were there any little signs that maybe that demand is starting to weaken just just a little bit? I know Nvidia missed on data center revenue. Was that concerning to you at all?\n\n11:10 spk_1\n\nSo I'm not sure if I have much to say on the side of that, but I do know we've never seen this S&P 50.earnings calls mention AI, right? So that's, you know, on one hand, you can say, oh, there's a top signal, who knows? Um, and then we also have um data center spend is, that's, that's going to keep increasing for probably several more quarters. Um, so all these things, it's like the\n\n11:34 spk_2\n\nmining.\n\n11:39 spk_1\n\nYou could argue very convincingly that there is a lot of froth in the market right now with AI, with crypto, with some of these meme stocks, but also you could take the other side and say earnings have been phenomenal and they're projected to be phenomenal again in the 4th quarter. That's why\n\n11:56 spk_2\n\nI think this market's been a little confusing because you can argue both sides of that equation, and we talk about retail traders, unprofitable tech that that's been leading the meme stocks like you mentioned.They're sort of bleeding this market higher and dragging the institutions along with it. So that's been something that I, yeah,\n\n12:12 spk_0\n\nI see that too, Ali. Hold that thought though, because guess what, we got to take a short break. Coming up, we're going to break down the number that captures market regret and a runway battle between David and Goliath, but with stocks, of course.This episode is brought to you by the number 9.7% points. That's how much profit you would have missed out on had you sold at the Lowe's after that scary post-liberation Day sell off and missed the April 9th rally. So one day, nearly 10%, and Phil, I'm saying this because it kind of opens up a discussion in a market psychology and about staying invested, all these things that we like to talk about. How do you, how do you think about this phenomenon and how do you keep, how do you tune out the noise?That's all in the media.\n\n13:05 spk_1\n\nThat's a very difficult and timeless question. Um, I, I think if you are someone with a 30 year investing horizon, you can pretty much ignore the news, right? And I say that as someone who's in the news, um, and\n\n13:17 spk_0\n\nwho probably has a 30 year investment horizon.\n\n13:19 spk_1\n\nYes, yes, exactly. So, um, for myself, um.I do think that the day to day fluctuations of the market, maybe the tariff scares or the Fed independence scares, all this stuff, it's intense in the moment, but if you're looking decades in advance, odds are your portfolio will be just fine if you just leave it as is and and stick to your plans, stick to your dollar cost averaging all those things.\n\n13:42 spk_2\n\nYeah, and when we talk about the record highs that we've been seeing and Jared was just mentioning some of the returns that we've had over the past few years, and then you try and match that with the state of the US economy and post-COVID we did see a struggle with inflation really rampant. A lot of everyday Americans were underwater, yet we had these double digit gains in the stock market.So how, how do you really square that when it comes to assessing the status of the economy while also what we're seeing with stocks at record highs?\n\n14:16 spk_1\n\nThat's a great question. So we've seen this phrase a tale of two economies, right? I think you pretty much have your asset allocators and then those that aren't in the market, and there's really been a clear winner and loser story here. And um if youYou know, the short of it, if you've been in the market, you've done very well, and if not, your dollar has lost purchasing power dramatically over the last 5 years. I think since 2020 we've probably lost 25% to 28% of our 1 dollar's purchasing power. So that is very significant. And if you were in the market, then you've been able to keep up or beat that, um.Let's say loss in purchasing power, but if not, you really can't buy as much as you could. Um, so these are, uh, these are structural issues thatReally points to the importance of investing, I think, um, but it also points to the uh probably the widening inequality gapas well.\n\n15:09 spk_2\n\nMaybe the types of companies you invest in too, because those that are more exposed to that lower income consumer, they have been reporting a little bit more of astruggle.\n\n15:18 spk_0\n\nYou've brought up a great point. I want to launch off that because you, you sent us a chart a few hours ago. Dollar General and Dollar Tree, two companies that are known to do well when the consumer is feeling a little bit off andTheir pockets are a little bit pinched. They are outperforming most of the other retail companies, especially the big box retailers this year. Not only that, they're outperforming Nvidia. So talk to us about that phenomenon. What do you think ofthat?\n\n15:42 spk_1\n\nSo when I saw those numbers and I sort of put the stocks on a line chart.I was very shocked and uh because Nvidia is the story of the year, right? Everyone loves this stock, earnings are the Super Bowl, all this, but Dollar Tree and Dollar General are beating it by I think by double digit digits still. Um, and the CEO of Dollar Tree at the last earnings call said.The majority of their new customers in the last quarter were six figure households. So that, that's, I read that and it was a baffling stat because you wouldn't assume that a six figure, uh, you know, high income household is going to a dollar store. Um, and I will say I love dollar stores likewise, I, I love a dollar store, um.But that points to this sort of flights of value, right? So everyday consumers regardless of income bracket are looking to stretch their dollars more and that goes to the loss of purchasing power, it goes to inflation, it goes to high interest rates. So all these things, um, it is pointing to a constrained consumer, I think.\n\n16:40 spk_2\n\nYeah, and, and when you talk about the dollar, I mean, I think year to date we've lost about 10% compared to other types of currencies, and it's interesting to look at that and then look at gold, which is now at record highs right around, let's talk about gold bucks. I mean, where is that mostly foreign investors piling into gold? Is it the expectation of rate cuts? What, what do you think has been driving kind of that side of the market?\n\n17:03 spk_1\n\nThat's a great question. Um, I, I think part of it is a lot of governments and central banks are buying gold, right? China, Russia, yeah. So I think that's, uh, you know, I don't know what percent they're driving, but that's probably a huge chunk of it. And then you have, um, Bitcoin as well has seen a similar, very strong year. Um, so you have central bank and government buying, I think you have retail catching on to this gold trade.And then you also have the general narrative, I think of you want to hedge against dollar debasement and gold and Bitcoin are are the best ways to play that, according to most people.\n\n17:36 spk_0\n\nWhat do you think of all these Bitcoin treasury companies, not just Bitcoin. Now we're seeing Ethereum treasury companies, people piling into the micro strategy, which almost got just got in, uh, added to the S&P 5.didn't quite make it. But uh Solana too, what do you think of all this, all this phenomenon?\n\n17:52 spk_1\n\nFirst of all, I think with the micro strategy not getting added, there were definitely some politics at play there. Um, I don't know the details, but it was so eligible, right, but it didn't get picked. Um and as far as the the broader Bitcoin treasury trend, um, this, you could say from a very high level.Is a bet that the dollar will continue to lose its value and Bitcoin will continue to appreciate over time so why wouldn't want, why wouldn't you want your balance sheet to be denominated in the asset that's gonna appreciate rather than get debased? So I think very simply and from a very high level that's what we're looking at and again you might be.Able to point out some froth in the market because there's been a lot of these popping up and I, I think we're seeing other crypto assets being put on balance sheets as well so that also suggests uh OK, are we getting overextended here but uh right now uh.I think the the train is still gonna keep going.\n\n18:50 spk_0\n\nAll right, we got to get to our runway battle today because on who are better. We are crowning a market leader and we are pitting the mega cap giants against their small cap cousins. On the left catwalk struts the mega cap moat, armor plated balance sheets, thick margins, and a wardrobe of buybacks. When the lights flicker, these names don't flinch. They just tighten their costs and keep the cash flows of coming. On the right runway, we've got thisAll caps scramble, cyclical energy turnaround stories and tags that still say discount. When the economy accelerates and money gets cheaper, these names rip. But rate cuts are a double-edged sword because if the Fed is too late, small caps, they get torn to shreds, while large caps, well, they suffer too, but typically a bit less. So Phil, you don't need to pick a religion here. We just want to know which closet you're wearing and why, who wears it better over the next year, Mega cap moat or theSmall cap scramble.\n\n19:43 spk_1\n\nThat'sa, that's a hell of an intro. Um, I, I would say from this point to year end, if we get, let's say 2 to 3 rate cuts, I think small caps will do very well. They're very interest rate sensitive and I think, um, large caps, you could also argue are getting a bit overextended despite the earnings that have been sogood.\n\n20:01 spk_2\n\nWhat if we only get one this\n\n20:03 spk_0\n\nyear or 10. That's not a good sign.\n\n20:08 spk_1\n\nUm.One cut, I would probably lean more towards mega caps, but I don't think we'll only get one cut. I think we'll probably get 3 by by December, I think so.\n\n20:17 spk_2\n\nYeah. And what do you think we'll drive that the continued deterioration of the labor market, or do you think the inflation side of the picture if that comes in hot this week, could that maybe give the Fed some pause?\n\n20:27 spk_1\n\nI think even if inflation comes in hot, the Fed has pretty much conceded that they're gonna let inflation run hot so I think they're gonna look at the labor market and they're also of course the the political pressure whether you say they're buckling or not, it's definitely a factor. So I, I think they're gonna let inflation.Rise, even if, you know, whether it rise or not, they're not going to be worried about that right now.\n\n20:47 spk_0\n\nPhil, at the beginning of the show, I mentioned you are an accomplished author, and I have read your book Life Between Moments. I love it. Tell us about your journey into writing fiction and how that's kind of uh maybe jive with your job here at Morning Bell.\n\n21:02 spk_1\n\nThat's that's deep in the archives there. Um, I think writing fiction has helped me, uh, just be a better writer in general, right? It helps me use differentUm, literary tools in my financial reporting, and I think it makes me, uh, understand the psychology of things a bit better. And yeah, that book really, uh, I wrote it when I was at Business Insider, and, uh, I would go home after work and spend maybe 30 to an hour on it a day, finished it in a year, and then published it and uh it has nothing to do with markets, nothing to do with Wall Street, um, but it was a great passion.of mine at the time and I'm honored you even know about it. Hey,\n\n21:38 spk_0\n\nIencourage everybody to read it, download it, get the Kindle some great stories in there. All right, so what did we learn today? We talked about the September and that's the seasonality play. It's just a tendency. It doesn't mean you have to get all scared because September tends to close down, but we do have some other orange or yellow flash.Warning signs and some of those have to do with the fact that the Fed might be a little bit behind the eight ball. We got a deteriorating labor market. But what's most important is that investors keep their, uh, keep their head on their accounts and not necessarily responding to the news on a day by day basis, uh, because the, the market itself, the S&P 500, yes, it's concentrated, but we've seenThis concentrated persists for long periods of time over history. So that's gonna do it for today. We got to wind down things here at Stocks and Translation, but be sure to check out all our other episodes of our video podcast on the Yahoo Finance site and mobile app. We are also on all your favorite podcast platforms, so be sure to like, leave a comment, and subscribe wherever you get your podcast. We'll see you next time on Stocks in Translation.",
    "url": "https://finance.yahoo.com/video/forget-september-slump-why-market-100001329.html",
    "source": "newsapi",
    "author": "September",
    "language": "en",
    "country": null,
    "category": null,
    "tags": [],
    "tickers": [],
    "keywords": [
      "think",
      "right",
      "market",
      "about",
      "thats",
      "year",
      "been",
      "know",
      "what",
      "just"
    ],
    "entities": [],
    "sentiment": null,
    "relevance": null,
    "hotness": null,
    "source_credibility": 3,
    "credibility_score": null,
    "is_duplicate": -1,
    "collected_at": "2025-10-04T21:31:02.730949+00:00",
    "created_at": null,
    "updated_at": null,
    "published_at": null
  }
]